[
  {
    "url": "https://www.wikipedia.org",
    "text": "Wikipedia\nThe Free Encyclopedia\nEnglish\n6,967,000+ articles\n日本語\n1,454,000+ 記事\nРусский\n2 034 000+ статей\nDeutsch\n2.997.000+ Artikel\nEspañol\n2.017.000+ artículos\nFrançais\n2 671 000+ articles\n中文\n1,468,000+ 条目 / 條目\nItaliano\n1.908.000+ voci\nPortuguês\n1.145.000+ artigos\nPolski\n1 651 000+ haseł\nSearch Wikipedia\nEN\nAfrikaans\nالعربية\nAsturianu\nAzərbaycanca\nБългарски\n閩南語 / Bân-lâm-gú\nবাংলা\nБеларуская\nCatalà\nČeština\nCymraeg\nDansk\nDeutsch\nEesti\nΕλληνικά\nEnglish\nEspañol\nEsperanto\nEuskara\nفارسی\nFrançais\nGalego\n한국어\nՀայերեն\nहिन्दी\nHrvatski\nBahasa Indonesia\nItaliano\nעברית\nქართული\nLadin\nLatina\nLatviešu\nLietuvių\nMagyar\nМакедонски\nمصرى\nBahasa Melayu\nBahaso Minangkabau\nမြန်မာဘာသာ\nNederlands\n日本語\nNorsk (bokmål)\nNorsk (nynorsk)\nНохчийн\nOʻzbekcha / Ўзбекча\nPolski\nPortuguês\nҚазақша / Qazaqşa / قازاقشا\nRomână\nShqip\nSimple English\nSinugboanong Binisaya\nSlovenčina\nSlovenščina\nСрпски / Srpski\nSrpskohrvatski / Српскохрватски\nSuomi\nSvenska\nதமிழ்\nТатарча / Tatarça\nతెలుగు\nภาษาไทย\nТоҷикӣ\nتۆرکجه\nTürkçe\nУкраїнська\nاردو\nTiếng Việt\nWinaray\n中文\nРусский\n粵語\n Search\n Read Wikipedia in your language "
  },
  {
    "url": "https://www.bbc.com/news",
    "text": "Putin urged to prove Russia wants peace ahead of Trump talks\n\nThe UK and France challenge Russia's president to agree a ceasefire, ahead of Trump-Putin talks on Tuesday.\n\n1 hr ago\nEurope\nKing Charles meets Carney in symbolic support for Canada\n\nThe King, who is also head of state of Canada, meets the country's new prime minister Mark Carney amid a trade war with the US.\n\n41 mins ago\nUS & Canada\nWhite House denies defying judge's order over deportations to El Salvador\n\nAn order to halt the removal of 261 people came too late and had \"no legal basis\" anyway, the White House says.\n\n3 hrs ago\nWorld\nDeadline looms for Homeland Security to release Harry's US visa records\n\nA US judge ordered the prince's immigration record to be made public after a think tank alleged he lied about past drug use.\n\n3 hrs ago\nUS & Canada\nNo evidence for Trump claim about 'void' Biden pardons and autopen\n\nPresident Trump claims 'many' of Biden's pardons are void because they were signed automatically and not by hand.\n\n49 mins ago\nUS & Canada\nScientists at Antarctic base rocked by alleged assault\n\nA spokesperson for the South African government told the BBC there had been an assault at the station.\n\n4 hrs ago\nClimate\n'Stranded astronauts' Butch and Suni set to begin journey home\n\nThe Nasa astronauts prepare to head to Earth after an eight-day mission turned into nine months.\n\n5 hrs ago\nUS & Canada\nAngry protests after North Macedonia nightclub disaster\n\nPeople in Kocani blame corruption after 59 people - many of them teenagers - died in a nightclub inferno.\n\n4 hrs ago\nEurope\nRwanda severs ties with Belgium over 'neo-colonial delusions'\n26 mins ago\nWorld\nWatch: Tornado destruction in Missouri hits residents hard\n4 hrs ago\nUS & Canada\nLithuania accuses Russia over Ikea store fire in Vilnius\n7 hrs ago\nEurope\nWatch: Kate drinks Guinness, pets mascot in St Patrick's Day celebration\n3 hrs ago\nUK\nNetflix drama Adolescence hailed as 'flawless' TV\n6 hrs ago\nCulture\nMORE TO EXPLORE\nGetting through groundhog day - how Draper became Masters champion\n\nWhen Jack Draper retired injured again at the Australian Open, he had to be patient - and is now celebrating the biggest title of his career.\n\n10 hrs ago\nTennis\nWhat is the 1798 law that Trump used to deport migrants?\n\nThe wartime Alien Enemies Act has been controversially used to deport Venezuelans to a mega-jail in El Salvador.\n\n10 hrs ago\nWorld\n'I was close to dying' - West Ham star gives first interview since horrific car crash\n\nIn an exclusive interview with the BBC, West Ham forward Michail Antonio reflects on his near-fatal car crash in December.\n\n12 hrs ago\nWest Ham\nThe 'giant mega-shed' that has left neighbours in tears\n\nResidents say the 'megashed' towers over their homes, dominating the skyline and blocking the sun.\n\n12 hrs ago\nSuffolk\n'Everything is finished': Ukrainian troops relive retreat from Kursk\n\nFive soldiers tell the BBC of their withdrawal in the face of overwhelming firepower and drones.\n\n16 hrs ago\nEurope\n'I'm a little angry': Canadian firms boycott US products\n\nCanadian firms say there is a need for more homegrown production after tariffs imposed by the US sparked a trade war.\n\n22 hrs ago\nUS & Canada\nWatch: Survivors and relatives of fatal nightclub fire speak of their grief\n\nSurvivors and relatives of those who died in a fire in North Macedonia speak of their grief.\n\n1 day ago\nEurope\nALSO IN NEWS\nWatch: Carney meets Macron on first foreign visit as PM\n\nCarney described Canada as the \"most European of non-European countries\".\n\n7 hrs ago\nWorld\nShut vile death video site, bereaved UK families say\n\nFamilies want a website showing deaths of their loved ones to be taken down, as the online regulator gets new powers.\n\n22 hrs ago\nTechnology\nTaiwan revokes visa of pro-Beijing Chinese influencer\n\nThe woman has attracted criticism over videos calling for the unification of Taiwan with mainland China.\n\n12 hrs ago\nAsia\nFresh US strikes in Yemen with 53 now dead, Houthis say\n\nThe US said it launched a \"decisive and powerful\" wave of air strikes on Houthi targets on Saturday.\n\n15 hrs ago\nWorld\nTelegram founder allowed to leave France following arrest\n\nThe billionaire has been accused of failing to properly moderate his app to reduce criminality.\n\n7 hrs ago\nTechnology\nIndia and New Zealand relaunch free trade talks after a decade\n\nTrade talks had previously stalled due to differences over issues such as market access.\n\n11 hrs ago\nAsia\nNewcastle win Carabao Cup to end 70-year domestic trophy wait\n\nNewcastle beat Liverpool in Carabao Cup final at Wembley to win first major domestic trophy since 1955.\n\nMOST WATCHED\n1\nWatch: Kate drinks Guinness, pets mascot in St Patrick's Day celebration\n2\nKate attends St Patrick's Day parade in London\n3\nWatch: Tornado destruction in Missouri hits residents hard\n4\n'My sister died' - Nightclub survivors and relatives speak of grief\n5\nBBC Verify: Why was the North Macedonia nightclub fire so deadly?\nMOST READ\n1\nPutin urged to prove Russia wants peace ahead of Trump talks\n2\n'Everything is finished': Ukrainian troops relive retreat from Kursk\n3\nKing meets Carney in symbolic support for Canada\n4\nNo evidence for Trump claim about 'void' Biden pardons and autopen\n5\nScientists at Antarctic base rocked by alleged assault\n6\nDeadline looms for Homeland Security to release Harry's US visa records\n7\n'Stranded astronauts' Butch and Suni set to begin journey home\n8\nConor McGregor meets Trump at White House\n9\nNetflix drama Adolescence hailed as 'flawless' TV\n10\nThe 'giant mega-shed' that has left neighbours in tears\nSPORT\n'The party's not over yet' - inside Newcastle's celebrations\n\nMOTD pundit and Newcastle United legend Alan Shearer explains why his old club's EFL Cup final success to end their long wait for a trophy meant so much to him.\n\n3 hrs ago\nNewcastle\n'Nervous McIlroy's Players win sets him up perfectly for Masters tilt'\n\nRory McIlroy must celebrate his second Players Championship title before turning his focus to finally cracking Augusta National and completing the Grand Slam at next month's Masters, writes Iain Carter\n\n4 hrs ago\nGolf\nGetting through groundhog day - how Draper became Masters champion\n\nWhen Jack Draper retired injured again at the Australian Open, he had to be patient - and is now celebrating the biggest title of his career.\n\n10 hrs ago\nTennis\nMarseille condemn 'personal attacks' on Rabiot at PSG\n\nMarseille condemn the \"personal attacks\" aimed at midfielder Adrien Rabiot and his family during the 3-1 defeat at Paris St-Germain on Sunday.\n\n30 mins ago\nFootball\nMan Utd fans 'disappointed' by season ticket price increase\n\nManchester United season ticket prices will increase by about 5% for the third successive year as the club aims to become financially sustainable.\n\n2 hrs ago\nMan Utd\nI nearly died in car crash - Antonio's first interview\n\nIn an exclusive interview with the BBC, West Ham forward Michail Antonio reflects on his near-fatal car crash in December.\n\n12 hrs ago\nWest Ham\nBoxing set to win reprieve and stay as Olympic sport for LA 2028\n\nThe International Olympic Committee executive board recommends that boxing be included at the 2028 Games in Los Angeles.\n\n10 hrs ago\nOlympic Games\nSign up here\nCut through the noise with North America correspondent Anthony Zurcher's newsletter - in your inbox every Wednesday.\nSee more"
  },
  {
    "url": "https://www.nytimes.com",
    "text": "New York Times - Top Stories\n\nLIVE\n\nMarch 17, 2025, 5:47 p.m. ET\n11m ago\n\nJudge Seems Skeptical of U.S. Government’s Defense of Deportation Flights\n\nA Justice Department lawyer refused to answer questions from a judge trying to determine whether the White House violated a court order in deporting migrants.\n\nSee more updates ›\n\nU.S. Sheds Light on Why It Deported Doctor to Lebanon\n\nDr. Rasha Alawieh was detained in Boston and denied entry when returning from Lebanon. The government said she attended a Hezbollah leader’s funeral.\n\n3 MIN READ\n\nTierney L. Cross for The New York Times\n\nADVERTISEMENT\n\nSKIP ADVERTISEMENT\n\nTrump Administration\n\nMajor Moves\nTimeline of Tariffs\nDisappearing Words\nThe First 50 Days\n\nThe Call That Made U.S. Automakers Realize Trump Was Serious About Tariffs\n\nMany corporate leaders believed President Trump would use tariffs as a negotiating tool. As it turns out, he sees them as an end in themselves.\n\n7 MIN READ\n\nTrump Says Biden’s Pardons are ‘Void’ and ‘Vacant’ Because of Autopen\n\nPresident Trump claimed pardons issued by former President Biden were void in a social media post that embraced a baseless right-wing conspiracy theory.\n\n3 MIN READ\n\nBrett Carlsen for The New York Times\n\nWarned Against Meeting Voters, Republicans Holding Town Halls Confront Anger\n\n6 MIN READ\n\nDo Americans Approve of President Trump? We’re Tracking the Polls.\n\nRussia-Ukraine War\n\nPhotos\nRussia’s Kursk Region\n\nANALYSIS\n\nTrump-Putin Discussion to Focus on What Ukraine Will Lose\n\nIn an echo of the Yalta Conference in 1945, the American and Russian leaders will talk about who gets what in the process of ending the war in Ukraine.\n\n5 MIN READ\n\nTrump’s Plan to Discuss Ukraine’s Power Plants With Putin Prompts Questions\n\n4 MIN READ\n\nBettmann, via Getty Images\n\nGot a Tip? The Times offers several ways to send important information confidentially ›\n\nADVERTISEMENT\n\nSKIP ADVERTISEMENT\n\nHow A.I. Is Changing the Way the World Builds Computers\n\nBefore they can recreate the human brain, the leading A.I. companies need new chips, new data centers and more electricity than the world has to offer.\n\nThe Republicans Pushing Trump to Save Biden’s Clean Energy Tax Credits\n\n6 MIN READ\n\nThe New York Times\nThe Great Read\n\nLeading a Movement Away From Psychiatric Medication\n\nLaura Delano walked away from the treatments that defined her teens and 20s. Now, she’s hoping to create a road map for others to follow.\n\n13 MIN READ\n\nChristopher Capozziello for The New York Times\n\nMahmoud Khalil’s Detention\n\nWhat to Know\nWho Is Khalil?\nVideo: Khalil’s Arrest\nProtesters\n\nWhat’s Next for Mahmoud Khalil? A Fight to Keep His Case in New York.\n\nThe Trump administration’s effort to have his case heard in Louisiana could let some of America’s most conservative judges set a precedent on deportations.\n\n5 MIN READ\n\nBing Guan for The New York Times\n\nADVERTISEMENT\n\nSKIP ADVERTISEMENT\n\nGene Hackman’s Wife Died at Least a Day Later Than Originally Thought\n\nBetsy Arakawa made several calls to a medical clinic on Feb. 12, the day after the authorities initially believed that she died.\n\n4 MIN READ\n\nMark J. Terrill/Associated Press\n\nThe Women Most Affected by Abortion Bans\n\nAfter the Dobbs decision, births rose in states with bans, but more for some women than others, according to a new study.\n\n5 MIN READ\n\nLiz Moskowitz for The New York Times\n\nÉmilie Dequenne, Belgian Actress Who Starred in ‘Rosetta,’ Dies at 43\n\nShe won the Cannes Film Festival’s best actress award for her debut performance in 1999 and was later diagnosed with a rare adrenal gland cancer.\n\n2 MIN READ\n\nPatricia De Melo Moreira/Agence France-Presse — Getty Images\n\nADVERTISEMENT\n\nSKIP ADVERTISEMENT\n\nRwanda Cuts Ties With Belgium, Its Former Colonial Ruler\n\nBelgium pushed for the E.U. to impose sanctions against Rwandan officials over their role in invading eastern Congo and plundering its mineral wealth.\n\n3 MIN READ\n\nGuerchom Ndebo for The New York Times\n\nHarvard Will Make Tuition Free for More American Students\n\nHarvard is the latest elite school to announce that U.S. families with incomes of $200,000 and under will not pay tuition as a way to bolster diversity.\n\n4 MIN READ\n\nSophie Park for The New York Times\n\nConan O’Brien to Host the Oscars Next Year, Too\n\nMr. O’Brien received high marks for his work as the emcee of the 97th Oscar telecast this month. It was his first time hosting the show.\n\n2 MIN READ\n\nPhilip Cheung for The New York Times\n\nADVERTISEMENT\n\nSKIP ADVERTISEMENT\n\nOpinion\n\nKRISTEN SOLTIS ANDERSON\n\nTrump’s Poll Numbers Are Sagging. Here’s the Key Reason.\n\n6 MIN READ\n\nTHOMAS L. FRIEDMAN\n\nDemocracy Is on the Line in Israel and America\n\n2 MIN READ\n\nChip Somodevilla/Getty Images\n\nM. GESSEN\n\nThe Hidden Motive Behind Trump’s Attack on Trans People\n\n7 MIN READ\n\nIllustration by Sam Whitney/The New York Times\n\nMARGARET RENKL\n\nThe Blood Worm Moon and the Mustard Seed\n\n5 MIN READ\n\nMore News\n\nA Special St. Patrick’s Day Guest: The Head of King George V\n\nAt a show in Australia, the raucously political rap trio Kneecap brought what appeared to be the missing head of a King George V statue onstage.\n\n2 MIN READ\n\nAlone and Lost at Sea for 95 Days, a Peruvian Fisherman Clung to Hope\n\nMáximo Napa Castro, 61, was spotted by the crew of an Ecuadorean tuna boat after he set out from the Peruvian port of Marcona in December.\n\n3 MIN READ\n\nTimothy O'Connell for The New York Times\n\nANALYSIS\n\nNetanyahu’s Move to Fire Intelligence Chief Reflects Wider Push for Control\n\nThe effort is part of a dispute between Benjamin Netanyahu’s right-wing alliance and its opponents about the nature and future of the Israeli state.\n\n5 MIN READ\n\nNary a Critical Word: Bill Gates’s Close Bond With Narendra Modi\n\nThe relationship between the philanthropist and the Indian leader helps both men meet their missions. But it also papers over the erosion of rights under Mr. Modi.\n\n6 MIN READ\n\nThe Athletic\n\nSports coverage\nMore Sports Coverage\nPremier League\nNFL\nNBA\nChampions League\nTennis\nUK Women's Football\nFormula 1\nInternational Football\nWell\nCulture and Lifestyle\n\nOrville Peck Takes His Face Out for a Spin\n\nWhen the country singer landed a role in the splashy “Cabaret” revival, one question loomed large: Would he make his Broadway debut in a mask?\n\n4 MIN READ\n\nThea Traff for The New York Times\n\nAudio\n\nPodcasts and narrated articles\n\nGames\n\nDaily puzzles\n\nWordle\n\nGuess the 5-letter word with 6 chances.\n\nConnections\n\nGroup words that share a common thread.\n\nStrands\n\nUncover hidden words and reveal the theme.\n\nSpelling Bee\n\nHow many words can you make with 7 letters?\n\nThe Crossword\n\nGet clued in with wordplay, every day.\n\nThe Mini Crossword\n\nSolve this bite-sized puzzle in just a few minutes."
  },
  {
    "url": "https://www.cnn.com"
  },
  {
    "url": "https://www.theguardian.com",
    "text": "News\nUkraine\nTrump says he and Putin will discuss land and power plants in Ukraine ceasefire talks\nTrump says negotiators have already discussed ‘dividing up certain assets’ and that he will talk to Putin on Tuesday\n5h ago\nUSTrump administration pulls US out of body investigating Ukraine invasion\nEurope\nCarney visits Macron and Starmer as he seeks alliances amid Trump trade war\n1h ago\nUSAmericans increasingly worried about tariffs despite Trump’s assurances, new poll shows\nNorth Macedonia\nMourners protest against corruption after Kočani nightclub fire\nDemonstrators call for change and justice for 59 victims after tragedy blamed on multiple safety violations\n2h ago\nLGBTQ+ rights\nHungary’s government submits bill to ban Budapest Pride event\n9h ago\nAsylum\nMany victims of Channel dinghy tragedy could have been saved, inquiry lawyers say\n1h ago\nUkraine\nFrom London to Lviv: how Trump’s new world order has shaken Europe\n8h ago\nIreland\nConor McGregor anti-immigration rant in White House condemned by Irish PM\n2h ago\nEurope\nIsraelis moving to live in Europe ‘rejuvenating’ Jewish communities\n6h ago\nItaly\nSurrogate parents too afraid to return to Italy after ‘procreative tourism’ law\n4h ago\nSpecial report\nGaza\n‘I will spend my life rebuilding’: Gaza’s heritage sites destroyed by war\nPalestinian experts and British archaeologists say more than two-thirds of heritage, cultural and archaeological sites in Gaza have been damaged\n12h ago\nClimate crisis & environment\nBirds\nStorrington in West Sussex named UK’s first European stork village\n7h ago\nWeather tracker\nDeadly storms in US and rain hits Australian Grand Prix\nScience\nAnimal poo can be used to save endangered species from extinction, research finds\nUK\nGreen leader says Labour’s ‘growth v nature’ framing is an outrage\nEnvironment\nUK hopes to work with China to counteract Trump’s climate-hostile policies\nUkraine\nDestruction of Ukraine dam caused ‘toxic timebomb’ of heavy metals, study finds\nEnvironment\n‘All the birds returned’: How a Chinese project led the way in water and soil conservation\nUS\nEnvironmental groups sound new alarm as fossil fuel lobby pushes for immunity\nMore Europe news\nEuropean Union\nEU’s foreign policy chief laments US funding cuts to Radio Free Europe\n4h ago\nLithuania\nRussia behind arson attack on Ikea store in Lithuanian capital, says prosecutor\n5h ago\nFrance\nTelegram founder returns to Dubai as French inquiry continues\n11h ago\nEuropean Union\nItaly one of five ‘dismantlers’ causing ‘democratic recession’ in Europe, report says\nFrance\nFrench politician jokes US should return Statue of Liberty for siding with ‘tyrants’\n4h ago\nBooks\nNorwegian writer Dag Solstad dies aged 83\n10h ago\nPope Francis\nPope seen praying at hospital chapel in photo released by Vatican\nSport\nParis Olympics boxing gender row a result of Russian fake news, says IOC chief\nMore UK news\nLabour\nKeir Starmer to unveil drastic disability benefit cuts despite opposition\n1h ago\nFilm\nNoel Clarke accuser groped him playfully at film premiere, court told\n2h ago\nUK\nLucy Letby calls for public inquiry into baby deaths to be halted\n7h ago\nSociety\nDrag artist The Vivienne died of cardiac arrest caused by ketamine, family says\n2h ago\nCrime\nEx-scout leader convicted of child sex offences after 27 years on the run in Thailand\n6h ago\nMusic\nNeil Young rejects dynamic pricing for concert tickets, credits the Cure’s Robert Smith for decision\n9h ago\nBusiness\nCrispin Odey banned from City and handed £1.8m fine by FCA\n4h ago\nWater industry\nAppeal court rules in favour of £3bn bailout for Thames Water\n9h ago\nMore world news\nUS politics live\nJudge in Trump deportation case calls administration lawyers’ argument a ‘heck of a stretch’\n4m ago\nCanada\nSecond body identified in Canada landfill amid search for serial killer’s victims\n1h ago\nYemen\nDonald Trump: Iran will be held responsible for Houthi attacks\n5h ago\nUS\nTrump makes unsupported claim Biden pardons are ‘void’ as he used autopen\n7h ago\nNorth Sea\nNorth Sea collision: operation to clear up plastic pellets begins\n3h ago\nUS weather\nCleanup under way after massive storm barreled across at least eight US states\n5h ago\nAntarctica\nAntarctic researcher accuses colleague of death threat and assault\n7h ago\nUS\nEx-Project 2025 chief says Trump’s actions are beyond his ‘wildest dreams’\n6h ago\nIn focus\nHow many legal parents can a child have? The Dutch are asking the question\nMark Smith\n9h ago\nEnvironment\nHow Switzerland transformed its rivers\n12h ago\nUS\n‘Tesla is a good target’: Elon Musk’s car business is focus of fury for political role\n5h ago\nExplainers & analysis\nUS politics briefing\nUS president to speak to Putin this week; Democrats train fire on Musk\nUK politics\nHow far will Starmer risk pushing Labour MPs to swallow welfare cuts?\nUkraine war briefing\nZelenskyy replaces head of general staff of the armed forces\nBusiness\nThames Water on TV: pity the staff, this place is decrepit\nTrump briefing\nJudge orders deportation planes to be turned around\nAnalysis\nThe big question on Ukraine: is Trump ready to push Putin into peace?\nAnalysis\nElon Musk faces week of harsh setbacks amid Tesla selloff and Doge backlash\nAnalysis\nPutin makes clear Russia will only play ball with Ukraine by his rules\nFeatures\nArt\n‘I think my fetish furniture hampered my career’: Allen Jones on decades of controversy\n7h ago\nThe one change that worked\nI got out of my car in the middle of my commute and sat under the trees\n10h ago\nMore features\nFilm\nWhy are the most expensive Netflix movies also the worst?\n8h ago\nArt theft\nThe art expert did it: LGG Ramsey revealed as 1951 thief of Van Dyck painting\nArt\n‘The Polynesians loved him’: the astonishing revelations that cast Paul Gauguin in a new light\nLife\nIs it true that … apple cider vinegar can stop blood sugar spikes?\nTelevision\n‘We warned everyone: do not go near Tom Cruise!’ How Covid sent British TV haywire, five years on\nUS\nHow Amy Coney Barrett’s close friendship could affect the future of this major supreme court case\nTechnology\nLaughter not laptops: UK cafe culture fights back against keyboard invaders\nFashion\nThe look of the Irish: a ‘green wave’ takes over pop culture and fashion\nOpinion\nMany said the Starmer era would be just Tory-lite – now it’s worse than that. Time to stop the pretence\nNesrine Malik\nHe’ll be radical, the PM’s allies claimed. Well, look now, as the poor are targeted and ministers boast of wearing Tory clothes better than the Tories, says Guardian columnist Nesrine Malik\n…\ncomments\nDressing like a witch is in fashion – finally I am ahead of the curve\nEmma Beddington\nLike other middle-aged women, my wardrobe is predominantly made up of black, loosely fitting clothing, often worn backwards. I’m glad to see us represented in the witchcore trend.\n11h ago\n…\ncomments\nMore opinion\nLong Covid is the pandemic’s dark shadow. Why does no one in power in Britain want to talk about it?\nFrances Ryan\n…\ncomments\nReform UK would be a disaster for Wales – but its rivals have left the door wide open\nWill Hayward\n…\ncomments\nTrump is setting the US on a path to educational authoritarianism\nJason Stanley\n1h ago\nI was a lawyer for Ice. Mass deportations don’t make us safer\nVeronica Cardenas\nThe civil servant\nDear Keir Starmer: civil servants share your worries about public services. Don’t attack us – we’re keen for reform\nThe civil servant\n11h ago\n…\ncomments\nWhy is Gavin Newsom handing Steve Bannon a megaphone? It’s becoming clear\nMargaret Sullivan\n8h ago\nThe thin-obsessed world is growing more vicious by the minute. But fat people aren’t going anywhere\nRebecca Shaw\n…\ncomments\nFirst Dog on the Moon\nGiant ‘utes’ are ruining the landscape and rendering roads unpleasantly dangerous. They should be banned!\nEditorials\nThe Guardian view\nPope Francis: protecting a progressive legacy\n4h ago\nSport\nLa Liga\nCruellest week ends in despair for Simeone after Barça’s late flourish\nAtlético Madrid coach struggling to deal with last-gasp defeat just four days after shootout loss\n5h ago\n…\ncomments\nBundesligaSchick swoops to keep Leverkusen in title picture\nSerie AInter leave Atalanta black and blue in title battle\nSix Nations awards\nBox-office Bielle-Biarrey to decisive Daly: our writers' highlights\nFrom box-office Bielle-Biarrey to Daly denying France a shot at the grand slam, here is our selection of the highs and lows in 2025\n7h ago\n…\ncomments\nRobert KitsonFarrell has tricky decisions on Lions selection\nThe BreakdownSign up for our free rugby union email\nLiverpool have been utterly dominant. But cracks are emerging\nJonathan Wilson\n7h ago\n…\ncomments\nLiverpoolVan Dijk tells team ‘job is not done’ in title race\nFormula One\nAre McLaren team to beat? Five things we learned from Australian GP\n10h ago\n…\ncomments\nF1McLaren surprised by dominance in opener\nMore sport news\nGolf\nMcIlroy lays down Masters marker with Players Championship triumph\n8h ago\n…\ncomments\nMotoGP\nTitle race will be a Márquez family feud, says Marc after Argentina win\n11h ago\nPremier League\nTalking points from the weekend action\n…\ncomments\nFormula One\nMcLaren surprised by dominance in opener but warn there is more to come\nTennis\nDazzling Draper dismantles Rune to claim Indian Wells title\nEuropean club football\nInter extend lead in Serie A after win at title rivals Atalanta\nWomen's Super League\nCrystal Palace sink Aston Villa to cut gap at bottom of table\nCycling\nJorgenson joins cycling greats after defending Paris-Nice title\nIn depth\nBundesliga\nMr Stoppage Time keeps Leverkusen in title picture and revives licence to thrill\n9h ago\n…\ncomments\nVibrant Six Nations leaves Farrell with tricky decisions on Lions selection\nRobert Kitson\nInterview\n‘Boxing let me be angry’: Anna Whitwham\nFrance deserve Six Nations coronation but fall short of royal performance\nAndy Bull\n…\ncomments\nBehold the Mourinho Identity: maniacally self-serving but unbroken\nBarney Ronay\nFootball\nTen takeaways from Tuchel’s first England squad\nReal Madrid are a nightmare that Atlético can’t wake up from\nSid Lowe\n…\ncomments\nVilla have shot at greatness after setting up PSG showdown\nJonathan Wilson\nCulture\nHow we made\nDig! with the Brian Jonestown Massacre and the Dandy Warhols\n7h ago\n…\ncomments\nTelevision\nAdolescence: the powerful Netflix drama that could save lives\n9h ago\nWhat to watch\nFilm\nGator Creek review – blood-lust in the bayou with drug-crazed killer reptiles\n11h ago\nFilm\nBehind Closed Doors review – Brazil’s descent into authoritarianism laid brutally bare\nWeek in geek\nIs Sadie Sink’s casting in Spider-Man a sign that Marvel is looking to the future?\nBen Child\n10h ago\n…\ncomments\nFilm\nDirect Action review – French activist commune shows everyone how to make a protest count\n9h ago\nDocumentary films\nAntidote review – real-time film about those standing up to Putin is essential viewing\nFilm\nIt’s Not My Film review – relationship-crisis movie takes the long road through the Baltics\nFilm\nSister Midnight review – deliciously macabre Mumbai marriage-gone-wrong black comedy\nThe watcher\nHappy Face: this drama about a serial killer’s daughter is so mind-boggling it’s hard to tell if it’s real or fantasy\nWhat to listen to\nMusic\nPlayboi Carti: Music review – the most anticipated rap album this decade was worth the wait\n6h ago\nHonest playlist\nGraham Coxon: ‘I saw Robbie Williams and Danny Dyer doing Parklife. It’s flipping bizarre’\nBest podcasts of the week\nJohnny Vaughan’s banter is unbeatable\nPodcast\nToday in focus: The price of a perfect playlist\n22:49\nMusic\nMichael Kiwanuka review – big sounds from the quiet maestro\nMusic\nNova Twins on silencing the heavy metal doubters: ‘People don’t question men’\nMusic\nChappell Roan: The Giver review – saddle up, there’s a new sheriff in town\nMusic\nThe rise of Hot Dub Time Machine: ‘No matter how good a DJ is, you’re still pretending to be a musician’\n…\ncomments\nWhat to read\nBook of the day\nAlive: An Alternative Anatomy by Gabriel Weston review – our bodies in an eye-opening new light\nCarol Rumens's poem of the week\nThe Proletariat Speaks by Alice Dunbar-Nelson\n12h ago\n…\ncomments\nBooks\nScouse Republic by David Swift review – does Liverpool walk alone?\nReview\nBookish: How Reading Shapes Our Lives by Lucy Mangan review – never lost for words\nBooks\nMichael Lewis and John Lanchester: ‘Trump is a trust-destroying machine’\nShort stories\nStories of Ireland by Brian Friel review – a solid gold treat\nBook of the week\nCareless People: A Story of Where I Used to Work by Sarah Wynn-Williams review – a former disciple unfriends Facebook\nBooks interview\nRóisín Lanigan: ‘I moved to London and got bedbugs’\nWhat to play\nGames\nWanderstop review – a wonderful break from the pressure to win\nPushing Buttons\nFrom Neva to A Highland Song, the Baftas are a reminder of how creative games can be\nNewsletter\nGames review\nExpelled! – turning the tables on the private school class hierarchy\nGames\n‘A lot worse than expected’: AI Pac-Man clones, reviewed\nAtomfall\nThe survival game that draws from classic British sci-fi\nSurvey\nMaximum points: what is the most influential video game ever?\n…\ncomments\nVideo game simulation\nAre AI-generated video games really on the horizon?\nPushing Buttons\nThe Nintendo Switch revolutionised on-the-go gaming – can the PlayStation Portal do the same?\nNewsletter\nMore culture\nArt\nBorderline genius: how José María Velasco’s landscapes redefined perceptions of Mexico\n…\ncomments\nFilm\n‘Something must have gone wrong with us’: David Cronenberg and Howard Shore on four decades of body horror\n11h ago\nMusic\nA hike, a swim, then a full-on rave: is this Britain’s most remote club night?\nFilm\n‘Actually romantic and actually funny’: why When Harry Met Sally is my feelgood movie\n…\ncomments\nMusic\nWill Smith announces first album in 20 years, Based on a True Story\n11h ago\nOn my radar\nGeorgia Ellery’s cultural highlights\nCartoon\nTom Gauld on portents of doom\n10h ago\nTelevision\nActor Julianne Nicholson: ‘I would have loved to have been a nepo baby but alas’\nLifestyle\nWell actually\nWhy urea is the ‘unsexy’ hero of skincare\n6h ago\nA new start after 60\nI was fed up with overflowing bins – so I became a rubbish crusher\nRelationships\nPass notes\n‘My husband’s habits didn’t age well’: is bathroom divorce the key to a happy marriage?\n5h ago\nBlind date\nDid we kiss? After the night we had, it would’ve been rude not to\nSex\n‘I’d distract myself to avoid climaxing – until the day I said out loud, “I need to take the bins out”’\nThe moment I knew\nWe were running late, but his optimism was contagious\n…\ncomments\nExperience\nI moved in with my partner the day we met – now we’re married\n…\ncomments\nYou be the judge\nShould I let my boyfriend rip out the original features in our Victorian house?\n…\ncomments\nDining across the divide\nHe said you need strong leaders. Then he referenced Boris Johnson and Nigel Farage\nFamily\nThis story isn’t about the priest who abused me. It’s about my mother\nWellness\nWalking holidays\nWhy hiking long-distance trails in bite-size chunks is more fun\nTechnology\nVirtual reality goggles helped me on the path to physical recovery\nWell actually\nI moved to the sauna capital of the US. Could I take the heat?\nSexual healing\nMy boyfriend wants us to move in together – but I need my independence and his dog won’t let us have sex\nThe one change that worked\nI committed to therapy – and began to chip away at my grief and depression\nHow to build a better life\nYour inner voice is telling you something. If you listen closely, you may not like it\nConsumer affairs\nPregnant, forced to sit on a train floor – then unjustly fined for fare dodging\n…\ncomments\nFashion & beauty\nFashion\nJonathan Anderson to leave Loewe as fashion houses’ creative upheaval continues\n10h ago\nFashion\nSpecs appeal: why are ‘slutty little glasses’ suddenly everywhere?\nJess Cartner-Morley on fashion\n‘Meal prep’ your outfits for the week ahead and you’ll feel invincible\n…\ncomments\nSali Hughes on beauty\nNew beauty products that will give your skin a glazed look\nFashion\nHow Donatella Versace become a fashion icon\nFashion\nWhat to wear for spring gardening\nGallery\n3\nFashion Statement\nNine ways to copy the catwalk on a budget\nNewsletter\nFashion\nTennis courts, tailoring and pole dancers: Paris fashion week the key autumn/winter 2025 collections\nGallery\n16\nFood\nQuick and easy\nRukmini Iyer’s quick and easy recipe for green pea pulao with cardamom and almonds\n9h ago\n…\ncomments\nA kitchen in Rome\nRachel Roddy’s recipe for mushrooms stuffed with anchovies, breadcrumbs and herbs\n11h ago\n…\ncomments\nFood\nI tried the viral $20 strawberry. It tasted like the end of the American empire\nItalian food and drink\nJoe Trivelli’s recipes for carrots with wild garlic, pork tenderloin, rhubarb charlotte and cinnamon ice-cream\n…\ncomments\nBritish food and drink\nCheesy rarebit and mussels in cream: Will Devlin’s celeriac recipes to fill the hungry gap\n…\ncomments\nWaste not\nHow to use up leftover ham in delicious pasta rolls – recipe\n…\ncomments\nFood\nThe best healthy snacks to give your child without buying ultra-processed food\nThe new vegan\nMeera Sodha’s vegan recipe for Lebanese moussaka with five-garlic-clove sauce\n…\ncomments\nMore lifestyle\nConsumer affairs\nStrangers had sex in our Premier Inn hotel room while we were out\n…\ncomments\nTravel\nAvoid the White Lotus effect: Thailand travel without the tourists\nAlex Bellos's Monday puzzle\nDid you solve it? Here’s (not) looking at Euclid\n5h ago\n…\ncomments\nFlashback\nComic Lou Sanders: ‘I went around the houses trying to find my onstage persona. Turns out, it’s just me’\nTim Dowling's column\nI find gardening therapeutic until the roses rip me to shreds\n…\ncomments\nSmart shot\n‘I feel conflicted when I see navy recruits’: Spiro Bolos’s best phone picture\nThe Saturday quiz\nWhat links doorbell, Bath bun and nice-looking? The Saturday quiz\nTravel\n20 of the best spring breaks in the UK\nYou may have missed\nNigeria\n‘We are all Natasha’: senator’s sexual harassment claims roil Nigeria\nJohn Harris\n‘He nails it on the first take’: how the Beatles helped my autistic son find his voice\n…\ncomments\nChildren\nAre toddler snacks one of the scandals of our time?\n…\ncomments\nTake part\nProblems\nWhat are the irritating things that you would like to find a solution for?\nHousing\nShare how your experience of housing may have affected your political views\nCrypto\nHave you seen a scam online advert promoting fake crypto schemes?\nCostumes\nHave you completed a running event wearing an amusing costume?\nInspiration\nTell us about the life-changing decisions you have made inspired by art\nYoung country diary\nNature boys and girls – here’s your chance to get published by the Guardian\nNewsletters\nNews\nSign up for the First Edition newsletter\nNewsletter\nCulture\nSign up for The Long Wave newsletter: our weekly Black life and culture email\nNewsletter\nFood\nSign up for the Feast newsletter\nNewsletter\nFootball\nSign up for the Football Daily newsletter\nNewsletter\nEnvironment\nSign up for the Down to Earth newsletter\nNewsletter\nFashion\nSign up for the Fashion Statement newsletter\nNewsletter\nWomen's football\nSign up for the Moving the Goalposts newsletter\nNewsletter\nGlobal development\nSign up for the Global Dispatch newsletter\nNewsletter\nPictures of the day\nPhotos of the day\nSt Patrick’s Day in Ireland and Holi in India\nThe Guardian’s picture editors select photographs from around the world\nGallery\n17\nMost popular\nHide\nMost viewed\nWhat readers are clicking on\nConor McGregor anti-immigration rant in White House condemned by Irish PM\nIsraelis moving to live in Europe ‘rejuvenating’ Jewish communities\n‘My husband’s habits didn’t age well’: is bathroom divorce the key to a happy marriage?\nLive\nJudge in Trump deportation case calls administration lawyers’ argument a ‘heck of a stretch’ – live\nCarney visits Macron and Starmer as he seeks alliances amid Trump trade war\nLucy Letby calls for public inquiry into baby deaths to be halted\n‘Tesla is a good target’: Elon Musk’s car business is focus of fury for political role\nEx-scout leader convicted of child sex offences after 27 years on the run in Thailand\n‘Unnervingly on-the-nose’: why Adolescence is such powerful TV that it could save lives\nWhy urea is the ‘unsexy’ hero of skincare\nDeeply read\nWhat readers are spending time with (Learn more)\nSix Nations 2025 awards: our writers pick their tournament highlights\n‘The Polynesians loved him’: the astonishing revelations that cast Paul Gauguin in a new light\nFarage reprises his favourite moans at his latest not-so-special announcement\nGraham Coxon: ‘I saw Robbie Williams and Danny Dyer doing Parklife. It’s flipping bizarre’\nVibrant Six Nations leaves Andy Farrell with tricky decisions on Lions selection\nStrangers had sex in our Premier Inn hotel room while we were out\n‘Tesla is a good target’: Elon Musk’s car business is focus of fury for political role\nArne Slot needs Liverpool to wrest back control after chastening week\nLiverpool have been utterly dominant. But cracks are starting to emerge\nFrom sewage and scum to swimming in ‘blue gold’: how Switzerland transformed its rivers"
  },
  {
    "url": "https://www.forbes.com",
    "text": "BREAKING\n+1 day ago\nTrump Agrees U.S. Will Annex Greenland As Country Insists On Independence\n+1 day ago\nStock Market Slump: Dow Drops Over 500 Points, Nasdaq Falls As Trump Tariff Backlash Intensifies\n+1 day ago\nPutin Suggests Concessions Needed Before Agreeing To Ceasefire\n2 hours ago\nTesla Stock Slumps Again As Another Firm Warns Of Elon Musk-Led Firm’s ‘Sales Woes'\n3 hours ago\nHere’s How Trump’s Executive Orders Align With Project 2025—As Author Hails President’s Agenda As ‘Beyond My Wildest Dreams’\n5 hours ago\nTrump Ratchets Up Threats Against Iran Over Houthi Ties After Ordering Strikes Against Yemeni Rebel Group\n5 hours ago\nDid Trump Administration Ignore A Court Order? Judge Demands Trump Officials Explain\n9 hours ago\nDid Trump Administration Defy A Court Order? ACLU Wants Sworn Declarations On Whether Officials Ignored Immigration Ruling\n+1 day ago\nDid Trump Administration Defy Immigration Court Order? White House Claims Immigrants Sent To El Salvador Before Judge Blocked It—What To Know\n+1 day ago\nDid Trump Administration Defy Immigration Court Order? What To Know As White House Suggests Immigrants Deported Under Alien Enemies Act\nEurope Edition\nWEALTH\nHere’s Who Billionaires Think Is The Best President In U.S. History\n\nByPhoebe Liu, Forbes Staff\n\nForbes surveyed billionaires on their favorite president from American history. Here's who they picked, and hint—it's not Donald Trump.\nHere’s How Much American Billionaires Have Lost Since Trump’s Inauguration\n\nExpectations were that billionaires would be the big winners in a Trump America 2.0. Instead their fortunes have plummeted in the first eight weeks. Here are the biggest losers.\n\nQUOTE OF THE DAY\n\n“I am glad I paid so little attention to good advice. Had I abided by it I might have been saved from some of my most valuable mistakes.”\n\nEdna St. Vincent Millay, Poet\n\nSHARE THIS\nLatest\nMar 14, 2025\nFriday, March 14. Russia’s War On Ukraine: News And Information From Ukraine\nByKatya Soldak, Forbes Staff\nMar 14, 2025\n5 Places In Portugal That Are Great For Retirees\nByKathleen Peddicord, Contributor\nMar 13, 2025\nTrump Threatens 200% Tariff On EU Alcohol—Including French Wine\nBySara Dorn, Forbes Staff\nMar 12, 2025\nTrump Tariff Backlash: Canada, EU Retaliate Over Steel And Aluminum Tariffs (Updates)\nByMolly Bohannon, Forbes Staff\nMar 12, 2025\nRussia ‘Examining’ 30-Day Ukraine Ceasefire Plan Backed By Trump Administration\nByAntonio Pequeño IV, Forbes Staff\nMar 11, 2025\nTuesday, March 11. Russia’s War On Ukraine: News And Information From Ukraine\nByKatya Soldak, Forbes Staff\nMar 11, 2025\nUkraine Agrees To 30-Day Ceasefire Proposal—But Russia Hasn’t Accepted Yet\nByAntonio Pequeño IV, Forbes Staff\nMar 7, 2025\nFriday, March 7. Russia’s War On Ukraine: News And Information From Ukraine\nByKatya Soldak, Forbes Staff\nMar 7, 2025\nTrump Threatens Sanctions And Tariffs On Russia To End War—But Says Moscow May Be ‘Easier’ To Deal With Than Ukraine\nBySara Dorn, Forbes Staff\nMar 7, 2025\nTrump ‘Considering Large-Scale’ Sanctions And Tariffs On Russia To End War\nBySara Dorn, Forbes Staff\nMar 7, 2025\nThe Ultimate Guide To Croatia’s Islands, Dual Passport Tips And Other Travel News\nByPassport by ForbesLife, Forbes Staff\nMar 7, 2025\nWhat To Do In Ireland During Any Season\nByBrittany Anas, Contributor\nMar 7, 2025\nWhat To Do In Ireland During Any Season\nByBrittany Anas, Contributor\nMar 7, 2025\nWhat To Do In Ireland During Any Season\nByBrittany Anas, Contributor\nMar 6, 2025\nWhat To Do In Ireland During Any Season\nByBrittany Anas, Contributor\nMar 6, 2025\nEuropean Leaders React To U.S.-Ukraine Fallout: French Politician Calls Musk ‘Jester High On Ketamine’\nByConor Murray, Contributor\nMar 5, 2025\nRapper Offset Schedules Russia Concert Despite His Label’s Boycott Of The Country After Ukraine Invasion\nByConor Murray, Contributor\nMar 4, 2025\nTrump’s Speech: From Musk To Ukraine—Here’s What To Expect From His Address To Congress\nBySara Dorn, Forbes Staff\nMar 4, 2025\nChiefs Are Unlikely To Play In Germany During The Next Two Seasons\nByJeff Fedotin, Contributor\nMar 4, 2025\nChiefs Are Unlikely To Play In Germany During The Next Two Seasons\nByJeff Fedotin, Contributor\nMar 4, 2025\nSingapore Billionaire Peter Lim’s Son Appointed President Of Spain’s Valencia Football Club\nByYessar Rosendar, Forbes Staff\nTikTok BRANDVOICE | Paid Program\nBrands That Won Big On TikTok\nAvanade FORBES INSIGHTS | Paid Program\nYour Four-Part Blueprint To Unlock AI Value In 2025\nForbes Leadership Lessons On Financial Literacy\nPayPal BRANDVOICE | Paid Program\nThe Future Of E-Commerce\nThomson Reuters FORBES INSIGHTS | Paid Program\n4 Factors To Explore When Considering AI For Professional Work\nMoney\nInnovation\nLifestyle\nBillionaires\nLeadership\nAdvisor UK"
  },
  {
    "url": "https://www.reddit.com/r/AskReddit",
    "text": "Feed\nAbout\nRedditors, how do you feel a grassroots political movement dedicated solely towards ruining Elon Musk's life specifically would fare?\nu/EQandCivfanatic\n•\n8 hr. ago\nRedditors, how do you feel a grassroots political movement dedicated solely towards ruining Elon Musk's life specifically would fare?\nu/ARD-Mediathek\n•\nPromoted\nEntdecke die dunkle Seite der Gaming-Welt in der neuen Doku \"CRUNCH\". Jetzt in der ARD Mediathek streamen!\nardmediathek.de\nWatch Now\nWhat has gradually disappeared over the last ten years without people really noticing?\nu/Successful_Oil_3270\n•\n6 days ago\nWhat has gradually disappeared over the last ten years without people really noticing?\nWhat's the hardest part about learning to drive?\nu/Sad_Cow_577\n•\n2 hr. ago\nWhat's the hardest part about learning to drive?\nMillennials, what's y'all plan for retirement?\nu/alphaDsony\n•\n4 hr. ago\nMillennials, what's y'all plan for retirement?\nFor those of you who voted for Trump specifically because you hoped to avoid higher taxes, how has that decision affected your finances? Did things turn out as you had hoped? Why or why not?\nu/thhvancouver\n•\n6 days ago\nFor those of you who voted for Trump specifically because you hoped to avoid higher taxes, how has that decision affected your finances? Did things turn out as you had hoped? Why or why not?\nWhat do you think about anxiety attacks? Have you experienced it?\nu/Aldyyruiz\n•\n1 min. ago\nWhat do you think about anxiety attacks? Have you experienced it?\nPeople who have stopped going to church, what made you stop?\nu/lowly_shepherd\n•\n20 hr. ago\nPeople who have stopped going to church, what made you stop?\npeople who shower for 30+ minutes, wtf you be doin in there?\nu/Fabulous_Island_5621\n•\n5 days ago\npeople who shower for 30+ minutes, wtf you be doin in there?\nHow do we fight against the growing anti-empathy and anti-truth movement?\nu/Avaisraging439\n•\n8 hr. ago\nHow do we fight against the growing anti-empathy and anti-truth movement?\nu/ibm\n• Official\n•\nPromoted\nSind Sie bereit, Ihre Datenbewegung lösung übergreifend zu sichern und zu optimieren? Starten Sie Ihre 14-tägige Testversion mit IBM Aspera On Cloud.\nibm.com\nLearn More\nWhat's your favorite song most people haven't heard of?\nu/GodIsProbablyDead\n•\n2 hr. ago\nWhat's your favorite song most people haven't heard of?\nWhat do you reckon Trump is hoping to achieve by threatening to annex Canada, Mexico, Greenland?\nu/RevolutionaryMoney77\n•\n8 days ago\nWhat do you reckon Trump is hoping to achieve by threatening to annex Canada, Mexico, Greenland?\nWhat's the fanciest meal you could cook with ingredients you have at home now?\nu/Prestigious_Emu6039\n•\n2 min. ago\nWhat's the fanciest meal you could cook with ingredients you have at home now?\nWhat's an adult problem no one warned you about?\nu/lovelyyhelena\n•\n17 hr. ago\nWhat's an adult problem no one warned you about?\nWho's an actor who nailed a role so hard that nobody else will ever be able to live up to it?\nu/thepoutingmom\n•\n3 days ago\nWho's an actor who nailed a role so hard that nobody else will ever be able to live up to it?\n[Serious] What would you sacrifice to save the world?\nu/Safcfan1\n•\n5 hr. ago\n[Serious] What would you sacrifice to save the world?\nSerious Replies Only\nMusk keeps amplifying the impeachment of judges who rule against his doge policies, so what do any constitutional Republicans have to say about that?\nu/HeadSavings1410\n•\n3 days ago\nMusk keeps amplifying the impeachment of judges who rule against his doge policies, so what do any constitutional Republicans have to say about that?\nWhich celebrity would completely ruin your perception of them if you found out they were awful off-camera?\nu/Panda_Tushy\n•\n2 min. ago\nWhich celebrity would completely ruin your perception of them if you found out they were awful off-camera?\nWhat's small thing do poor people notice in middle class houses, that middle class people have no idea marks them as middle class?\nu/Guilty666\n•\n2 days ago\nWhat's small thing do poor people notice in middle class houses, that middle class people have no idea marks them as middle class?\nu/kingdomcomerpg\n•\nPromoted\nKrieger, Rebell, oder beides? Forme Heinrichs epische RPG-Geschichte.\n\nJetzt erhältlich\n\nkcd2.plaion.com\nPlay Now\nWhat's the worst pain that you've ever experienced?\nu/PrincessBananas85\n•\n2 hr. ago\nWhat's the worst pain that you've ever experienced?\nAs an American worker, how do you feel when Social Security is referred to as an entitlement program?\nu/misteakswhirmaid\n•\n6 days ago\nAs an American worker, how do you feel when Social Security is referred to as an entitlement program?\nWhat’s the most annoying part of being you?\nu/Exhausted_Skeleton\n•\n8 hr. ago\nWhat’s the most annoying part of being you?\nIs there a someone you've only met once but think of from time to time? What happened?\nu/karmaclast\n•\n7 hr. ago\nIs there a someone you've only met once but think of from time to time? What happened?\nMen who are 30+, what’s one lesson every guy should learn early?\nu/BigShow786\n•\n6 days ago\nMen who are 30+, what’s one lesson every guy should learn early?\nWhat's the most badass line in movie history?\nu/LassannnfromImgur\n•\n4 hr. ago\nWhat's the most badass line in movie history?\nwhat do you guys do to improve your mental health? what do you do to not think about the negative aspects of life?\nu/Mountain-Recording58\n•\n4 hr. ago\nwhat do you guys do to improve your mental health? what do you do to not think about the negative aspects of life?\nWhat’s a moment in history that proves humans never really learn from their mistakes?\nu/DiabloEclipse\n•\n6 hr. ago\nWhat’s a moment in history that proves humans never really learn from their mistakes?\nu/IONOS\n•\nPromoted\nNeue Website? In den Startlöchern! KI erstellt in Sekunden Layout, Texte und passende Bilder – ganz wie vom Profi. Inkl. persönlichem Berater.\nionos.de\nLearn More\nWhat do you think of the \"billionaires should not exist\" (meaning that no single individual should exclusively own that much money) argument?\nu/the_original_Retro\n•\n1 day ago\nWhat do you think of the \"billionaires should not exist\" (meaning that no single individual should exclusively own that much money) argument?\nIf you had the chance to rename yourself, what would be your name?\nu/midnightrain3896\n•\n9 hr. ago\nIf you had the chance to rename yourself, what would be your name?"
  },
  {
    "url": "https://www.medium.com"
  },
  {
    "url": "https://www.quora.com"
  },
  {
    "url": "https://www.ted.com",
    "text": "HEALTH\n\nWhy social health is key to happiness and longevity\n\nTECHNOLOGY\n\nHow are microchips made?\n\nCULTURE\n\nThe true story of the iconic tagline “Because I’m worth it.” | The Final Copy of Ilon Specht\n\nCREATIVITY\n\nWhat makes you “you”? An actor and a neuroscientist answer\n\nTECHNOLOGY\n\nAre smartphones ruining childhood?\n\nDiscover\n\nSee all\n\nTED-Ed\n\nPsychology\n\nLeadership\n\nEducation\n\nAI\n\nSleep\n\nMental Health\n\nBusiness\n\nMotivation\n\nCommunication\n\nPersonal Growth\n\nSports\n\nHealth\n\nLanguage\n\nRECOMMENDED FOR YOU\n17 MIN\n\nGLOBAL ISSUES\n\nWant to help someone? Shut up and listen!\n\nWhen most well-intentioned aid workers hear of a problem they think they can fix, they go to work. This, Ernesto Sirolli suggests, is naïve.\n\nErnesto Sirolli · 3.98M plays · 12 years ago\n\n10 MIN\n\nSOFTWARE\n\nWant to be happier? Stay in the moment\n\nWhen are humans most happy? To gather data on this question, Matt Killingsworth built an app, Track Your Happiness, that let people report their feelings in real time. Among the surprising results: We're often happiest when we're lost in the moment.\n\nMatt Killingsworth · 3.78M plays · 12 years ago\n\nLOVE\n\nWhy friendship can be just as meaningful as romantic love\n\nRhaina Cohen · 585K plays · 4 months ago\n\nHEALTH\n\nIs someone you love suffering in silence? Here's what to do\n\nGus Worland · 1.64M plays · 2 years ago\n\nBUSINESS\n\nGreat leadership is a network, not a hierarchy\n\nGitte Frederiksen · 1.88M plays · 2 years ago\n\nBUSINESS\n\nHow your brain responds to stories -- and why they're crucial for leaders\n\nKaren Eber · 2.14M plays · 4 years ago\n\nNEWEST FROM TED\nBrowse all Newest\n\n5 MIN\n\nCREATIVITY\n\nHow to see the future coming — and prepare for it\n\nJane McGonigal · 7 hours ago\n\n12 MIN\n\nBUSINESS\n\nWork is broken. Gen Z can help fix it\n\nAmanda Schneider · 3 days ago\n\n4 MIN\n\nEDUCATION\n\nThis is the most common way to get head lice\n\nNazzy Pakpour · 67K plays · 4 days ago\n\n6 MIN\n\nCLIMATE CHANGE\n\nA concrete plan for sustainable cement\n\nRyan Gilliam · 235K plays · 4 days ago\n\nPOPULAR ON TED\nBrowse all Popular\n\n9 MIN\n\nMEDIA\n\nCan you love your body — and still want to change it?\n\nGabriella Lascano · 428K plays · 3 months ago\n\n9 MIN\n\nBUSINESS\n\nForget the corporate ladder — winners take risks\n\nMolly Graham · 916K plays · 3 months ago\n\n12 MIN\n\nSCIENCE\n\nHow we're reverse engineering the human brain in the lab\n\nSergiu P. Pasca · 3.8M plays · 3 years ago\n\n14 MIN\n\nSCIENCE\n\nHow language shapes the way we think\n\nLera Boroditsky · 24M plays · 7 years ago\n\nAre you looking for bold ideas?\n\nDive into the intersections of tech, science and creativity at TED2025. This is your chance to discover cutting-edge ideas, deep connections and moments of awe alongside the world’s brightest minds.\n\nLearn more\nTRENDING IDEAS\n\nAI\n\nGain a deeper understanding of AI and its impact on our world — uncover its potential, and feel inspired to tackle this transformative field.\n\nBrowse all AI\n\nTECHNOLOGY\n\nAn AI artist's take on tech and legacy\n\nGrowing up in Poland under communist rule, artist Agnieszka Pilat has always found hope and freedom in technology. Accompanied onstage by the infamous quadruped robot Spot, she explains why humanity is like a collective parent to AI, making the case that machines are our legacy — and warning us not to let techno-pessimism turn into a self-fulfilling prophecy.\n\nAgnieszka Pilat · 1 year ago\n\n9 MIN\n\nTECHNOLOGY\n\nAI could increase equality — if we design it right\n\nPhebe Vayanos · 1 year ago\n\n8 MIN\n\nTECHNOLOGY\n\nWhy we need open-source AI\n\nHeather Meeker · 1 year ago\n\nTED-Ed\n\nTED-Ed's captivating video animations ignite curiosity and make complex topics irresistibly engaging. Come scratch your itch to learn.\n\nBrowse all TED-Ed animations\n\nEDUCATION\n\nThis is Sparta: Fierce warriors of the ancient world\n\nIn ancient Greece, violent internal conflict between border neighbors and war with foreign invaders was a way of life, and Greeks were considered premier warriors. Sparta, specifically, had an army of the most feared warriors in the ancient world.\n\nCraig Zimmer · 4M plays · 13 days ago\n\n4 MIN\n\nSCIENCE\n\nWhy neutrinos matter\n\nSílvia Bravo Gallart · 450K plays · 13 days ago\n\n5 MIN\n\nCULTURE\n\nWhy should you read Virgil's \"Aeneid\"?\n\nMark Robinson · 1M plays · 13 days ago\n\nPsychology\n\nGrab a front-row seat to unravelling the mysteries of the human mind and embark on a journey of self-discovery.\n\nBrowse all Psychology\n\nEDUCATION\n\nIs telekinesis real?\n\nTelekinesis, the ability to manipulate matter with the mind alone, is a trait exhibited by some of the most iconic fictional characters, including Neo, Yoda, and, of course, Carrie. But is this mind control actually possible in real life? Emma Bryce subjects telekinesis to the scientific method.\n\nEmma Bryce · 5.2M plays · 2 months ago\n\n4 MIN\n\nCLIMATE CHANGE\n\nWhat is the tragedy of the commons?\n\nNicholas Amendolare · 3.2M plays · 9 months ago\n\n15 MIN\n\nTECHNOLOGY\n\nWhat if AI could spot your lies?\n\nRiccardo Loconte · 323K plays · 2 months ago\n\nTRENDING TEDX IDEAS\n\n1\n\nMUSIC\n\n\"Family Tree\"\n\nInara George · 254K plays · 13 years ago\n\n4\n\nTECHNOLOGY\n\nHow to build an information time machine\n\nFrederic Kaplan · 1.3M plays · 11 years ago\n\n2\n\nTECHNOLOGY\n\nCrowdsource your health\n\nLucien Engelen · 353K plays · 13 years ago\n\n5\n\nGLOBAL ISSUES\n\nThe universal anesthesia machine\n\nErica Frenkel · 435K plays · 13 years ago\n\n3\n\nENTERTAINMENT\n\nA moving song from women in prison for life\n\nThe Lady Lifers · 1.5M plays · 10 years ago\n\n6\n\nTECHNOLOGY\n\nHow we found the worst place to park in New York City -- using big data\n\nBen Wellington · 1.1M plays · 10 years ago\n\nIdeas change everything.\n\nTED is a nonprofit that shares educational and inspiring ideas with billions of people worldwide to catalyze change across individuals, communities and ultimately, humanity.\n\nLearn more about TED\nCOUNTDOWN: TAKE ACTION ON CLIMATE CHANGE\nBrowse all Sustainability\n\nCLIMATE CHANGE\n\nHow to finance the future of farming\n\nBerry Marttin · 259K plays · 12 days ago\n\nENVIRONMENT\n\nHow to live with fire\n\nOral McGuire · 504K plays · 11 months ago\n\nCLIMATE CHANGE\n\nHow to supercharge renewables and energize the world\n\nRebecca Collyer · 725K plays · 1 year ago\n\nPOPULAR PODCAST EPISODES\nBrowse all Podcasts\n\n18 MIN\n\nCOMMUNICATION\n\nReducing toxic polarization – one conversation at a time\n\nDave Isay · 392K plays · 8 months ago\n\n26 MIN\n\nLITERATURE\n\nTED Talks Daily Book Club: Horse Barbie\n\nGeena Rocero · 408K plays · 9 months ago\n\n31 MIN\n\nCULTURE\n\nFixable Live - A conversation with Scott Galloway\n\nFixable · 439K plays · 9 months ago\n\n62 MIN\n\nENTERTAINMENT\n\nCarrie Brownstein\n\nDesign Matters with Debbie Millman · 513K plays · 9 months ago\n\nMULTILINGUAL TED TALKS, ADAPTED BY PANJAYA AI\n\n14 MIN\n\nSCIENCE\n\nHow language shapes the way we think\n\nLera Boroditsky · 24M plays · 7 years ago\n\n12 MIN\n\nSOCIAL CHANGE\n\nHow to fix a broken heart\n\nGuy Winch · 17M plays · 7 years ago\n\n6 MIN\n\nCULTURE\n\nHow books can open your mind\n\nLisa Bu · 6.8M plays · 12 years ago\n\n11 MIN\n\nCULTURE\n\nThe beauty of human skin in every color\n\nAngélica Dass · 3M plays · 9 years ago\n\nNewsletters\nGet talks sent to your inbox based on your interests.\nWEEKLY\nTED Recommends\nTED, tailored for you\n\nSelect\n\nDAILY\nTED Talks Daily\nThe latest from TED\n\nSelect\n\nWEEKLY\nTED-Ed\nLearn something new\n\nSelect\n\nBIWEEKLY\nTED Tech\nTech news, talks + more\n\nSelect\n\nWhat is your email?\n\nSubscribe now\n\nBy subscribing, you accept the terms of TED's Privacy Policy"
  },
  {
    "url": "https://www.nationalgeographic.com",
    "text": "SKIP TO CONTENT\nLOGIN\nNewsletters\nSUBSCRIBE\nMENU\nLATEST STORIES\nSubscribe for full access to read stories from National Geographic.\nTODAY'S PICKS\nHow to travel like a local in Japan\nTRAVEL\nHow to travel like a local in Japan\nHere’s why white sneakers are actually pretty great travel shoes\nLIFESTYLE\nHere’s why white sneakers are actually pretty great travel shoes\nEverything you should know before visiting Japan\nTRAVEL\nEverything you should know before visiting Japan\nWhy the equinox ushers in the arrival of spring\nSCIENCE\nWhy the equinox ushers in the arrival of spring\nTop 10 things to do in Japan\nTRAVEL\nTop 10 things to do in Japan\nPSA: Never pick up a wild animal—especially a baby wombat\nANIMALS\nPSA: Never pick up a wild animal—especially a baby wombat\nSEE MORE\nThe truth behind 5 St. Patrick’s Day symbols\nHISTORY & CULTURE\nThe truth behind 5 St. Patrick’s Day symbols\nREAD\nThe shaky science behind trendy ‘super greens’ powders\nHEALTH\nThe shaky science behind trendy ‘super greens’ powders\nREAD\nDrinking chlorophyll is a popular wellness trend. Does it really work?\nHEALTH\nDrinking chlorophyll is a popular wellness trend. Does it really work?\nREAD\n\nOCEANXPLORERS\n\nIn this series from James Cameron, go aboard the OceanXplorer—the most advanced research vessel ever built—to investigate the farthest frontiers of the world’s oceans. Armed with advanced technology, a handpicked team of intrepid explorers and scientists embark on a global odyssey to solve some of the ocean’s greatest mysteries through the lives of its animals and their ecosystems.\nSTREAM NOW\nDISCOVER MORE ON DISNEY+\nSEE SHOWS\nOceanXplorers\nSharkfest\nSOTO\nPhotographer\nQueens with Angela Bassett\nArctic Ascent with Alex Honnold\nThe Space Race\nA Real Bug's Life with Awkwafina\nIncredible Animal Journeys with Jeremy Renner\nTheMissionKeyArtDisneyPlusCard\nAnimals Up Close with Bertie Gregory\nSecrets of the Elephants\nThe Territory\nSharkFest\nWild Life\nExtraordinary Birder with Christian Cooper\nNAT GEO TV\nprevious\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nWATCH NOW\nnext\nTRAVEL\nExperience Legendary Places\nExperience Legendary Places\nVIEW TRIPS\nDiscover the Wonders of the Ocean\nDiscover the Wonders of the Ocean\nVIEW EXPEDITION CRUISES\nSee Europe from a New Perspective\nSee Europe from a New Perspective\nVIEW RIVER CRUISES\nLATEST STORIES\nHow to travel like a local in Japan\nTRAVEL\nHow to travel like a local in Japan\nEverything you should know before visiting Japan\nTRAVEL\nEverything you should know before visiting Japan\nTop 10 things to do in Japan\nTRAVEL\nTop 10 things to do in Japan\nHow waves of immigration have created culinary magic in Tampa\nTRAVEL\nHow waves of immigration have created culinary magic in Tampa\nThe 31 best Greek islands to visit in 2025\nTRAVEL\nThe 31 best Greek islands to visit in 2025\nSEE MORE\nMARCH 2025 ISSUE\nSubscribe to see the stories from National Geographic magazine\nThe Viking age is welcoming a new kind of hero: women\nHISTORY & CULTURE\nThe Viking age is welcoming a new kind of hero: women\nREAD\nThe epic journey of Canada’s last (and only) reindeer\nANIMALS\nThe epic journey of Canada’s last (and only) reindeer\nREAD\nSubscribe to National Geographic\nSubscribe to National Geographic\nLEARN MORE\nIN THIS ISSUE\nAre these the last days of Brazil's realm of hidden wonder?\nENVIRONMENT\nAre these the last days of Brazil's realm of hidden wonder?\nHunting for one of the rarest butterflies—named after her father\nHISTORY & CULTURE\nHunting for one of the rarest butterflies—named after her father\nHere's how you sculpt a medieval statue in the 21st century\nHISTORY & CULTURE\nHere's how you sculpt a medieval statue in the 21st century\nThe starlight we see is as old as Earth’s ancient rocks\nPHOTOGRAPHYPROOF\nThe starlight we see is as old as Earth’s ancient rocks\nThis monstrous mama laid the world’s largest egg\nANIMALS\nThis monstrous mama laid the world’s largest egg\nSEE ALL\nNATIONAL GEOGRAPHIC SOCIETY MISSION\nNational Geographic’s nonprofit work\n\nNational Geographic Society funds the best and brightest individuals dedicated to scientific discovery, exploration, education and storytelling to illuminate and protect the wonder of our world. National Geographic Explorers are continuing to push the boundaries of knowledge, uncovering new insights about the natural and cultural worlds, and strengthening our connection to them and one another.\n\nTara Roberts sheds light on the untold history of the slave trade\nIMPACTINTO THE DEPTHS\nTara Roberts sheds light on the untold history of the slave trade\nNoel Kok and Pragna Parsotam-Kok are refocusing African storytelling\nIMPACT\nNoel Kok and Pragna Parsotam-Kok are refocusing African storytelling\nPaul Salopek is on a foot journey across the world.\nIMPACTOUT OF EDEN WALK\nPaul Salopek is on a foot journey across the world.\nDISCOVER MORE\nTHE BEST OF NATIONAL GEOGRAPHIC DELIVERED TO YOUR INBOX\nSign up for more inspiring photos, stories, and special offers from National Geographic.\nSIGN UP\nLEGAL\nTerms of Use\nPrivacy Policy\nInterest-Based Ads\nEU Privacy Rights\nCookie Policy\nManage Privacy Preferences\nOUR SITES\nNat Geo Home\nAttend a Live Event\nBook a Trip\nBuy Maps\nInspire Your Kids\nShop Nat Geo\nVisit the D.C. Museum\nWatch TV\nLearn About Our Impact\nSupport Our Mission\nMasthead\nPress Room\nAdvertise With Us\nJOIN US\nSubscribe\nCustomer Service\nRenew Subscription\nManage Your Subscription\nWork at Nat Geo\nSign Up for Our Newsletters\nContribute to Protect the Planet\nFOLLOW US\nUnited States (Change)\n\nCopyright © 1996-2015 National Geographic Society\nCopyright © 2015-2025 National Geographic Partners, LLC. All rights reserved\n\nYour Privacy Settings\nWe and our partners store and/or access information on a device, such as unique IDs in cookies to process personal data. We work with 878 partners. You may accept or manage your choices by clicking below, including your right to object where legitimate interest is used, or at any time through the “Manage Privacy Preferences” link on each page. These choices will be signaled to our partners and will not affect browsing data. For additional information, please visit our Cookie Policy.\nWe and our partners process data to:\n\nStore and/or access information on a device. Precise geolocation data, and identification through device scanning. Personalised advertising and content, advertising and content measurement, audience research and services development.\nList of Partners (vendors)\n\nI Accept\nShow Purposes\nContinue without Accepting"
  },
  {
    "url": "https://www.imdb.com/news",
    "text": "Top News\nOscars: Conan O’Brien to Return as Host in 2026\nConan O’Brien, the beloved comedian, writer and producer who hosted the 97th Oscars telecast on March 2, has agreed to return and host the 98th Oscars telecast on March 15, 2026, the Academy of Motion Picture Arts and Sciences announced Monday.\n\nThe O’Brien-hosted Oscars generated many rave reviews (THR’s TV critic was high on O’Brien, if not the telecast overall), attracted a five-year high in both total viewers (19.69 million) and adults 18-49 (4.54 rating), and ranked as the No. 1 primetime entertainment telecast in both total viewers and adults for the 2024-25 season. It also generated 104.2 million total social interactions, ranking as the No. 1 most-socialed TV program season-to-date, outperforming both the Grammys (102.2 million) and the Super Bowl (62.4 million) for the first time.\n\nAlso returning alongside O’Brien: executive producers Raj Kapoor and Katy Mullan (who served in those capacities for the last two telecasts) and producers Jeff Ross and Mike Sweeney.\n\nConan...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Scott FeinbergThe Hollywood Reporter - Movie News\n‘Snow White’ First Reactions Praise Film as a ‘Visual Feast’ and One of Disney’s ‘Best Live-Action Remakes in Years’\nDisney’s live-action “Snow White” remake has finally been unveiled at the movie’s Hollywood premiere, and first reactions are trickling in calling it a dazzling hit for the House of Mouse.\n\nVariety film reporter Katcy Stephan praised star Rachel Zegler as “a shining supernova,” adding that the film is a “visual feast with show-stopping new musical numbers and, of course, dozens of enchanting animated animals. The screenplay wisely gives its heroine newfound depth through her fervent desire to become the leader her father believed she could be, and a love story that’s sweet as apple pie.”\n\nOnline critic Christopher Rates It wrote of the film, “‘Snow White’ is not only one of their best live-action remakes in years, but it’s also a film that recaptures the magic of the 1937 movie. Rachel Zegler Is Snow White, and she delivers such a magical performance.”\n\nFilmhounds editor Paul Klein echoed the praise with one caveat,...\nSee full article at Variety - Film News\n3/17/2025by Zack SharfVariety - Film News\nÉmilie Dequenne, Cannes Best Actress Winner for ‘Rosetta,’ Dies at 43\nÉmilie Dequenne, the Belgian actor who won a Cannes Film Festival prize for her breakout role in the Dardenne Brothers’ 1999 film “Rosetta,” died on Sunday. She was 43.\n\nDequenne’s family confirmed to French news agency Afp (via The Guardian) on Sunday night that she died of a rare cancer in a hospital just outside Paris. She revealed in October 2023 that she had been diagnosed with adrenocortical carcinoma, a cancer of the adrenal glands in the kidney.\n\nBorn in Belœil, Belgium on Aug. 29, 1981, Dequenne was just 18 when she broke out in “Rosetta,” a coming-of-age story about a teenager who lives in a trailer park with her alcoholic mother. Her performance earned her Cannes Film Festival’s prestigious best actress award, and “Rosetta” also won the Palme d’Or at the 1999 festival.\n\nHer next role was in Christophe Gans’ commercially successful “Brotherhood of the Wolf” (2001), and she went on to star in...\nSee full article at Variety - Film News\n3/17/2025by Ellise ShaferVariety - Film News\nSXSW Clarifies Changes to 2026 Music Conference\nReports of the demise of South by Southwest’s music element seem to have been exaggerated, with SXSW organizers clarifying that while next year’s event will be shorter, its music presence will not be diminished.\n\nA spokesperson for SXSW confirmed that the festival is reconfiguring as the Austin Convention Center is set to shut down for renovation. As such, SXSW 2026 will be two days shorter, cutting into what has traditionally been the festival’s music-focused second weekend. (Since 1987, a music conference with four days of programming has taken place on Wednesday through Saturday.) But next year’s event will feature an additional night of music, melding into SXSW’s film and television programming.\n\n“We are really excited about the plans for SXSW 2026” a SXSW spokesperson told The Hollywood Reporter. “With the Austin Convention Center closing down for three years, we believe it’s a great opportunity to put new ideas into action.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Kimberly Nordyke and Ethan MillmanThe Hollywood Reporter - Movie News\nAsian Film Awards: ‘All We Imagine as Light’ Wins Best Picture, Yoshida Daihachi Takes Best Director for ‘Teki Cometh’\nIndian filmmaker Payal Kapadia’s poignant drama All We Imagine as Light went home with the best picture prize Sunday night at the 18th Asian Film Awards. It was the film’s final stop on a ten-month festival and awards season journey that began last May when it won the Grand Prix at the Cannes Film Festival.\n\n“Thank you so much to my lead actors — three incredible artists and human beings. They are the ones who made this film what it is,” Kapadia said from the stage inside Hong Kong’s gleaming Xiqu Centre, where the ceremony was held. “I’m so happy that we could end our journey here in Hong Kong, a city that has meant a lot to me, watching the amazing films from this city over the years.”\n\nLegendary Hong Kong filmmaker and martial arts star Sammo Hung served as president of the jury that selected the winners of the 2025 AFAs,...\nSee full article at The Hollywood Reporter - Movie News\n3/16/2025by Patrick BrzeskiThe Hollywood Reporter - Movie News\nU.S. Box Office: Jack Quaid’s ‘Novocaine’ Leads Painfully Slow Weekend With $8.7 Million Debut\nJack Quaid’s action-comedy “Novocaine” topped a painfully slow weekend at the box office with $8.7 million. For theater owners, however, there’s not too much to celebrate: It’s one of the worst debuts to still capture the No. 1 spot (at least since the pandemic ground moviegoing to a halt).\n\nDespite five new nationwide releases, this weekend was among the year’s lowest grossing to date with $52 million across all films, according to Comscore. Even the Super Bowl frame, known to leave multiplexes barren, was bigger with $54 million in February. The year’s sluggish first quarter has been another blow to the badly bruised movie theater business, which is banking on 2025 to revive the business after Covid and Hollywood’s labor strikes. If that’s the case, there’s no time like the present. Year-to-date revenues are 5% behind 2024 and nearly 38% behind 2019, according to Comscore.\n\n“The industry is getting fed up...\nSee full article at Variety - Film News\n3/16/2025by Rebecca RubinVariety - Film News\n‘Percy Jackson,’ Meryl Streep, Christian Slater Among 3rd Annual Children’s & Family Emmys Winners (Full List)\nThe 3rd Annual Children’s & Family Emmy Awards, hosted this year by voiceover actor Eric Bauza are under way at Television City in Los Angeles. Disney+’s “Percy Jackson and the Olympians” leads this year’s nominations, with 16 nods, including for young teen series — which it won over competitors such as Disney+’s “Goosebumps,” Netflix’s “Heartstopper,” Netflix’s “One Piece” and Roku Channel’s “The Spiderwick Chronicles.”\n\n“Percy Jackson” won eight Emmys overall, the most of any title. Besides the young teen series prize, it won for writing for a young teen series, directing for a single camera live action program,...\nSee full article at Variety - TV News\n3/15/2025by Michael SchneiderVariety - TV News\n'Buffy the Vampire Slayer' Reboot: Sarah Michelle Gellar Shares a New Update\nSarah Michelle Gellar is addressing the Buffy the Vampire Slayer reboot.\n\nThe 47-year-old actress addressed the status of the project, which was revealed in early February.\n\nDuring a conversation, Sarah spoke about where things currently stand a month later regarding the show, in which she is set to reprise her role as Buffy Summers.\n\nKeep reading to find out more…\n\n“We’ve set up our offices, which means things are progressing probably faster than I’d anticipated,” she explained to People, adding: “But it’s going to be a process, I think.”\n\n“To do it the way it needs to be done, everyone has to be patient with all of us, because this isn’t something that [will just happen],” she went on to say.\n\nThe currently untitled project is nearing a pilot order at Hulu, and will reportedly focus on a new slayer, with Sarah appearing in a recurring role.\n\nChloé Zhao...\nSee full article at Just Jared\n3/16/2025by Just JaredJust Jared\n‘Three-Body Problem’ Author’s Military Sci-Fi Story and Chinese Rural Literary Epic Being Adapted by ‘Black Dog’ Director Guan Hu (Exclusive)\nChinese filmmaker Guan Hu has revealed he is currently developing an adaptation of “The Three-Body Problem” author Liu Cixin’s science fiction work “Full-Spectrum Barrage Jamming” and Liu Zhenyun’s acclaimed novel “One Sentence Is Ten Thousand Sentences.”\n\nLiu Cixin’s “Full-Spectrum Barrage Jamming,” featured in the collection “To Hold Up the Sky,” dives into electronic warfare during a conflict between a resurgent Communist Russia and NATO forces. The military sci-fi story explores the technological arms race as Russia deploys desperate measures to counter NATO’s advanced electronic capabilities.\n\nMeanwhile, Liu Zhenyun’s “One Sentence Is Ten Thousand Sentences,” winner of the Mao Dun Literature Prize in 2011, is a sweeping meditation on loneliness spanning generations in rural China. The novel follows two intertwined narratives: Wu Moxi, a solitary man from early 20th century Yanjin County who embarks on a journey through Shanxi, Shandong, and Hebei after losing his only true connection,...\nSee full article at Variety - Film News\n3/16/2025by Naman RamachandranVariety - Film News\nTaiwanese Romantic Drama ‘Blind Love’ Wins Top Prize at Joburg Film Festival\nTaiwanese director Julian Chou’s “Blind Love,” a drama about a sensitive teenager who discovers the secret affair between his mother and a mysterious woman, won the top prize at the 7th Joburg Film Festival on Saturday.\n\nChou’s sophomore feature, which premiered in the Tiger competition at the Rotterdam Intl. Film Festival, won the jury’s praise for its “fearless and brave voice whose point of view is necessary.”\n\nIn a pre-recorded video message, Chou said she was “honored and humbled” to receive the festival’s top prize and paid tribute to her fellow filmmakers whose “incredible work has brought such special energy and inspiration to the world.” The director added that she would “keep working harder to turn this honor into more meaningful films.”\n\nThe award capped off a charged night in which several filmmakers stressed the importance for Africans to wrest back control of their own stories.\nSee full article at Variety - Film News\n3/16/2025by Christopher VourliasVariety - Film News\n‘The New Year That Never Came’ Wins Top Award at 15th Luxembourg City Film Festival\nThe New Year That Never Came, a drama about the Romanian revolution of 1989, written and directed by Bogdan Muresanu, won the Grand Prix, the top prize, at the 15th edition of the Luxembourg City Film Festival (LuxFilmFest) on Saturday.\n\n“December 20, 1989. Romania is on the brink of revolution. The authorities are preparing New Year’s festivities as if nothing – or almost nothing – is happening, but the official façade begins to crack,” reads a synopsis for the film, which world premiered at Venice 2024. “Amid the fervor of the uprising, six lives will intersect over the course of an extraordinary day, which leads to the fall of Nicolae Ceaușescu and his regime.”\n\nThe fest jury, led by Iranian filmmaker Mohammad Rasoulof, also included Danish actress Trine Dyrholm (The Girl With the Needle, Poison), VFX expert Jeff Desom (Everything Everywhere All at Once), Austrian actress Valerie Pachner (Fantastic Beasts: The Secrets of Dumbledore, A Hidden Life...\nSee full article at The Hollywood Reporter - Movie News\n3/15/2025by Georg SzalaiThe Hollywood Reporter - Movie News\nJudge Blocks Release of Gene Hackman and Wife’s Autopsy Reports and Images of Bodies\nA judge on Monday blocked the release of police images of Gene Hackman and his wife, Betsy Arakawa, who were found dead in their home in Santa Fe, N.M.\n\nThe temporary restraining order also prevents the release of the autopsy reports. The family’s estate representative sought the order on Friday, saying that Hackman and Arakawa had sought to preserve their privacy during their lifetimes, and that images of their dead bodies should not be exploited for entertainment value.\n\nThe medical examiner determined that Arakawa died of a hantavirus infection sometime around Feb. 11. The potentially fatal disease is transmitted through rodent feces. Hackman, who was 95 years old and had severe Alzheimer’s disease, died about a week later of heart disease.\n\nThe Santa Fe County Sheriff’s Office was called to their home on Feb. 26, after a maintenance worker found a door left ajar. The deputies found Arakawa’s body on the bathroom floor,...\nSee full article at Variety - Film News\n3/17/2025by Gene MaddausVariety - Film News\nJesse Colin Young, Youngbloods’ Frontman and “Get Together” Singer, Dies at 83\nJesse Colin Young, the singer, songwriter and founding member of the Youngbloods, the 1960s group best known for their top 10 hit “Get Together,” has died. He was 83.\n\nYoung died Sunday in his home in Aiken, South Carolina, his wife and manager, Connie Young, announced.\n\nAs the frontman of the Youngbloods, Young brought forth the ideals of the Woodstock generation with his band’s version of Chet Powers’ “Get Together.” The song, which called for peace and brotherhood, came off their debut album in 1967 and peaked at No. 5 on the Billboard Hot 100 two years later.\n\nAfter the group’s breakup in 1972, Young thrived as a solo artist, releasing albums that mixed socially conscious lyrics with outstanding guitar work and warm tenor vocals. He also was known for such other tunes as “Four in the Morning,” “Sunlight,” “Darkness, Darkness,” “Quicksand” and “Peace Song.”\n\nBorn Perry Miller in 1941 in Queens, Young was raised on Long Island.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Mike BarnesThe Hollywood Reporter - Movie News\n‘Adolescence’ on Netflix: Did Jamie Kill Katie?\nNote: This story contains spoilers from “Adolescence” on Netflix.\n\nThere’s a lot about “Adolescence,” Netflix’s new limited series, that is designed to shock viewers. But perhaps the most surprising detail of the whole show is its complete absence of a big twist.\n\nJack Thorne, Stephen Graham and director Philip Barantini’s series bucks the trend of typical crime thrillers, abandoning the idea that these stories have to be told through mysteries. “Adolescence” doesn’t care about the “who” or “how” of its central murder. It cares about the “why,” as well as the repercussions the crime has on Jamie’s (Owen Cooper) family and friends. It’s the series’ lack of clear answers around that question that makes it so very haunting.\n\nDid Jamie kill the girl in “Adolescence”?\n\nThere’s not a big twist in this particular Netflix crime drama. Yes, Jamie did kill his classmate Katie Leonard...\nSee full article at The Wrap\n3/17/2025by Kayla CobbThe Wrap\nNBCUniversal Preps Massive Live Event Push in 2025 Upfront\nThe 2025 upfronts are a couple of months away, but NBCUniversal’s ad sales chairman Mark Marshall is already sending a message to Madison Ave.\n\nMarshall sent a message to NBCU’s clients and partners Monday afternoon, confirming that the company will once again convene the morning of May 12 at Radio City Music Hall, and that Telemundo will move its traditional evening celebration to Tuesday after Amazon took over its Monday night slot.\n\nBut the focus of Marshall’s memo is about teeing up 2026, the 100th anniversary of NBC, and the onslaught of live events that the company plans to bring to market in this year’s upfront.\n\nIf there was any ever doubt that sports and live events are where the industry is tilting, Marshall’s memo will put that to rest. NBC will have Super Bowl Lx, the 2026 Winter Olympics, and the return of the NBA on NBC all in a few week span.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Alex WeprinThe Hollywood Reporter - Movie News\nEllen Pompeo Asks Why ‘Old White Men’ Are the Only Group Allowed to Be Felons Under Trump | Video\nWhile discussing what she would like audiences to take away from her upcoming drama series “Good American Family,” Ellen Pompeo questioned what she feels is a double standard that benefits older white men – they are allowed to be felons in Trump’s America.\n\nPompeo appeared on Monday morning’s episode of “The View” and was asked by host Sunny Hostin what she hoped viewers would take away from her new Hulu limited series. The show is based on the real-life story of the adoption of Natalia Grace, a young girl with a rare form of dwarfism. It highlights the alleged abuse she endured while living with her adoptive parents and the media frenzy that ensued about Grace’s intention.\n\n“Well, I hope they take away that we should rush to judgement a little less,” the “Grey’s Anatomy” actress said. “And I hope they look at themselves and ask themselves, we...\nSee full article at The Wrap\n3/17/2025by Raquel 'Rocky' HarrisThe Wrap\nUniversal Music Says Drake “Lost a Rap Battle” and It Shouldn’t Be Held Liable for Hyperbole\nIn “Family Matters,” Drake’s penultimate diss track in his feud with Kendrick Lamar, the Toronto rapper says that his West Coast adversary abuses his wife and isn’t the father to his son. “When you put your hands on your girl, Is it self-defense ‘cause she bigger than you?” Drake sings. “They hired a crisis management team. To clean up the fact that you beat on your queen.”\n\nUniversal Music Group, in a bid on Monday to dismiss a defamation lawsuit filed by Drake, points to that accusation in arguments that diss tracks regularly advance personal, vitriolic assertions that listeners don’t take seriously. Context matters, Umg says, claiming that “Not Like Us” conveys opinion through exaggeration in a way that can’t be understood as defamatory.\n\nDrake “lost a rap battle that he provoked and in which he willingly participated,” states Umg in the filing. “Instead of accepting...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Winston ChoThe Hollywood Reporter - Movie News\nDon Lemon Tells Bill Maher That a ‘Huge Faction of Maga’ Supporters Are ‘Really F—ing Racist,’ but Maher Disagrees: ‘I Wouldn’t Say Huge. No’\nDon Lemon recently appeared on Bill Maher’s “Club Random” podcast and got into a debate with the host after claiming that a “huge faction of the Maga movement” is “really fucking racist.” Maher disagreed by saying: “I wouldn’t say huge. No.” The topic came up when the duo discussed the backlash that ignited over Tom Hanks’ “Black Jeopardy” sketch during the “SNL50” event last month.\n\nHanks popped up in the sketch as Donald Trump supporter Doug, a character he first played on “SNL” eight years ago. Sporting a red Maga hat, Doug freaks out when Kenan Thompson’s...\nSee full article at Variety - TV News\n3/17/2025by Zack SharfVariety - TV News\nMichael Moore, Barry Jenkins, Marisa Tomei Among 600 Creatives Who Condemn ‘No Other Land’ Censorship Threat in Miami\nMichael Moore, Barry Jenkins, Marisa Tomei, Ezra Edelman, Phil Lord and more than 600 other members of the international filmmaking community have signed an open letter to the Mayor and City Commission of Miami Beach over their proposed censorship of “No Other Land.”\n\n“We, the undersigned members of the international filmmaking community, write to express our deep concern and condemnation of your attempts to censor O Cinema, a local independent movie theater, for its exhibition of the Academy Award-winning documentary, ‘No Other Land,’ by withholding its funding and ending its lease,” the Monday letter reads.\n\n“O Cinema has a long history of supporting important and diverse viewpoints that foster dialogue. We as filmmakers invite critical discussion of any film, but your decision to punish O Cinema for screening ‘No Other Land’ is an attack on freedom of expression, the right of artists to tell their stories and a violation of the First Amendment,...\nSee full article at The Wrap\n3/17/2025by JD KnappThe Wrap\nNBCU Moves Telemundo Event After Amazon Crowds Monday Upfronts\nNBCUniversal said it would move an Upfront Week party for Spanish-language network Telemundo to a new night, weeks after Amazon said it would encroach on the evening upon which the event has traditionally been held.\n\nTelemundo for years has held an event for advertisers on the first night of Upfront Week, a five-day whirlwind of presentations by U.S. TV companies to Madison Avenue. The networks hope to sell the bulk of their commercial inventory ahead of the debut of their next cycle of programming.\n\nFor years, NBCU and Fox have held events on the Monday of the week, with...\nSee full article at Variety - TV News\n3/17/2025by Brian SteinbergVariety - TV News\nJames Taylor Songs Set to Take Stage In New Musical\nA new musical featuring the songs of James Taylor is in development.\n\nThe project, entitled Fire & Rain, will feature an original story written by Tony and Pulitzer Prize winner Tracy Letts and direction by Tony Award winner David Cromer.\n\nThe show is in early development stages and a production timeline has not yet been announced. Gail Berman, Sam Feldman, Michael Gorfaine and Broadway theater owner Jimmy Nederlander are producing in association with Frank Marshall and Jere Harris.\n\nThe title for the show comes from Taylor’s well-known song, “Fire and Rain,” which was released in 1970 on his second album, Sweet Baby James, and reached number three on the Billboard Hot 100 chart. The six-time Grammy Award winning singer and songwriter, whose hit songs include “You’ve Got a Friend” and “Sweet Baby James,” has not previously had his catalog used in a major theatrical production. However, two selections from his album...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Caitlin HustonThe Hollywood Reporter - Movie News\nJanet McTeer Boards Guy Ritchie’s ‘MobLand’ (Exclusive)\nThe star-studded cast of Guy Ritchie’s crime drama MobLand is adding another notable name.\n\nJanet McTeer will be part of the Paramount+ series, which is set to premiere March 30. The Emmy and two-time Oscar nominee joins an ensemble led be Tom Hardy, Pierce Brosnan and Helen Mirren.\n\nMobLand centers on a London-based Irish crime family headed by Brosnan’s Conrad Harrigan, that’s fighting for power within a global syndicate. Mirren plays his wife, Maeve — “the brains behind the charm,” as Brosnan’s character describes her in the series trailer — and Hardy plays Harry Da Souza, the family’s fixer.\n\nMcTeer (The Old Man, The Menu) will play a character named Kat, who is “as charming as she is violent,” according to the character’s description. “Crime bosses from London to Beijing are anxious never to cross swords with her.”\n\nThe MobLand cast also features Paddy Considine, Joanne Froggatt,...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Rick PorterThe Hollywood Reporter - Movie News\nColin Farrell in Talks to Star in Luca Guadagnino’s ‘Sgt. Rock’ Movie at DC Studios\nColin Farrell is in talks to star in in Luca Guadagnino’s “Sgt. Rock” movie at DC Studios, according to an insider with knowledge of the project.\n\nThe script is written by Justin Kuritzkes, who previously wrote “Challengers” and “Queer” for Guadagnino. The film is expected to be a period piece set during World War II.\n\nSgt. Rock is one of DC Comics’ most famous military characters and is the leader of Easy Company. Created by Robert Kanigher and Joe Kubert, he first appeared in 1959’s “Our Army at War” before getting his own series in 1977 that ran for 11 years.\n\nDaniel Craig was previously circling the role, but never got an offer according to DC Studio chiefs James Gunn and Peter Safran. DC Studios is planning to shoot the movie this summer in the United Kingdom.\n\nFarrell previously played Gotham crime boss Oswald Cobb aka the Penguin for Matt Reeves...\nSee full article at The Wrap\n3/17/2025by Umberto GonzalezThe Wrap\nColin Farrell in Talks to Star in ‘Sgt. Rock’ From DC and Luca Guadagnino\nColin Farrell may be double-dipping in the DC Universe. “The Penguin” star is circling the lead in “Sgt. Rock,” a comic book adaptation from Luca Guadagnino.\n\nDaniel Craig was eyed for the role, but the actor never formally committed to the movie before he dropped out of consideration in February.\n\nIn the comics, Sgt. Rock is a World War II hero and combat fighter. There have been attempts to bring the character to the screen over the years with actors like Bruce Willis and Arnold Schwarzenegger, but those films never came to pass.\n\nThis attempt is expected to begin shooting this summer in England. Justin Kuritzkes, who previously wrote “Challengers” and “Queer” for Guadagnino, is penning the “Sgt. Rock” screenplay. The new movie is being developed under DC’s leadership team of James Gunn and Peter Safran. The duo has described the adaptation as a straightforward war film and view...\nSee full article at Variety - Film News\n3/17/2025by Rebecca Rubin and Katcy StephanVariety - Film News\n‘Starman’ Review: Thoughtful Doc Examines Space Exploration and Life Beyond Earth Through Author Gentry Lee\nIn Dan Farah’s The Age of Disclosure, one of the buzziest documentaries to premiere at SXSW this year, it takes interviews with 34 people from all levels of government and military to make the case that we’re not alone in the universe, and that we should all be paranoid about the vast conspiracy keeping civilians from finding out.\n\nIn Robert Stone’s Starman, premiering at SXSW to generally less buzz, only one person is interviewed, but he makes his own case for why we’re not alone, using this conviction to reflect on several decades of human progress and the fact that, no matter what else is happening out in the stars, we only have one Earth.\n\nI’m not really valorizing one philosophical mindset over the other, nor exactly stating a preference for one filmmaking approach or the other. I’m just noting that while The Age of Disclosure...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Daniel FienbergThe Hollywood Reporter - Movie News\nEx-cnn Anchor Don Lemon Reveals He Was Sexually Harassed by Women While at Network\nFormer CNN anchor Don Lemon revealed that he was subjected to sexual harassment in the workplace on multiple occasions throughout his career while appearing on Bill Maher’s podcast this weekend and the veteran broadcaster shared a dark part of his past as he explained his thoughts and experiences with gender and power dynamics.\n\nLemon was the guest on Club Random, Maher’s podcast, featuring lengthy and loose interviews with notable cultural figures and newsmakers. Over the nearly two-hour episode, the two discuss the shifting landscape of media bias, the existence of rational Maga Republicans and Lemon’s experiences as a gay Black man. Early in the episode, the two TV hosts touch on the topic of harassment and Lemon delves into his brushes with uncomfortable moments with colleagues, which include being touched inappropriately by a woman in a CNN cafeteria and being sexually harassed by a superior at the cable news channel.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Kevin DolakThe Hollywood Reporter - Movie News\nColin Farrell in Talks to Star in ‘Sgt. Rock’ for DC Studios\nColin Farrell, who waddled his way to considerable acclaim for his work as a classic DC villain in The Penguin, is in negotiations to return to the world of DC with Sgt. Rock, the World War Two action movie to be directed by Luca Guadagnino for DC Studios.\n\nThe move comes after Daniel Craig, who circled the feature project, officially stepped away and is now entertaining a role in Greta Gerwig and Netflix’s take on Narnia. No offer was ever made to Craig, DC Studios heads James Gunn and Peter Safran said in February. At the time, they said the project would shoot this summer “only if we find the perfect actor.”\n\nThe move indeed puts Rock on track for a shoot this summer in DC Studios’ production hub in England.\n\nIf a deal makes, Farrell would play the tough-as-nails leader of Easy Company, the combat unit fighting Nazi forces in Europe.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Borys KitThe Hollywood Reporter - Movie News\nSAG-AFTRA Affirms Support for Dei as Studios Back Away\nSAG-AFTRA affirmed its support for diversity equity and inclusion on Monday, after several major studios walked back their commitments in the face of threats from the Trump administration.\n\nThe national board of the actors’ union adopted a resolution stating that Dei is a “moral imperative” and is also “crucial to the creative and economic vitality of our industry.”\n\nIn recent weeks, Disney scrapped its Reimagine Tomorrow initiative, which highlighted stories from underrepresented groups, while Warner Bros. Discovery, Amazon and Paramount have taken similar steps.\n\nThe moves come as the Trump administration seeks to stamp out Dei programs in both the...\nSee full article at Variety - TV News\n3/17/2025by Gene MaddausVariety - TV News\nSAG-AFTRA Affirms Support for Dei as Studios Back Away\nSAG-AFTRA affirmed its support for diversity equity and inclusion on Monday, after several major studios walked back their commitments in the face of threats from the Trump administration.\n\nThe national board of the actors’ union adopted a resolution stating that Dei is a “moral imperative” and is also “crucial to the creative and economic vitality of our industry.”\n\nIn recent weeks, Disney scrapped its Reimagine Tomorrow initiative, which highlighted stories from underrepresented groups, while Warner Bros. Discovery, Amazon and Paramount have taken similar steps.\n\nThe moves come as the Trump administration seeks to stamp out Dei programs in both the federal government and the private sector. Among the first initiatives of the new Federal Communications Commission chair, Brendan Carr, was an investigation into Dei at NBCUniversal and Comcast.\n\nIn its statement, SAG-AFTRA noted that its support for diversity stretches back to 1963, when its predecessor union, the Screen Actors Guild, got non-discrimination language in its contract.\nSee full article at Variety - Film News\n3/17/2025by Gene MaddausVariety - Film News\n‘Sopranos’ Star Steve Schirripa Joins ‘Dexter: Resurrection’ (Exclusive)\nSteve Schirripa has joined the cast of the upcoming “Dexter” sequel series, “Dexter: Resurrection.”\n\nThe “Sopranos” and “Blue Bloods” actor will play the recurring role of Vinny, a greedy slumlord.\n\nProduction for Showtime’s “Dexter” sequel series began in January in New York. The show is set to debut on Paramount+ With Showtime in the summer.\n\nMichael C. Hall returns as Dexter Morgan in the series, which also stars Uma Thurman as Charley, David Zayas as Detective Angel Batista, Jack Alcott as Dexter’s son Harrison Morgan, Ntare Guma Mbaho Mwine as Blessing Kamara, Kadia Saraf as Detective Claudette Wallace,...\nSee full article at Variety - TV News\n3/17/2025by Ethan ShanfeldVariety - TV News\nLady Gaga Unleashes ‘Mayhem’ On Albums Chart With No. 1 Debut\nLady Gaga’s Mayhem has debuted at no. 1 on Billboard‘s top 200 albums chart, the publication confirmed on Sunday, marking Gaga’s seventh no. 1 album in her legendary career.\n\nMayhem opened with 219,000 units total, per Luminate, off of 108.05 million streams and 136,000 traditional sales. It’s just the latest chart victory for Gaga, who’s enjoyed a strong year thus far as “Die With A Smile,” her duet with Bruno Mars, spent five weeks this year atop the Hot 100.\n\nMayhem is Gaga’s first solo album since 2020’s Chromatica, which also topped the charts and spawned her hit “Rain On Me” with Ariana Grande. Mayhem marks Gaga’s fifth consecutive solo album to top the albums chart; beyond her solo albums, Gaga also topped the charts with her collaboration with Tony Bennett Cheek to Cheek, as well as for the Star is Born soundtrack.\n\nElsewhere on the album chart, Blackpink member...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Ethan MillmanThe Hollywood Reporter - Movie News\nScott Eastwood Joins Allison Williams in Colleen Hoover Movie ‘Regretting You’ for Paramount\nScott Eastwood has been added to the cast of Paramount Pictures’ feature adaptation of the Colleen Hoover novel Regretting You.\n\nHitting theaters Oct. 24, Regretting You stars Eastwood alongside previously announced castmembers Allison Williams, Dave Franco, Mckenna Grace, Mason Thames and Willa Fitzgerald. Josh Boone (The Fault in Our Stars) helms the film from a script he wrote that is based on a previous draft by Susan McMartin (After).\n\nRegretting You centers on the aftermath of a tragic car accident that claims the lives of two family members and leads to an exploration of past secrets and regrets.\n\nThe project is based on Hoover’s best-selling 2019 novel and hails from Constantin Film, with the producers including Robert Kulzer, Brunson Green, Anna Todd and Flavia Viotti. Serving as executive producers are Hoover, Williams, Franco and Grace.\n\nEastwood’s previous features include I Want You Back, 1992, Fast X, Wrath of Man and Pacific Rim: Uprising.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Ryan GajewskiThe Hollywood Reporter - Movie News\n‘Tracker’ Creator Ben H. Winters Tackles Comics with Sci-Fi Mystery ‘Benjamin’ (Exclusive)\nIn high school, Ben H. Winters went to see Total Recall, a loud Arnold Schwarzenegger sci-fi action blockbuster directed by Paul Verhoeven. When he noticed it was based on a story by Philip K. Dick, he decided to seek it out and read it.\n\nHis reaction was one of “Whoa,” as he recalls. “So that’s where this stuff is coming from,” he thought. It became his gateway into classic and heady science fiction from not just Dick but authors such as Isaac Asimov, Robert A. Heinlin, Kurt Vonnegut and others.\n\n“The guys were preoccupied with the idea what it meant being humans, what is meant to be alive,” he notes. “All of these trippy and deep and unsettling questions of the human condition become folded into these wild stories.”\n\nNow Winters is paying homage to these authors with Benjamin, a three-issue prestige limited comic book series from Oni Press,...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Borys KitThe Hollywood Reporter - Movie News\nHow Neon’s ‘Hell of a Summer’ From Finn Wolfhard and Billy Bryk Was Inspired by Their Acting Work\nAfter making a splash at the Oscars with Anora, Neon is following it up with Hell of a Summer, the teen comedy-slasher film from co-directors Finn Wolfhard and Billy Bryk.\n\nNeon releases Hell of Summer in theaters April 4 following its premiere at TIFF in 2023. The ensemble cast includes Wolfhard and Bryk alongside Fred Hechinger, D’Pharaoh Woon-a-Tai and Abby Quinn in the story of a masked killer targeting the counselors at a summer camp in the woods. The Hollywood Reporter can share exclusive first-look images above and below, along with a new clip.\n\nWolfhard and Bryk, who connected while working as young actors on the set of Ghostbusters: Afterlife, started working together on the script for Hell of a Summer back in 2019. “I loved slasher and horror films growing up, but something that Billy and I really bonded over was our shared love of comedy, and specifically teen comedies,” Wolfhard tells THR.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Ryan GajewskiThe Hollywood Reporter - Movie News\n‘The White Lotus’ Fans Blown Away by Explosive Episode 5 Twists: ‘The Little One Was a Little Too in to That Kiss’\nNote: This story contains spoilers from “The White Lotus” Season 3, Episode 5.\n\nWhile some viewers found the first four episodes of “The White Lotus” Season 3 on the slower side, Mike White’s anthology series ramped up with an explosive Episode 5, that took the season exactly where some fans were thinking.\n\nAfter much of the guests spent their day on Greg/Gary’s yacht in Episode 4, Episode 5 sees the group filter off, with brothers Saxon (Patrick Schwarzenegger) and Lochlan (Sam Nivola) heading to the full moon party with Chelsea (Aimee Lou Wood) and Chloe (Charlotte Le Bon), whose boyfriends have both chosen not to join in on the festivities.\n\nAfter a fair amount of drinking and some drugs — which some fans found reminiscent of HBO’s “Euphoria” — the group took turns kissing each other — including brothers Saxon and Lochlan, sending social media into a frenzy.\n\n“We all called the Saxon and Lochlan...\nSee full article at The Wrap\n3/17/2025by Loree SeitzThe Wrap\nChris O’Donnell to Star in ‘911: Nashville’ at ABC\nABC’s next 911 series has made the call for its first lead actor.\n\nChris O’Donnell is set to star in 911: Nashville, which ABC picked up in February with a straight-to-series order. He’s the first actor cast in the show, which is set to premiere in the 2025-26 season.\n\nO’Donnell will play Capt. Don Sharpe, who’s described as “a rugged fire captain and rodeo rider who runs Nashville’s busiest firehouse alongside his beloved son. Don is a devoted husband and family man, but he has his secrets.”\n\nThe role for O’Donnell will be his first ongoing part since NCIS: Los Angeles ended its long run on CBS in 2023. O’Donnell played NCIS agent G. Callen for all 14 seasons of the series.\n\nIdeas for a third series in the 911 franchise — which comes from 20th Television and Ryan Murphy Television — had been floating around for several months,...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Rick PorterThe Hollywood Reporter - Movie News\n‘9-1-1: Nashville’ Casts Chris O’Donnell in Lead Role\n“9-1-1: Nashville” has found its leading man in Chris O’Donnell.\n\nThe “NCIS: Los Angeles” actor joins the ABC series as Captain Don Sharpe, who is described as “a rugged fire captain and rodeo rider who runs Nashville’s busiest firehouse with his beloved son,” according to official character description. While Don is described as a “devoted husband and family man,” “he has his secrets,” the description teases.\n\nOther details regarding the plot remain under wraps, though the procedural will follow the lives of first responders in the capital of Tennessee.\n\nO’Donnell is one of the first cast members to board “9-1-1: Nashville,” which landed a series order at ABC in late February. “9-1-1: Nashville,” which marks the third series in the “9-1-1” franchise, hails from 20th Television in association with Ryan Murphy Television, with Ryan Murphy, Tim Minear and Rashad Raisani serving as executive producers and writers.\n\nBrad Falchuk, who...\nSee full article at The Wrap\n3/17/2025by Loree SeitzThe Wrap\nCrunchyroll Partners With Aniplex for Anime Production Venture Hayate\nCrunchyroll has teamed up with longtime anime entertainment company, Aniplex, on a joint anime production venture called Hayate Inc., which will focus on planning, developing and producing anime content for the streamer.\n\nThe new establishment will be lead by Aniplex’s Masanori Miyake and Leo Watanabe. Miyake will serve as chairman and CEO while Watanabe will serve as Hayate’s president and COO. The staff will consist of employees from both Crunchyroll and Aniplex.\n\nPer Crunchyroll, “Hayate will produce premium content for anime fans worldwide using Aniplex’s production know-how cultivated over the years through its partnerships with a wide range of creators and studios as well as Crunchyroll’s development, marketing and distribution capabilities built upon its strong ties to the anime community and passionate fandom.”\n\nCrunchyroll, LLC is an independently operated joint venture between U.S.-based Sony Pictures Entertainment and Japan’s Aniplex, a subsidiary of Sony Music Entertainment (Japan) Inc.\nSee full article at The Wrap\n3/17/2025by Raquel 'Rocky' HarrisThe Wrap\nFilming ‘Adolescence’: How the Netflix Series Pulled Off One-Shot Episodes Without Stitching Takes Together\nSpoiler Alert: This story contains spoilers for “Adolescence,” streaming now on Netflix.\n\nNetflix’s “Adolescence” is a four-part limited series that uses one continuous shot per episode to create intense emotion as it follows 13-year-old schoolboy Jamie Miller, played by newcomer Owen Cooper, who is arrested on the suspicion of murdering his classmate.\n\nThe action unfolds in real time, from the police conducting an early morning raid, taking him in for questioning and interrogating him to finding out what really happened to his classmate, and did he do it? Cinematographer Matthew Lewis worked with Philip Barantini to deliver the director...\nSee full article at Variety - TV News\n3/17/2025by Jazz TangcayVariety - TV News\nNBC Orders Native American Community Center Comedy Pilot From Sierra Teller Ornelas, Jackie Keliiaa, Bobby Wilson (Exclusive)\nNBC has picked up a single-camera comedy pilot based at a Native American community center, Variety has learned exclusively.\n\nThe untitled, single-camera comedy hails from writers Sierra Teller Ornelas, Jackie Keliiaa, and Bobby Wilson. All three are also executive producers, with Teller Ornelas set to serve as showrunner. Morgan Sackett will also executive produce. Universal Television, where both Teller Ornelas and Sackett are under overall deals, is the studio.\n\nThe official logline for the pilot states that it is “An ensemble comedy set at a Native community center in Oakland, Calif. The employees hustle to keep the lights on while lifting up those in need.\nSee full article at Variety - TV News\n3/17/2025by Joe OttersonVariety - TV News\n‘Long Bright River’ Showrunner Breaks Down That Dark but Empowering Finale Kill\nNote: This story contains spoilers from “Long Bright River” Episode 8.\n\nThe twisty thriller series “Long Bright River” unpacked more than just the murder mystery plaguing the Kensington community. The Peacock limited series unveiled truths behind a familial drama with everything from addiction to estrangement.\n\nBased on the bestselling novel of the same name, “Long Bright River” follows Mickey Fitzpatrick (Amanda Seyfried), a homegrown Kensington cop whose method of patrolling looks a little different than her male counterparts. When a series of murders takes place, targeting sex workers on The Avenue amid the opioid crisis, Mickey drops everything to find her estranged, unhoused little sister Kacey.\n\nThe eight-episode series not only reveals truths about the murderer’s identity but also about Mickey’s clouded past. The straight-laced, do-good officer has a traumatic history that informs her sometimes questionable decision-making. In a series of twists, we learn that Mickey’s son Thomas...\nSee full article at The Wrap\n3/17/2025by Tess PattonThe Wrap\nAmber Midthunder Talks That ‘Novocaine’ Twist and Her ‘Predator’ Franchise Future\n[This story contains spoilers for Novocaine.]\n\nIn 2022, Amber Midthunder upstaged one of cinema’s most imposing villains in the Predator franchise prequel, Prey. Her performance as a coming-of-age Comanche warrior named Naru was widely hailed as revelatory, and she’s been so booked and busy since then that she had two theatrical releases debut this past weekend in Novocaine and Opus. The former, which was co-directed by Dan Berk and Robert Olsen for Paramount, is now the number-one film at the domestic box office.\n\nMidthunder stars opposite Jack Quaid in Berk and Olsen’s action-comedy, something the two actors had been aiming to do for some time now. Prey director Dan Trachtenberg also directed Quaid in the pilot of his hit show, The Boys, so the filmmaker incepted the idea of collaboration into both of his actors’ brains. In Novocaine, Midthunder’s bank teller character, Sherry, initiates a dessert lunch date with Quaid’s Nate Caine,...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Brian DavidsThe Hollywood Reporter - Movie News\n‘Severance’ Star Teases Looming Lumon Finale: “She’s Ready For Blood”\n[This story contains spoilers up to the penultimate episode of Severance season two, “The After Hours.”]\n\nHell hath no fury like m’lord scorned, as Lumon Industries may just find out firsthand in the upcoming Severance season two finale.\n\nStarring as Mark’s sister Devon through the Apple TV+ thriller’s entire run, Jen Tullock has had a front row seat to some of the weirdest, winding twists along the way, especially in season two as she’s drawn deeper and deeper into the severed floor’s big conspiracies. The biggest one, of course, being that Devon’s sister-in-law Gemma (Dichen Lachman) is alive, despite previous accounts to the contrary. If that wasn’t motivation enough to help Mark (Adam Scott) figure out how to navigate this shadow corporation’s darkest corridors, there’s an additional incentive for Devon: husband Ricken (Michael Chernus), the literary iconoclast who is slowly but surely being wooed toward the dark side through promises of fame and fortune.\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Josh WiglerThe Hollywood Reporter - Movie News\n‘The Wedding Banquet’ Trailer: Bowen Yang and Lily Gladstone Lead Queer Rom-Com – Film News in Brief\nFollowing the film’s premiere at this year’s Sundance Film Festival, the new trailer for “The Wedding Banquet” teases a new kind of queer rom-com.\n\nWith a cast led by Bowen Yang, Lily Gladstone, Kelly Marie Tran, Joan Chen and Oscar-winner Youn Yuh-Jung, “Fire Island” director Andrew Ahn’s take on Ang Lee’s 1993 classic follows a chosen family who stages a fake wedding between Min (Han Gi-Chan) and Angela (Tran) in order for Min to get his green card and Lee (Gladstone) to get her IVF treatment. But their plan takes an unexpected turn when Min’s grandmother flys in from Korea with the intent of turning the wedding into a giant party.\n\n“The Wedding Banquet” got positive reviews out of Sundance, with Variety‘s Carlos Aguilar calling Ahn “a talented and versatile storyteller” in his review while also praising the performances: “It’s particularly refreshing to see...\nSee full article at Variety - Film News\n3/17/2025by Jazz Tangcay and Matt MintonVariety - Film News\n‘Andor’ Creator Refuses to Make Episode Scripts Public Because They Could Be Used to Train AI Softwares: ‘Why Help the F—ing Robots?’\n“Andor” creator Tony Gilroy recently told Collider that he will not be making any of the scripts for the “Star Wars” series public out of fear they will be used to train artificial intelligence systems. Gilroy had been planning to release the scripts for the show’s first season in a book format that fans could purchase, similar to shows such as HBO’s “Succession.” However, the rise of AI effectively killed that plan.\n\n“I wanted to do it,” Gilroy said about releasing the scripts. “We put it together. It’s really cool. I’ve seen it, I loved it.\nSee full article at Variety - TV News\n3/17/2025by Zack SharfVariety - TV News\nEdie Falco on Getting ‘Silly’ and Shooting ‘Ridiculous,’ ‘Weird Stuff’ for Comedy Horror Film ‘The Parenting’: ‘It Was So Out of My Wheelhouse’\nNestled in the Massachusetts countryside, a cozy house that’s equal parts gorgeous and spooky was invaded by some of the entertainment industry’s most seasoned pros, including Edie Falco and Brian Cox — both playing just about as far from their usual casting as they can get — to film the horror comedy “The Parenting,” now on Max. The duo plays a married couple invited by their gay son to a weekend away in a rented house to meet his boyfriend’s parents. They soon find out that the house isn’t vacant after all, but rather haunted by an ancient demon looking for an earthbound host to occupy… and it finds an unsuspecting one in Cox.\n\nThis is quite a leap from Logan Roy, the role the classically trained Cox so brilliantly played on HBO’s “Succession.” In “The Parenting,” he gets to be downright silly — in a foul-mouthed, mischievous way.\nSee full article at Variety - Film News\n3/17/2025by Rosemary RossiVariety - Film News\nWill Arnett’s ‘Super Team Canada’ Comedy to Launch Amid U.S. Tariffs War\nWill Arnett’s animated comedy Super Team Canada is set to bow May 16 on Canadian streamer Crave, just in time to ride a surge in Canadian nationalism amid an escalating cross-border tariffs war with the United States.\n\nThe series about six Canadian superheroes saving the world from giant evil robots has an all-Canadian cast that includes Cobie Smulders voicing the role of Niagara Falls, Kevin McDonald as the Canadian prime minister and Charles Demers as Poutine, a French Canadian crime fighter.\n\nArnett voices the role of Breakaway, a former minor league hockey player who uses his skates, stick and special pucks to fight crime as the unofficial leader of Super Team Canada. The ensemble voice cast also has Brian Drummond, Ceara Morgana, Veena Sood and guest star Jay Baruchel.\n\nSuper Team Canada from Arnett’s Electric Avenue and Thunderbird Entertainment’s Atomic Cartoons is written by Emmy winners Robert Cohen...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Etan VlessingThe Hollywood Reporter - Movie News\nDavid Mitchell Talks Bringing BBC Hit ‘Ludwig’ to America: “My Hunch Is… They’ll Just Get It”\nDavid Mitchell is a little coy while discussing how he onboarded Ludwig. “As far as I know,” he tells The Hollywood Reporter, “it was thought up with me in mind!”\n\nThe actor and comedian is beloved in the U.K. for his starring roles in Peep Show, Blackadder and on the British panel show Would I Lie to You?, so it was a no-brainer for creator Mark Brotherhood when he got wind that Mitchell, inspired by his own love of crime and mystery shows, was looking for a detective role.\n\n“I grew up with Inspector Morse and Miss Marple and Poirot and all that,” Mitchell says. “It’s a kind of television I love watching so I’ve long wanted to be in one.” Fast forward a few years and his latest dry-humored, endearingly grumpy success has come in the form of John “Ludwig” Taylor, the titular character of the...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Lily FordThe Hollywood Reporter - Movie News\nDavid Kramer Named CEO of UTA, Jeremy Zimmer Shifts to Executive Chairman\nIn a changing of the guard at one of Hollywood’s biggest talent agencies, UTA says that David Kramer will take over as CEO in June, succeeding longtime leader Jeremy Zimmer.\n\nZimmer, the UTA co-founder who has been CEO of the talent agency since 2012, is shifting to a role as board member and executive chairman. Paul Wachter will remain chairman of the board of UTA.\n\n“We are thrilled to announce David as UTA’s next CEO. He is stepping into this role at an exciting time of growth, with UTA at the center of some of the most pivotal cultural moments across media, sports, and entertainment. We are confident that his leadership and client-centric approach will position the Company for continued success,” said Wachter in a statement. “I’ve known Jeremy and UTA for almost 30 years and have been impressed with Jeremy’s entrepreneurial nature and vision. It’s been...\nSee full article at The Hollywood Reporter - Movie News\n3/17/2025by Alex WeprinThe Hollywood Reporter - Movie News\n‘Sunrise on the Reaping’ Publisher on Why New ‘Hunger Games’ Prequel Is Focused on Haymitch and If Finnick’s Story Is Next\nLast June, Scholastic and Lionsgate teamed up for a double hit of “Hunger Games” news: Not only would a new prequel book be released 10 months later, but the unpublished novel was already in the works as a film set with a November 2026 theatrical release.\n\nOn March 18, the first portion of that promise will be delivered with the launch of “Sunrise on the Reaping,” Suzanne Collins’ fifth addition to the “Hunger Games” franchise. One of the most anticipated books of 2025, the story centers around Katniss and Peeta’s mentor, Haymitch (played by Woody Harrelson in the “Hunger Games” film trilogy), when he was a teen and his emergence as the victor in the 50th annual Hunger Games.\n\nUnlike the release of Collins’ previous “Hunger Games” prequel novel, “The Ballad of Songbirds and Snakes,” which came out amid the height of the pandemic in 2020, publisher Scholastic is able to give “Sunrise” a...\nSee full article at Variety - Film News\n3/17/2025by Jennifer MaasVariety - Film News\n50 more\nIMDb.com, Inc. takes no responsibility for the content or accuracy of the above news articles, Tweets, or blog posts. This content is published for the entertainment of our users only. The news articles, Tweets, and blog posts do not represent IMDb's opinions nor can we guarantee that the reporting therein is completely factual. Please visit the source responsible for the item in question to report any concerns you may have regarding content or accuracy.\nMore to explore\nCelebrity News\nÉmilie Dequenne, Cannes Best Actress Winner for ‘Rosetta,’ Dies at 43\n3/17/2025by Ellise ShaferVariety - Film News\nTom Cruise & Ana de Armas Hang Out Again in London\n3/15/2025by Just JaredJust Jared\nBroadway Stars Reeve Carney & Eva Noblezada Are Engaged!\n3/15/2025by Just JaredJust Jared\nRachel Zegler & Gal Gadot Attend Scaled Back 'Snow White' Premiere In Los Angeles\n3/16/2025by Just JaredJust Jared\n'Buffy the Vampire Slayer' Reboot: Sarah Michelle Gellar Shares a New Update\n3/16/2025by Just JaredJust Jared\nIndie News\n‘Sgt. Rock’ Colin Farrell Steps In For Daniel Craig In Luca Guadagnino’s WWII Comics Adaptation\n3/17/2025by The PlaylistThe Playlist\nAn Army of A-Listers Are Challenging OpenAI and Google Over Copyright Exemptions for Training AI Models\n3/17/2025by Brian WelkIndiewire\n‘Ludwig’ Review: From Solving Puzzles To Solving Murders, This Is One Charming Show\n3/17/2025by Brian FarvourThe Playlist\n2025 Emmy Predictions: Who Will Win at the Primetime Emmy Awards?\n3/17/2025by Marcus JonesIndiewire\n‘The Accountant 2’ Tops 2025 SXSW Film & TV Festival Audience Awards\n3/17/2025by Samantha BergesonIndiewire\nMovie News\nOscars: Conan O’Brien to Return as Host in 2026\n3/17/2025by Scott FeinbergThe Hollywood Reporter - Movie News\n‘Snow White’ First Reactions Praise Film as a ‘Visual Feast’ and One of Disney’s ‘Best Live-Action Remakes in Years’\n3/17/2025by Zack SharfVariety - Film News\n‘Three-Body Problem’ Author’s Military Sci-Fi Story and Chinese Rural Literary Epic Being Adapted by ‘Black Dog’ Director Guan Hu (Exclusive)\n3/16/2025by Naman RamachandranVariety - Film News\nTaiwanese Romantic Drama ‘Blind Love’ Wins Top Prize at Joburg Film Festival\n3/16/2025by Christopher VourliasVariety - Film News\n‘The New Year That Never Came’ Wins Top Award at 15th Luxembourg City Film Festival\n3/15/2025by Georg SzalaiThe Hollywood Reporter - Movie News\nTV News\n'Buffy the Vampire Slayer' Reboot: Sarah Michelle Gellar Shares a New Update\n3/16/2025by Just JaredJust Jared\n‘Percy Jackson,’ Meryl Streep, Christian Slater Among 3rd Annual Children’s & Family Emmys Winners (Full List)\n3/16/2025by Michael SchneiderVariety - TV News\nWWE Raw: March 17 Results From Brussels Belgium: John Cena and Cody Rhodes Speak Face to Face\n3/17/2025by Christopher HudspethTudum - Netflix\nMarch Madness 2025 TV Schedule: NCAA Men’s Basketball Tournament\n3/17/2025TV Insider\nAn Army of A-Listers Are Challenging OpenAI and Google Over Copyright Exemptions for Training AI Models\n3/17/2025by Brian WelkIndiewire Television"
  },
  {
    "url": "https://www.rottentomatoes.com/news",
    "text": "Signed in\nSkip to Main Content\nAbout Rotten Tomatoes®\nCritics\nLOGIN/SIGNUP\nMOVIESTV SHOWSFANSTORE\nNEW\nNEWSSHOWTIMES\nTRENDING ON RT\n404 - Not Found\n\nSorry, please try again later.\n\nHelp\nAbout Rotten Tomatoes\nCritic Submission\nLicensing\nAdvertise With Us\nCareers\n\n JOIN THE NEWSLETTER\n\nGet the freshest reviews, news, and more delivered right to your inbox!\n\nJOIN THE NEWSLETTER\n\nFOLLOW US\n\nV3.1 Privacy Policy  Terms and Policies  Cookie Settings  California Notice  Ad Choices  Accessibility\nCopyright © Fandango. A Division of NBCUniversal. All rights reserved."
  },
  {
    "url": "https://www.coursera.org/articles",
    "text": "Coursera Articles\n\nWe envision a world where anyone, anywhere has the power to transform their lives through learning. Take the next step in your learning journey by exploring these popular topics.\n\nCategories\nStatus: Featured\nFeatured\n10 Examples of Strengths and Weaknesses for Job Interviews\n\nLearn how to answer questions about your strengths and weaknesses for your next job interview.\n\nMarch 14, 2025\n\nArticle · 8 min read\n\nStatus: Featured\nFeatured\nWhat Does a Software Engineer Do?\n\nSoftware engineers design and create computer systems and applications to solve real-world problems.\n\nJanuary 10, 2025\n\nArticle\n\nDegrees\nView all\nWhat Classes Are Required for a Computer Science Degree?\n\nAs the digital age continues to evolve, the pursuit of a computer science degree has become synonymous with a passport to opportunity. Learn more about what classes are required for a computer science degree.\n\nJanuary 29, 2025\n\nArticle\n\nWhat Are Stackable Credentials and How Do They Fit in Your Career Plan?\n\nLearn how stackable credentials prepare you for entry-level positions as you gain credits toward a degree.\n\nJanuary 22, 2025\n\nArticle\n\nStart your career\n\nGet a valuable credential\n\nEarn a top degree\n\nCareer Advice\nView all\nBoosting Efficiency: AI Productivity Tools in Modern Workplaces\n\nAI productivity tools can enhance your efficiency and empower your team to achieve more in less time. Learn how to harness these tools and experience the benefits they offer.\n\nMarch 12, 2025\n\nArticle\n\nBest Companies to Work for Remotely\n\nExplore the best companies to work for remotely, including Brightside Health, Nvidia, HubSpot, and more. Learn about their benefits, employee experiences, and ways to develop skills to help you succeed in a remote working environment.\n\nFebruary 20, 2025\n\nArticle\n\nHealth\nView all\nWhat Is a Community Health Worker Certification, and How Can You Get One?\n\nCommunity health workers provide vital health services to their community through education, patient advocacy, and discussion of health concerns. Discover your options for a community health worker certification below.\n\nOctober 7, 2024\n\nArticle\n\n10 Most Common Career Changes for Nurses\n\nAre you thinking of using your nursing credentials to launch a new career? Discover 10 popular choices for nurses hoping to switch jobs, along with the educational requirements and salary you can expect to earn to help guide your new path.\n\nNovember 13, 2024\n\nArticle\n\nComputer Science and Engineering\nView all\nAI in Software Development: Revolutionizing the Coding Landscape\n\nYou can use AI in software development to generate code, automate testing, and optimize project management. Learn how to use AI models to reduce errors in code, write code faster, and make data-driven decisions about the development process.\n\nMarch 4, 2025\n\nArticle\n\nWhat Is a Blockchain Engineer? A Career Guide\n\nBlockchain technology is a method of recording information that brings new and exciting career options. Learn more about blockchain engineers and how to enter this career.\n\nMarch 4, 2025\n\nArticle\n\nBusiness\nView all\nEssential Business Management Certifications for Career Success\n\nDiscover the versatility of business management certifications and how the journey to obtaining one may expand your business management knowledge and potentially broaden your career prospects.\n\nMarch 6, 2025\n\nArticle\n\n7 Popular Accounting Certifications\n\nAccounting certifications can help you build specialized knowledge and enhance your skill set. Take a look at seven popular accounting certifications and how they can benefit your career.\n\nMarch 10, 2025\n\nArticle\n\nIT\nView all\nHow to Learn Information Technology\n\nFind out how to learn information technology by exploring IT skills and discovering where to get them.\n\nMarch 12, 2025\n\nArticle\n\nBest Cities for Cybersecurity Jobs in 2025\n\nCybersecurity is an attractive career for many reasons, including the number of places with many opportunities for cybersecurity professionals. Learn more about job roles to consider and the best cities for cybersecurity jobs across the country.\n\nJanuary 3, 2025\n\nArticle\n\nData\nView all\nData Analyst vs. Business Analyst: Which Career Path Is Right for You? [VIDEO]\n\nLove data and want a career that's both in-demand AND rewarding? This video breaks down two hot roles - Data Analyst and Business Analyst - to help you choose the path that's right for you.\n\nJanuary 24, 2025\n\nArticle\n\nWhat Is a Data Analytics Certification?\n\nPursuing data analytics certification could start or advance your career as a data analyst. Learn who can benefit from a data analytics certification and explore which credential might be right for your career goals.\n\nFebruary 19, 2025\n\nArticle\n\nBuild job-ready skills with a Coursera Plus subscription\nStart 7-day free trial\nGet access to 10,000+ learning programs from world-class universities and companies, including Google, Yale, Salesforce, and more\nTry different courses and find your best fit at no additional cost\nEarn certificates for learning programs you complete\nA subscription price of $59/month, cancel anytime\n\nCoursera Footer\n\nTechnical Skills\n\nAnalytical Skills\n\nBusiness Skills\n\nCareer Resources\n\nCoursera\n\nCommunity\n\nMore\n\n© 2025 Coursera Inc. All rights reserved."
  },
  {
    "url": "https://www.khanacademy.org",
    "text": "For every student,\nevery classroom.\n\nReal results.\n\nWe’re a nonprofit with the mission to provide a free, world-class education for anyone, anywhere.\n\nStart here\nMath: Pre-K - 8th grade\nPre-K through grade 2 (Khan Kids)\nEarly math review\n2nd grade\n3rd grade\n4th grade\n5th grade\n6th grade\n7th grade\n8th grade\nBasic geometry and measurement\nSee Pre-K - 8th Math\nMath: high school & college\nAlgebra 1\nGeometry\nAlgebra 2\nIntegrated math 1\nIntegrated math 2\nIntegrated math 3\nAlgebra basics\nTrigonometry\nPrecalculus\nHigh school statistics\nStatistics & probability\nCollege algebra\nAP®︎/College Calculus AB\nAP®︎/College Calculus BC\nAP®︎/College Statistics\nMultivariable calculus\nDifferential equations\nLinear algebra\nSee all Math\nMath: Get ready courses\nGet ready for 3rd grade\nGet ready for 4th grade\nGet ready for 5th grade\nGet ready for 6th grade\nGet ready for 7th grade\nGet ready for 8th grade\nGet ready for Algebra 1\nGet ready for Geometry\nGet ready for Algebra 2\nGet ready for Precalculus\nGet ready for AP® Calculus\nGet ready for AP® Statistics\nReading & language arts\nUp to 2nd grade (Khan Kids)\n2nd grade\n3rd grade\n4th grade\n5th grade\n6th grade reading and vocab\n7th grade reading and vocab\n8th grade reading and vocab\n9th grade reading and vocab\n10th grade reading and vocab\nGrammar\nSee all Reading & Language Arts\nLife skills\nSocial & emotional learning (Khan Kids)\nKhanmigo for students\nAI for education\nFinancial literacy\nInternet safety\nSocial media literacy\nGrowth mindset\nCollege admissions\nCareers\nPersonal finance\nSee all Life Skills\nScience\nMiddle school biology\nMiddle school Earth and space science\nMiddle school physics\nHigh school biology\nHigh school chemistry\nHigh school physics\nHands-on science activities\nAP®︎/College Biology\nAP®︎/College Chemistry\nAP®︎/College Environmental Science\nAP®︎/College Physics 1\nSee all Science\nTest prep\nDigital SAT\nGet ready for SAT Prep: Math\nLSAT\nMCAT\nComputing\nIntro to CS - Python\nComputer programming\nAP®︎/College Computer Science Principles\nComputers and the Internet\nPixar in a Box\nSee all Computing\nArts & humanities\nUS history\nAP®︎/College US History\nUS government and civics\nAP®︎/College US Government & Politics\nConstitution 101\nWorld History Project - Origins to the Present\nWorld History Project - 1750 to the Present\nWorld history\nAP®︎/College World History\nBig History Project\nClimate project\nArt history\nAP®︎/College Art History\nSee all Arts & Humanities\nEconomics\nMacroeconomics\nAP®︎/College Macroeconomics\nMicroeconomics\nAP®︎/College Microeconomics\nSee all Economics\nPartner courses\nAncient Art\nAsian Art\nBiodiversity\nMusic\nNASA\nNatural History\nNew Zealand - Natural & cultural history\nNOVA Labs\nPhilosophy\nKhan for educators\nKhan for educators (US)\nKhanmigo for educators\nWhy Khan Academy works\nPersonalized learning\nStudents practice at their own pace, first filling in gaps in their understanding and then accelerating their learning.\nTrusted content\nCreated by experts, Khan Academy’s library of trusted practice and lessons covers math, science, and more. Always free for learners and teachers.\nTools to empower teachers\nWith Khan Academy, teachers can identify gaps in their students’ understanding, tailor instruction, and meet the needs of every student.\nTEACHERS\nDifferentiate your classroom and engage every student.\n\nWe empower teachers to support their entire classroom. 90% of US teachers who have used Khan Academy have found us effective.\n\nTeachers, start here\nLEARNERS AND STUDENTS\nYou can learn anything.\n\nBuild a deep, solid understanding in math, science, and more.\n\nLearners, start here\n“I come from a poor family. At home it’s one room, just a room we live in. When I was a child, I used to fear mathematics. But now, I am in love with mathematics because of Khan Academy.”\nANJALI\nINDIA\nTOGETHER WE CAN MAKE A DIFFERENCE\nEvery child deserves the chance to learn.\n\nAcross the globe, 617 million children are missing basic math and reading skills. We’re a nonprofit delivering the education they need, and we need your help. You can change the course of a child’s life.\n\nGive them the chance\nJoin Khan Academy today\nLearners\nTeachers\nParents\nBack\nKey supporters"
  },
  {
    "url": "https://www.edx.org/course"
  },
  {
    "url": "https://www.nature.com",
    "text": "Your privacy, your choice\n\nWe use essential cookies to make sure the site can function. We, and our 96 partners, also use optional cookies and similar technologies for advertising, personalisation of content, usage analysis, and social media.\n\nBy accepting optional cookies, you consent to allowing us and our partners to store and access personal data on your device, such as browsing behaviour and unique identifiers. Some third parties are outside of the European Economic Area, with varying standards of data protection. See our privacy policy for more information on the use of your personal data. Your consent choices apply to nature.com and applicable subdomains.\n\nYou can find further information, and change your preferences via 'Manage preferences'.\nYou can also change your preferences or withdraw consent at any time via 'Your privacy choices', found in the footer of every page.\n\nWe use cookies and similar technologies for the following purposes:\n\nStore and/or access information on a device\nPersonalised advertising and content, advertising and content measurement, audience research and services development\nAccept all cookies\nReject optional cookies\nManage preferences\nSkip to main content\n\nAdvertisement\n\nView all journals\nSearch\nLog in\nExplore content\nAbout the journal\nPublish with us\n‘My career is over’: Columbia University scientists hit hard by Trump team’s cuts\n\nThe US government has begun slashing US$400 million in research grants at Columbia University over pro-Palestinian campus protests.\n\nFeatured Content\nMan survives with titanium heart for 100 days – a world first\n\nThe device, to be tested in more people, could be used as a temporary measure for those waiting for a donor organ.\n\nSmriti Mallapaty\nNews13 Mar 2025\nDon’t wait out four hard years: speak truth to power\n\nThe importance of diversity in science is an unshakeable reality that the scientific community must stand by.\n\nArthur Caplan\nWorld View17 Mar 2025\nRecord sea surface temperature jump in 2023–2024 unlikely but not unexpected\n\nObservations and climate models suggest that the global sea surface temperature jump in 2023–2024 was not unexpected and would have been nearly impossible without anthropogenic warming.\n\nJens TerhaarFriedrich A. BurgerThomas F. Stocker\nArticleOpen Access12 Mar 2025\nDaily briefing: Should the Stanford Prison Experiment be retracted?\n\nLeopard-spotted rocks are ‘an intriguing signal’ of microbial life on Mars. Plus, should the infamous Stanford Prison Experiment be retracted more than 50 years on?\n\nJacob Smith\nNature Briefing13 Mar 2025\nContents\nSubscribe\nCurrent Issue13 Mar 2025\nAdvertisement\nNews & Comment\nThe untamed river and the Moog: Books in brief\n\nAndrew Robinson reviews five of the best science picks.\n\nAndrew Robinson\nBook Review17 Mar 2025\nHow researchers can work fairly with Indigenous and local knowledge\nOscar Allan\nCareer Feature17 Mar 2025\nI spent two years organizing an international conference. How do I get compensated for my work?\nNikki Forrester\nCareer Feature17 Mar 2025\nDon’t wait out four hard years: speak truth to power\nArthur Caplan\nWorld View17 Mar 2025\nA radical manifesto for truth\nJulia P. G. Jones\nBook Review17 Mar 2025\n‘Science is happening’: Israeli and Palestinian scientists continue collaborations amid conflict\nJosie Glausiusz\nNews17 Mar 2025\nWhat’s in store for US science as funding bill averts government shutdown\nJeff Tollefson\nNews17 Mar 2025\nLatest Reviews & Analysis\nFossilized dinosaur cells that defied the ravages of time — 20 years since a key discovery\n\nThe 2005 finding of cells and blood vessels in dinosaur bone launched a systematic search for fossil remnants of biomolecules, creating innovations in methods and applications.\n\nJasmina Wiemann\nNews & Views17 Mar 2025\nThe early origins of bone-tool manufacturing traditions by hominins 1.5 million years ago\n\nExcavations at Olduvai Gorge, Tanzania, reveal evidence of the systematic use of animal bones as a raw material for prehistoric tools.\n\nMarta Mirazón Lahr\nNews & Views17 Mar 2025\nErrors in the Huntington’s disease gene accumulate slowly and then all at once\n\nInherited repeat mutations in the HTT gene expand in neurons over decades before crossing a toxic threshold, revealing a long time window for therapy.\n\nVeera M. RajagopalSahar Gelfman\nNews & Views17 Mar 2025\nLiver cancer recurrence predicted by immune-cell location and gene expression\n\nImmune cells called natural killer cells can target and eliminate tumours. The gene expression and spatial distribution of the immune cells in the tumour microenvironment indicates whether liver cancer will recur after surgery.\n\nChristian M. Schürch\nNews & Views12 Mar 2025\nAn archaic European face more than one million years old\n\nThe partial midface of a hominin fossil has been found in the Sima del Elefante cave site near Burgos, northern Spain, and dates to between 1.4 million and 1.1 million years ago. Its discovery enables the exploration of the facial features of early Europeans and enhances our understanding of the evolutionary history of European ancestors.\n\nResearch Briefing12 Mar 2025\nImmune molecule links COVID‑19 with severe inflammatory disorder in children\nResearch Briefing12 Mar 2025\nThe brain’s building blocks for understanding social interactions\nResearch Briefing12 Mar 2025\nAn operating system for networked quantum computers is a huge practical step forward\nClaudio Cicconetti\nNews & Views12 Mar 2025\nBiodiversity declines across fragmented forests\nRobert J. Fletcher Jr\nNews & Views12 Mar 2025\nLatest Research articles\nHigh temporal variability not trend dominates Mediterranean precipitation\n\nOur assessment of a 27-country weather station dataset in the Mediterranean region revealed long-term stability in precipitation over 150 years, along with substantial short-term variability on annual to decadal scales driven by atmospheric circulation; these findings align with the precipitation trends seen in CMIP6 models.\n\nSergio M. Vicente-SerranoYves TramblayVera Potopová\nArticleOpen Access12 Mar 2025\nGenomic determinants of antigen expression hierarchy in African trypanosomes\n\nA highly sensitive single-cell RNA sequencing approach reveals genomic features controlling the order of antigen activation in the model protozoan parasite Trypanosoma brucei.\n\nZhibek KeneskhanovaKirsty R. McWilliamT. Nicolai Siegel\nArticleOpen Access12 Mar 2025\nPerception of viral infections and initiation of antiviral defence in rice\n\nViral coat proteins are perceived by the RING1–IBR–RING2-type ubiquitin ligase, initiating the first step of the natural antiviral response in rice.\n\nYu HuangJialin YangYi Li\nArticleOpen Access12 Mar 2025\nTGFβ links EBV to multisystem inflammatory syndrome in children\n\nMultisystem inflammatory syndrome following SARS-CoV-2 infection results from increased serum levels of TGFβ, which impairs the reactivation of virus-specific T cells.\n\nCarl Christoph GoetzkeMona MassoudMir-Farzin Mashreghi\nArticleOpen Access12 Mar 2025\nAn operating system for executing applications on quantum network nodes\n\nA new quantum operating system architecture is described that is capable of executing applications on quantum networks in high-level software, which is a step towards bringing quantum network technology to society.\n\nC. Delle DonneM. IulianoS. Wehner\nArticleOpen Access12 Mar 2025\nCollections\nHow Trump 2.0 is reshaping science\nSince US President Donald Trump took office in January 2025, his team has made major changes to the federal government that have disrupted research and research institutions in the United States and beyond.\nCollection 26 Feb 2025\n\nAdvertisement\n\nTrending - Altmetric\nThe earliest human face of Western Europe\n‘My career is over’: Columbia University scientists hit hard by Trump team’s cuts\nNASA begins mass firings of scientists ahead of Trump team’s deadline\nFour ways COVID changed virology: lessons from the most sequenced virus of all time\nScience jobs\nPOSTDOC POSITION, GELERNTER LAB\n\nPOSTDOC POSITION, GELERNTER LAB, YALE UNIVERSITY SCHOOL OF MEDICINE, DIVISION OF HUMAN GENETICS IN PSYCHIATRY\n\nNew Haven, Connecticut\n\nYale School of Medicine - Gelernter Lab\n\nSpaces: professor, associate professor, assistant professor\n\nShenzhen, Guangdong (CN)\n\nThe Chinese University of Hong Kong, Shenzhen (CUHK Shenzhen)\n\nFaculty positions in Center for Interdisciplinary Studies (CIS), Westlake University\n\nThe Center for Interdisciplinary Studies (CIS) invites applications for multiple faculty positions in both theory and experiment.\n\nHangzhou, Zhejiang, China\n\nWestlake University\n\nFaculty Recruitment, Westlake University School of Medicine\n\nFaculty positions are open at four distinct ranks: Assistant Professor, Associate Professor, Full Professor, and Chair Professor.\n\nHangzhou, Zhejiang, China\n\nWestlake University\n\nFaculty Positions, Aging and Neurodegeneration, Westlake Laboratory of Life Sciences and Biomedicine\n\nApplicants with expertise in aging and neurodegeneration and related areas are particularly encouraged to apply.\n\nHangzhou, Zhejiang, China\n\nWestlake Laboratory of Life Sciences and Biomedicine (WLLSB)\n\nAdvertisement\n\nTop headline image: Luiz C. Ribeiro/New York Daily News/TNS/Alamy\n\nIssue cover: Cover image: Kelly Krause/Nature\n\nNature (Nature) ISSN 1476-4687 (online) ISSN 0028-0836 (print)\n\nnature.com sitemap\nAbout Nature Portfolio\nAbout us\nPress releases\nPress office\nContact us\nDiscover content\nJournals A-Z\nArticles by subject\nprotocols.io\nNature Index\nPublishing policies\nNature portfolio policies\nOpen access\nAuthor & Researcher services\nReprints & permissions\nResearch data\nLanguage editing\nScientific editing\nNature Masterclasses\nResearch Solutions\nLibraries & institutions\nLibrarian service & tools\nLibrarian portal\nOpen research\nRecommend to library\nAdvertising & partnerships\nAdvertising\nPartnerships & Services\nMedia kits\nBranded content\nProfessional development\nNature Careers\nNature\n Conferences\nRegional websites\nNature Africa\nNature China\nNature India\nNature Italy\nNature Japan\nNature Middle East\nPrivacy Policy Use of cookies Your privacy choices/Manage cookies Legal notice Accessibility statement Terms & Conditions Your US state privacy rights Cancel contracts here\n\n© 2025 Springer Nature Limited"
  },
  {
    "url": "https://www.sciencedirect.com"
  },
  {
    "url": "https://arxiv.org",
    "text": "arXiv is a free distribution service and an open-access archive for nearly 2.4 million scholarly articles in the fields of physics, mathematics, computer science, quantitative biology, quantitative finance, statistics, electrical engineering and systems science, and economics. Materials on this site are not peer-reviewed by arXiv.\n\nSubject search and browse:\n\nPhysics\nMathematics\nQuantitative Biology\nComputer Science\nQuantitative Finance\nStatistics\nElectrical Engineering and Systems Science\nEconomics\n   \nPhysics\nAstrophysics (astro-ph new, recent, search) Astrophysics of Galaxies; Cosmology and Nongalactic Astrophysics; Earth and Planetary Astrophysics; High Energy Astrophysical Phenomena; Instrumentation and Methods for Astrophysics; Solar and Stellar Astrophysics\nCondensed Matter (cond-mat new, recent, search) Disordered Systems and Neural Networks; Materials Science; Mesoscale and Nanoscale Physics; Other Condensed Matter; Quantum Gases; Soft Condensed Matter; Statistical Mechanics; Strongly Correlated Electrons; Superconductivity\nGeneral Relativity and Quantum Cosmology (gr-qc new, recent, search)\nHigh Energy Physics - Experiment (hep-ex new, recent, search)\nHigh Energy Physics - Lattice (hep-lat new, recent, search)\nHigh Energy Physics - Phenomenology (hep-ph new, recent, search)\nHigh Energy Physics - Theory (hep-th new, recent, search)\nMathematical Physics (math-ph new, recent, search)\nNonlinear Sciences (nlin new, recent, search)\nincludes: Adaptation and Self-Organizing Systems; Cellular Automata and Lattice Gases; Chaotic Dynamics; Exactly Solvable and Integrable Systems; Pattern Formation and Solitons\nNuclear Experiment (nucl-ex new, recent, search)\nNuclear Theory (nucl-th new, recent, search)\nPhysics (physics new, recent, search)\nincludes: Accelerator Physics; Applied Physics; Atmospheric and Oceanic Physics; Atomic and Molecular Clusters; Atomic Physics; Biological Physics; Chemical Physics; Classical Physics; Computational Physics; Data Analysis, Statistics and Probability; Fluid Dynamics; General Physics; Geophysics; History and Philosophy of Physics; Instrumentation and Detectors; Medical Physics; Optics; Physics and Society; Physics Education; Plasma Physics; Popular Physics; Space Physics\nQuantum Physics (quant-ph new, recent, search)\nMathematics\nMathematics (math new, recent, search)\nincludes: (see detailed description): Algebraic Geometry; Algebraic Topology; Analysis of PDEs; Category Theory; Classical Analysis and ODEs; Combinatorics; Commutative Algebra; Complex Variables; Differential Geometry; Dynamical Systems; Functional Analysis; General Mathematics; General Topology; Geometric Topology; Group Theory; History and Overview; Information Theory; K-Theory and Homology; Logic; Mathematical Physics; Metric Geometry; Number Theory; Numerical Analysis; Operator Algebras; Optimization and Control; Probability; Quantum Algebra; Representation Theory; Rings and Algebras; Spectral Theory; Statistics Theory; Symplectic Geometry\nComputer Science\nComputing Research Repository (CoRR new, recent, search)\nincludes: (see detailed description): Artificial Intelligence; Computation and Language; Computational Complexity; Computational Engineering, Finance, and Science; Computational Geometry; Computer Science and Game Theory; Computer Vision and Pattern Recognition; Computers and Society; Cryptography and Security; Data Structures and Algorithms; Databases; Digital Libraries; Discrete Mathematics; Distributed, Parallel, and Cluster Computing; Emerging Technologies; Formal Languages and Automata Theory; General Literature; Graphics; Hardware Architecture; Human-Computer Interaction; Information Retrieval; Information Theory; Logic in Computer Science; Machine Learning; Mathematical Software; Multiagent Systems; Multimedia; Networking and Internet Architecture; Neural and Evolutionary Computing; Numerical Analysis; Operating Systems; Other Computer Science; Performance; Programming Languages; Robotics; Social and Information Networks; Software Engineering; Sound; Symbolic Computation; Systems and Control\nQuantitative Biology\nQuantitative Biology (q-bio new, recent, search)\nincludes: (see detailed description): Biomolecules; Cell Behavior; Genomics; Molecular Networks; Neurons and Cognition; Other Quantitative Biology; Populations and Evolution; Quantitative Methods; Subcellular Processes; Tissues and Organs\nQuantitative Finance\nQuantitative Finance (q-fin new, recent, search)\nincludes: (see detailed description): Computational Finance; Economics; General Finance; Mathematical Finance; Portfolio Management; Pricing of Securities; Risk Management; Statistical Finance; Trading and Market Microstructure\nStatistics\nStatistics (stat new, recent, search)\nincludes: (see detailed description): Applications; Computation; Machine Learning; Methodology; Other Statistics; Statistics Theory\nElectrical Engineering and Systems Science\nElectrical Engineering and Systems Science (eess new, recent, search)\nincludes: (see detailed description): Audio and Speech Processing; Image and Video Processing; Signal Processing; Systems and Control\nEconomics\nEconomics (econ new, recent, search)\nincludes: (see detailed description): Econometrics; General Economics; Theoretical Economics\nAbout arXiv\nGeneral information\nHow to Submit to arXiv\nMembership & Giving\nWho We Are"
  },
  {
    "url": "https://plato.stanford.edu"
  },
  {
    "url": "https://www.gutenberg.org"
  },
  {
    "url": "https://www.howstuffworks.com",
    "text": "No, the Leaf Sheep Sea Slug Is Not an AI Hallucination\n\nOur Top Reads\n\nHow to Clean Copper With Lemon, Vinegar or Ketchup\n\nBy Zach Taras\n\nThundersnow Only Occurs in 7 of Every 100,000 Thunder Storms\n\nBy Mitch Ryan\n\nCherubim According to the Bible (Not Arrow-shooting Cupids)\n\nBy Mack Hayden\n\nHow to Clean a Coffee Maker for a Better-tasting Cuppa Joe\n\nHow to Get Nail Polish out of Clothes: 6 Steps for Stain Removal\n\nWhat Happened to SoBe Drinks?\n\n15 Most Expensive Cat Breeds in the World\n\nTry Our Crosswords, Riddles and Puzzles!\n\nCan You Solve This Riddle?\n\nPlay Our Crossword!\n\nIn the News\n\nWhat Does Mummification Have to Do With Gene Hackman?\n\nFeb. 27 By Nicole Antonio\n\nNorwegian Forest Cat vs. Maine Coon: A Battle of Seriously Big Cats\n\nFeb. 24 By Talon Homer, Mark Mancini\n\nDoomsday Clock Now Closest It's Ever Been to Midnight\n\nJan. 29 By Julia Layton\n\nThe Heaven's Gate Cult: A Sad, Strange Story of Manipulation\n\nJan. 29 By Yara Simón, Nathan Chandler\n\nThe Seahorse Is a Romantic, Slow-swimming Fish\n\nJan. 28 By Talon Homer, Wendy Bowman\n\nThe Oldest President of the U.S. Is a Repeat Record-holder\n\nJan. 17 By Mitch Ryan\n\nSea Spiders Breathe Through Pores in Their Legs\n\nKoi Fish Are 'Living Jewels' of the Water Garden\n\nDid You Hear?\n\nNeanderthal vs. Homo Sapien: Separate Species With Different Fates\n\nHow to Clean Baseboards With a Dryer Sheet\n\n12 Orange Cat Breeds That Will Fuel Your Love of Gingers\n\nHow to Clean Shower Glass: A Quick and Easy Method\n\nWhich Anime Couple Do You Vibe With the Most?\n\nScience\n\nThe IQ Scale: What Does Your IQ Score Really Mean?\n\nWorm, Harvest, Blue: Every Full Moon Has a Name\n\nWhat Is a Sonic Boom? Unraveling the Thunderous Phenomenon\n\nThat's Not the Aurora Borealis, That's Just STEVE\n\nCulture\n\nThe Misunderstood Legacy of Martin Luther King Jr.\n\nRahab: The Biblical Prostitute in the 'Faith Hall of Fame'\n\nHow Cesar Chavez United Thousands of Farmworkers and Became a Civil Rights Icon\n\nCan Red Flag Laws Help Prevent Mass Killings?\n\nAnimals\n\nWWII Sparked America's Shark Obsession, Not 'Jaws' or Shark Week\n\nWhat Do Laughing Kookaburras Find So Funny?\n\nWasps Have an Image Problem, But Here's Why We Need Them\n\nBiggest Snakes in the World by Length and by Weight\n\nAuto\n\nWho Does — and Doesn't — Get Featured on Blue Highway Exit Signs?\n\nHow Automotive Glass Works\n\nHow Electric Cars Work\n\nWhat Happens if I Put Sugar in Someone's Gas Tank?\n\nEditor's Picks\n\nThe Sun Spider Is an Arachnid but Not an Actual Spider\n\nDid You Know There Are 23 Countries in North America?\n\nA River Runs Through It\n\nThe 9 Longest Rivers in the World: From the Nile to the Congo\n\nWhen it comes to rivers, longest doesn't necessarily mean biggest, and length can be difficult to determine, so the top spot will always be debated.\n\nEco Engineers: 5 Animals That Can Reshape Earth's Waterways\n\nRiver-bottom Bones: The Strange World of Underwater Fossil Hunting\n\nGet Your Garden On\n\nHow 'Lasagna Gardening' Helps Create Healthy Soil\n\nHow Composting Works\n\nCompanion Planting: The Do's and Don'ts of Growing Plants Together\n\nLearn which plants benefit each other - and which plants shouldn't be neighbors - to get the most out of your garden.\n\nDeserts of the World\n\n5 of Earth's Highest Deserts\n\nNot all deserts have sand and they're certainly not all hot. They're just extremely dry and have little vegetation. That means deserts are located all over the planet, including at super-high elevations.\n\n10 Largest Deserts in the World\n\nHunting for Martians in the Most Extreme Desert on Earth"
  },
  {
    "url": "https://www.npr.org",
    "text": "Accessibility links\nSkip to main content\nKeyboard shortcuts for audio player\nNPR 24 Hour Program Stream\nOn Air Now\nHOURLY NEWS\nLISTEN LIVE\nMY PLAYLIST\nOpen Navigation Menu\nDONATE\nManuel Balce Ceneta/AP\nPOLITICS\nTrump tries to void Biden's pardons, blaming autopen. Many presidents have used it\n\nTrump claims without evidence that Biden's Jan. 6 panel pardons are void because he allegedly used an autopen. Autopens have been popular with presidents for decades. Here's what to know about them.\n\nMichal Fludra/NurPhoto via Getty Images\nNATIONAL\nNavy warship is sent to the southern border to carry out Trump's immigration plans\n\n\nNick Ut/ASSOCIATED PRESS\n/AP\nCLIMATE\nHeat can age you as much as smoking, a new study finds\nSCIENCE\nChatGPT can help write an essay. Scientists want it to start folding laundry\nJulia Demaree Nikhinson/AP\nNATIONAL\nTrump invoking Alien Enemies Act to deport is 'a threat to everyone,' lawyer argues\nMark Lennihan/AP\nBUSINESS\nForever 21 is bankrupt, again. This time actually could be forever\nOsamah Abdulrahman/AP\nMIDDLE EAST\nTrump blames Iran for Houthi attacks on shipping after U.S. strikes in Yemen\nLatest Stories\n11 minutes ago\nPentagon website removes, then restores, page honoring Black Medal of Honor recipient\n53 minutes ago\nConan O'Brien will return as Oscars host in 2026\n1 hour ago\nNavy warship is sent to the southern border to carry out Trump's immigration plans\n3 hours ago\nWhat Russia and Ukraine want out of talks, as Trump speaks to Putin Tuesday\n3 hours ago\nTrump blames Iran for Houthi attacks on shipping after U.S. strikes in Yemen\nNavigate backwards\nNavigate forwards\nPick Your NPR Station\n\nLooking for your favorite local station's stories or live stream?\n\nSTATION FINDER\nAlexei Babushkin/Sputnik/Reuters\nUKRAINE INVASION — EXPLAINED\nWhat Russia and Ukraine want out of talks, as Trump speaks to Putin Tuesday\n\nPresident Trump will speak with Russian President Vladimir Putin on Tuesday, as the U.S. pursues a ceasefire deal in Ukraine.\n\nJoseph Prezioso/AFP via Getty Images\nNATIONAL\n2 separate cases place the immigration lens on Boston\n\nTwo people legally in the U.S. who flew into a Boston airport have been denied reentry into the country after traveling abroad. One was deported in apparent defiance of a judicial order.\n\nLISTEN· 3:30\nPLAYLIST\nTranscript\nEmbed\nTranscript\nLawyers for Rhode Island doctor allege she was deported despite federal court order\nTHE PUBLIC'S RADIO\nSimon & Schuster\nREVIEW\nBOOK REVIEWS\n'The Buffalo Hunter Hunter' is Stephen Graham Jones' horror masterpiece\n\nThe prose is gorgeous and the plot is complex. The author of The Only Good Indians returns again with a spellbinding yarn about one of the bloodiest, most significant parts of the nation's history.\n\nWATCH\nYseult: Tiny Desk Concert\nVolume 90%\n \n\nYseult: Tiny Desk Concert\n\nThe Staves: Tiny Desk Concert\n\nCharly Bliss: Tiny Desk Concert\n\nJonathan Scales Fourchestra: Tiny Desk Concert\n\nThird Eye Blind: Tiny Desk Concert\n\nAmbré: Tiny Desk Concert\n\n.idk. & Sector 202: Tiny Desk Concert\n\nMegan Moroney: Tiny Desk Concert\n\nSaya Gray: Tiny Desk Concert\n\nAbel Selaocoe: Tiny Desk Concert\n\nMarvin Sapp: Tiny Desk Concert\n\nIgmar Thomas' Revive Big Band: Tiny Desk Concert\n\nLeon Thomas: Tiny Desk Concert\n\nBartees Strange: Tiny Desk Concert\n\ngirl in red: Tiny Desk Concert\n\nYasmin Williams: Tiny Desk Concert\n\nRoberto Fonseca: Tiny Desk Concert\n\nBraxton Cook: Tiny Desk Concert\n\nFaye Webster: Tiny Desk Concert\n\nMJ Lenderman: Tiny Desk Concert\n\nCarminho: Tiny Desk Concert\n\nBilal: Tiny Desk Concert\n\nThe Red Clay Strays: Tiny Desk Concert\n\nFrom the Top: Tiny Desk Concert\n\nMachel Montano: Tiny Desk Concert\n\nIsata Kanneh-Mason: Tiny Desk Concert\n\nSabrina Carpenter: Tiny Desk Concert\n\nYo Gabba GabbaLand!: Tiny Desk Concert\n\nWaxahatchee: Tiny Desk Concert\n\nBillie Eilish: Tiny Desk Concert\n\nStereophonic: Tiny Desk Concert\n\nDoechii: Tiny Desk Concert\n\nOld Crow Medicine Show: Tiny Desk Concert\n\nRosie Tucker: Tiny Desk Concert\n\nTV On The Radio: Tiny Desk Concert\n\nTeedra Moses: Tiny Desk Concert\n\nWyatt Flores: Tiny Desk Concert\n\nThe Magnetic Fields: Tiny Desk Concert\n\nDurand Jones: Tiny Desk Concert\n\nYunchan Lim: Tiny Desk Concert\n\nElmiene: Tiny Desk Concert\n\nLaRussell: Tiny Desk Concert\n\nSheer Mag: Tiny Desk Concert\n\nChelsea Wolfe: Tiny Desk Concert\n\nSylo: Tiny Desk Concert\n\nDua Lipa: Tiny Desk Concert\n\nThe Baylor Project: Tiny Desk Concert\n\nKamasi Washington: Tiny Desk Concert\n\nYseult: Tiny Desk Concert\n\nThe French singer-songwriter's fearless energy is on full display at the Tiny Desk.\n\njure/Getty Images\nSHOTS - HEALTH NEWS\nMeasles remains a danger to health even years after an infection\n\nThe measles outbreak in Texas and New Mexico is now close to 300 cases. Most are unvaccinated children. People usually recover, but doctors are stressing how dangerous and long-lasting it can be.\n\nLISTEN· 3:47\nPLAYLIST\nTranscript\nEmbed\nTranscript\nAP/El Salvador presidential press office\nTHE AMERICAS\nWhat to know about CECOT, El Salvador's mega-prison where U.S. migrants are being sent\n\nThe mega-prison in El Salvador, where visitation, recreation and education are not allowed, has became the latest tool in President Trump's crackdown on immigration.\n\nTren de Aragua — all you need to know about the Venezuelan gang\nRodrique Ngowi/AP\nTECHNOLOGY\nA Tesla protester targeted by Elon Musk speaks out: 'I have to protect myself'\n\n\"When one of the most powerful, if not the most powerful person in the world is saying you've committed a crime, it doesn't matter what the truth is,\" says Valerie Costa, an anti-Tesla protester.\n\nLISTEN· 3:18\nPLAYLIST\nTranscript\nEmbed\nTranscript\nRon Blunt/Kennedy Center\nCULTURE\nTrump will attend today's Kennedy Center board meeting as its new chair\n\nPresident Trump will tour the Kennedy Center today and attend its board meeting, where reports say he may rejigger how the performing arts honorees are chosen.\n\nErin Hooley/AP\nHISTORY\nDyeing the Chicago River green is a St. Patrick's Day tradition. How did it start?\n\nFor more than 60 years, Chicago has turned its downtown river green to celebrate St. Patrick's Day. The annual tradition actually has its roots in a big problem for the city: sewage.\n\nPatricia Lim/KUTX\nSouth by Southwest is downsizing in 2026\nKUT 90.5\n\nNext year the festival in Austin, Texas, will be two days shorter and will not feature a dedicated music weekend.\n\nHarris & Ewing/Library of Congress\nRADIO DIARIES\nLightfoot Solomon Michaux: The Black preacher and broadcaster who feuded with MLK\n\nElder Lightfoot Solomon Michaux was a renowned Black preacher and broadcaster. Radio Diaries' series \"Making Waves\" looks at his life and his contentious relationship with Martin Luther King Jr.\n\nLISTEN· 13:56\nPLAYLIST\nTranscript\nEmbed\nTranscript\nMostafa Bassim/Anadolu via Getty Images\nNATIONAL\n'I think he knew': Mahmoud Khalil's wife on his detention and her search for answers\n\nOn March 8, Mahmoud Khalil, a pro-Palestinian activist and former Columbia University graduate student, was detained by federal agents. His wife, Noor Abdalla, witnessed the arrest.\n\nLISTEN· 7:46\nPLAYLIST\nTranscript\nEmbed\nTranscript\nScott Olson/Getty Images\nFire danger is not over for Oklahoma as high winds continue\nKOSU\n\nWildfires that started on Friday have resulted in four people being killed, 142 injured, more than 170,000 acres scorched and 400 homes damaged.\n\nGlenna Osborne\nMY UNSUNG HERO\nHow a firefighter's quick action saved his friend's life\n\nRonald Osborne was a firefighter for many years. Early in his career, while battling a house fire, his life was in danger. It was another firefighter's quick thinking that saved him.\n\nScott Olson/Getty Images\nBUSINESS\nWholesale egg prices are going down. How soon will it affect your grocery bill?\n\nEconomists say the sharp decline in wholesale egg prices is a positive sign, with some anticipating lower prices at grocery stores in a few weeks.\n\nCharity Rachelle for NPR\nCOVID 5 YEARS LATER\nHow Alabama students went from last place to rising stars in math\n\nAlabama is the only state where 4th-grade math scores are higher now than they were in 2019, before the pandemic. This is the story of how the state pulled it off.\n\nLISTEN· 6:39\nPLAYLIST\nTranscript\nEmbed\nTranscript\nDaniel de la Hoz/Moment RF/Getty Images\nLIVING BETTER\nHere are 4 ways parents can help their teens be smart with screen time\n\nWith teens, it doesn't help to just say no to screen time. Instead, experts suggest teaching them to be smarter viewers of content, and learn to recognize how influencers and algorithms can manipulate them.\n\nLISTEN· 3:27\nPLAYLIST\nTranscript\nEmbed\nTranscript\nAmnajKhetsamtip/iStockphoto/Getty Images\nHEALTH INC.\nA law in New York pushes doctors to be upfront about patients' costs\nKFF HEALTH NEWS\n\nThe law originally banned health care providers from forcing patients to agree to pay medical bills, no matter the cost. Consumer groups say an amended version doesn't go far enough.\n\nCaleb Alvarado/Caleb Alvarado for NPR\nLIFE, AFTER DIAGNOSIS\nHer cancer diagnosis made motherhood both harder and more sweet\n\nAs cancer rates rise among people under 50, more and more parents are facing the heightened emotions and challenging logistics of raising kids while going through treatment.\n\nGlenn Arcos/AFP via Getty Images\nWORLD\nForget about rare earth minerals. We need more copper\n\nIn recent weeks, you've likely heard a lot about rare-earth substances with hard-to-pronounce names, but experts warn that the shortage of another crucial metal, copper, could be just as concerning.\n\nTeresa Castracane Photography\nCULTURE\nJohn Kani risked his life to tell stories of apartheid — at 81, he's still at it\n\nThe South African actor has been speaking out about racial injustice for decades, often in collaboration with the late playwright Athol Fugard. Kunene and the King is Kani's latest project.\n\nMartin Mejia/AP\nTHE AMERICAS\nA Peruvian farmer goes head to head with German energy giant in a climate test case\n\nSaul Luciano Lliuya lives in the heart of the Peruvian Andes, below a lake overflowing with 35 times more glacier meltwater than usual. If it bursts, the lives and homes of 50,000 people are at risk.\n\nLISTEN· 3:07\nPLAYLIST\nTranscript\nEmbed\nTranscript\nAbdel Kareem Hana/AP\nMIDDLE EAST CRISIS — EXPLAINED\nWhy are the Israel-Hamas ceasefire talks stuck? An explainer on the latest\n\nArab mediators are working to reach a new Israel-Hamas ceasefire deal that would secure the release of 11 living hostages out of the 24 still believed to be held alive by Hamas in Gaza.\n\nLISTEN· 7:16\nPLAYLIST\nTranscript\nEmbed\nTranscript\nBrandon Sumrall/Getty Images\nSPORTS\nMarch Madness brackets are set. The SEC dominates the men's with a record 14 teams\n\nIn an all-time record, 14 of the 68 teams in the men's tournament all come from one conference — the SEC. In the women's, UCLA and South Carolina are top seeds. Games tip off this coming week.\n\nMarch Madness is expected to generate $3.1 billion in bets. This expert urges caution\nAwinash Kulkarni\nGOATS AND SODA\nHere are 8 photography winners with disabilities who show the world their perspective\n\nHere are the winning entries in this year's Global Ability Photography Challenge.\n\nmore from\nnews\nculture\nmusic\nREAD & LISTEN\nHome\nNews\nCulture\nMusic\nPodcasts & Shows\nCONNECT\nNewsletters\nFacebook\nInstagram\nPress\nPublic Editor\nCorrections\nContact & Help\nABOUT NPR\nOverview\nDiversity\nNPR Network\nAccessibility\nEthics\nFinances\nGET INVOLVED\nSupport Public Radio\nSponsor NPR\nNPR Careers\nNPR Shop\nNPR Events\nNPR Extra\nterms of use\nprivacy\nyour privacy choices\ntext only\n© 2025 npr\nCookie Consent & Sponsorship Choices\nWe and our 270 partners store and access personal data, like browsing data or unique identifiers, on your device. Selecting Accept All enables tracking technologies to support the purposes shown under we and our partners process data to provide. Selecting Reject All or withdrawing your consent will disable them. If trackers are disabled, some content and ads you see may not be as relevant to you. You can resurface this menu to change your choices or withdraw consent at any time by clicking the Cookie Settings & Opt Out link on the bottom of the webpage . Your choices will have effect within our Website. For more details, refer to our Privacy Policy.\nBy clicking “Accept All,” you agree to the use of cookies, similar tracking and storage technologies, and information about your device to enhance your viewing, listening and user experience, personalize content, personalize messages from NPR’s sponsors, provide social media features, and analyze NPR’s traffic. This information is shared with social media, sponsorship, analytics, and other vendors or service providers.\nWe and our partners process data to provide:\n\nActively scan device characteristics for identification. Store and/or access information on a device. Personalised advertising and content, advertising and content measurement, audience research and services development.\nList of Partners (service providers or vendors)\n\nReject All Accept All\nManage Preferences"
  },
  {
    "url": "https://www.fivethirtyeight.com",
    "text": "ABC News\nPolitical News\nLatest Politics Headlines\nNOAA's Storm Prediction Center facility among planned DOGE cuts\n1 hour ago\nTrump says JFK files will be released on Tuesday\n1 hour ago\n'No one should be taking their legal advice from Donald Trump': Rep. Seth Magaziner\n1 hour ago\nTrump claims Biden pardons for Jan. 6 committee 'void, vacant'\n1 hour ago\nSen. Chuck Schumer's book tour postponed for 'security concerns' amid funding debate\n4 hours ago\nJudge to hear arguments if Trump Admin. violated a court order with mass deportations\nMarch 17\nAdam Kinzinger blasts Trump's claims Jan. 6th committee pardons 'void'\nMarch 17\nTrump claims Biden pardons for Jan. 6 committee 'void, vacant'\nMarch 17\nTimeline: Trump's race against courts to deport gang members under Alien Enemies Act\nMarch 17\nTrump orders attacks against Houthis in Yemen\nMarch 17\nUS strikes 'took out' multiple Houthi leaders: National security adviser Mike Waltz\nMarch 17\nJudge blocks Trump from deporting noncitizens under Alien Enemies Act\nMarch 16\nTrump's trade war throws some Florida businesses into uncertainty\nMarch 16\nDemocrats need to stop infighting 'as quickly as we can': Sen. Whitehouse\nMarch 16\n'This Week' Transcript 8-28-22: WH NSA Mike Waltz, Sen. Whitehouse & Diane Swonk\nMarch 16\nJudge blocks deportations under 1798 law, orders flights turned around\nMarch 16\nDepartment of Education cuts expected to have 'huge impacts' on teachers\nMarch 15\nTrump signs executive order targeting 3rd law firm\nMarch 15\nFinal report on Trump's handling of classified docs should never be released: DOJ\nMarch 15\n3 claims about the Department of Education and what it really does\nMarch 15\nSenate passes continuing resolution to fund government\nMarch 15\nStocks rebound as tariffs weigh on Wall Street\nMarch 14\nObama attorney general endorses candidate in Wisconsin Supreme Court race\nMarch 14\nCalifornia Democratic representative on spending bill, economy\nMarch 14\nTrump lays out vision for Justice Department: Analysis\nMarch 14\nWith Democrats' help, Senate votes to avert a government shutdown\nMarch 14\nTrump, at Justice Department, decries 'weaponization' after prosecutions dismissed\nMarch 14\nHouse Democratic leader Jeffries pushes back on divisions with Senate Democrats\nMarch 14\nChuck Schumer is 'doing the right thing': Rep. Don Bacon\nMarch 14\nHouse Democratic leader Jeffries pushes back on divisions with Senate Democrats\nMarch 14\nTrump rails against prosecutions, touts Jan. 6 hostages in visit to DOJ\nMarch 14\nDr. Oz grilled over cuts at Senate hearing as he vies to lead Medicaid, Medicare\nMarch 14\nSchumer spending bill fallout a symptom of disjointed Democratic strategy: ANALYSIS\nMarch 14\nWhite House NSA Mike Waltz & Sen. Sheldon Whitehouse Sunday on ‘This Week’\nMarch 14\nDr. Mehmet Oz delivers opening remarks at confirmation hearing\nMarch 14\nSchumer says he's is supporting GOP funding bill to stop ‘unimaginable harm’ by Trump\nMarch 14\n'Tremendous mistake': Rep. Ocasio-Cortez blasts Schumer over GOP funding plan vote\nMarch 14\nDr. Oz, Trump's nominee to lead Medicaid, Medicare, faces Senate grilling\nMarch 14\nGOP lawmaker booed by crowd at North Carolina town hall\nMarch 14\nTrump to visit Department of Justice after dismissal of his historic prosecutions\nMarch 14\nAG gets extended deadline to recommend killing gun control policies: DOJ\nMarch 14\nSchumer announces he will vote to keep government open, likely avoiding shutdown\nMarch 14\nFederal judge orders Trump admin to reinstate thousands of probationary employees\nMarch 14\nSchumer announces he'll vote to keep government open, likely avoiding shutdown\nMarch 14\nTop lawyer at IRS removed amid DOGE push for taxpayer information: Sources\nMarch 14\nSen. Merkley on plans to vote ‘Hell No!’ to house spending bill proposal\nMarch 14\nUSAID official describes escaping violence in Congo amid agency turmoil\nMarch 13\nJudge orders thousands of federal workers reinstated; slams 'sham' admin declaration\nMarch 13\nWhite House pulls CDC nominee because they didn’t have the votes: Sources\nMarch 13\nGovernment shutdown: Which parks, museums and monuments could be closed?\nMarch 13\nTrump administration updates: Officials question court's authority over deportations\n13 minutes ago\nEvan Vucci/AP\nSuggested Interests\nABC News Network\nPrivacy Policy\nYour US State Privacy Rights\nChildren's Online Privacy Policy\nInterest-Based Ads\nAbout Nielsen Measurement\nTerms of Use\nDo Not Sell or Share My Personal Information\nContact Us\n© 2025 ABC News"
  },
  {
    "url": "https://www.theatlantic.com",
    "text": "Victor J. Blue for The Washington Post / Getty\nColumbia University’s Anti-Semitism Problem\n\nIf the bullying of Jewish students had happened to any other group, the institution would be appalled.\n\nFRANKLIN FOER\nWhy Aren’t Women Allowed to Play Baseball?\nKAITLYN TIFFANY\nThe Lesson Trump Is Learning the Hard Way\nROBERT KAGAN\nHow Baby-Led Weaning Almost Ruined My Life\nOLGA KHAZAN\nHow Republicans Learned to Love High Prices\nSCOTT LINCICOME\nIllustration by Akshita Chandra / The Atlantic. Source: Getty.\nBuy, Borrow, Die\nROGÉ KARMA\nHannah Jacobs\nAn E-Bike Transformed My Family’s Life\nELIZABETH ENDICOTT\nBettmann / Getty\nInvading Canada Is Not Advisable\n\nWe’ve tried before. It didn’t work out.\n\nELIOT A. COHEN\nIllustration by The Atlantic\nIt’s Hard to Change Your Mind. A New Book Asks If You Should Even Try.\n\nThe novelist Julian Barnes doubts that we can ever really overcome our fixed beliefs. He should keep an open mind.\n\nKIERAN SETIYA\nIllustration by Akshita Chandra / The Atlantic. Source: CDC / Smith Collection / Gado / Getty.\nThe World’s Deadliest Infectious Disease Is About to Get Worse\n\nBy retracting foreign aid, President Trump could make tuberculosis untreatable again.\n\nJOHN GREEN\nIllustration by Akshita Chandra / The Atlantic. Source: Getty.\nOne Word of Truth Shall Outweigh the Whole World\n\nThe Russian author’s Nobel Prize lecture contains an urgent message for contemporary audiences.\n\nALEKSANDR SOLZHENITSYN\nIllustration by The Atlantic. Source: Pier Marco Tacca / Getty.\nTrump’s Attempts to Muzzle the Press Look Familiar\n\nMuch of what the U.S. president has done to curb independent media echoes the Hungarian autocrat Viktor Orbán’s playbook.\n\nANDRÁS PETHŐ\nIllustration by The Atlantic.*\nLeBron James and the Limits of Nepotism\n\nIt’s embarrassing for everyone involved.\n\nROSS ANDERSEN\nArchives of the YIVO Institute for Jewish Research, New York\nThe Last Great Yiddish Novel\n\nChaim Grade’s Sons and Daughters rescues a destroyed world.\n\nJUDITH SHULEVITZ\nFocus Features\nA Cautionary Tale About Working With Your Spouse\n\nThe new film Black Bag transposes a timeless spy-thriller premise into the story of a marriage.\n\nDAVID SIMS\nThe Global Populist Right Has a MAGA Problem\n\nIn Europe, Trump looks too extreme even for many right-wing insurgents.\n\nHELEN LEWIS\nIllustration by The Atlantic. Source: Getty.\nThe Rise of the Brown v. Board of Education Skeptics\nJUSTIN DRIVER\nThe NIH’s Grant Terminations Are ‘Utter and Complete Chaos’\nKATHERINE J. WU\nThe Case for Palestinian Pragmatism\nAHMED FOUAD ALKHATIB\nRECOMMENDED FOR YOU\nWalk on Air Against Your Better Judgment\n\nWhat Seamus Heaney gave me (From 2024)\n\nCAITLIN FLANAGAN\nSteve Pyke / Getty\nTurtleboy Will Not Be Stopped\n\nA profane blogger believes an innocent woman is being framed for murder. He’ll do anything to prove he’s right—and terrorize anyone who says he’s wrong.\n\nCHRIS HEATH\nLila Barth for The Atlantic\nARCHIVE\nFighting the Flu\n\n“The story of the development of the vaccines for Influenza A is not … a pitched battle, but a long campaign — the slow, bit-by-bit accumulation of data in which one doctor builds upon the laboratory experience of another.” (From 1941)\n\nMONA GARDNER\nLibrary of Congress / Interim Archives / Getty\nThe Excitement of Friendship\n\n“I really live only when I am with my friends.”\n\nRANDOLPH S. BOURNE\nMichael Parkin Gallery / Joan Warburton / Bridgeman Images\nMAGAZINE\nPast Issues\n\nEnjoy unlimited access to all of The Atlantic’s journalism, in the print edition and online.\n\nSubscribe\nPODCASTS\nSee All\nIllustration by Mel Haasch*\nradio atlantic\n•\nEPISODE TRAILER\nWater Is Not Political\n\nGaza is struggling to keep clean water flowing.\n\nCLAUDINE EBEID\nIllustration by The Atlantic. Source: Getty.\ngood on paper\n•\nEPISODE 41\nThe Scientific Controversy That’s Tearing Families Apart\n\nThe neuroscientist, the nanny, and the shaky science of shaken baby syndrome\n\nJERUSALEM DEMSAS\nLIMITED SERIES\nWe Live Here Now\n\nWe found out that our new neighbors were supporting January 6 insurrectionists. We knocked on their door. A podcast series about what happened next.\n\nLAUREN OBER AND HANNA ROSIN\nLIMITED SERIES\nAutocracy in America\n\nThere are authoritarian tactics already at work in the United States. To root them out, you have to know where to look.\n\nANNE APPLEBAUM AND PETER POMERANTSEV\nLATEST\nSee All\nThe Ultimate Trump Story\nQUINTA JURECIC\n2:35 PM ET\nThe View From Greenland\nALAN TAYLOR\n2:28 PM ET\nSex Without Women\nCAITLIN FLANAGAN\n1:55 PM ET\n‘What About Six Years of Friendship and Fighting Together?’\nGEORGE PACKER\n12:49 PM ET\nThe Lesson Trump Is Learning the Hard Way\nROBERT KAGAN\n9:35 AM ET\nAn E-Bike Transformed My Family’s Life\nELIZABETH ENDICOTT\n9:00 AM ET\nIt’s Hard to Change Your Mind. A New Book Asks If You Should Even Try.\nKIERAN SETIYA\n8:30 AM ET\nWhy Aren’t Women Allowed to Play Baseball?\nKAITLYN TIFFANY\n8:00 AM ET\nHow Baby-Led Weaning Almost Ruined My Life\nOLGA KHAZAN\n7:50 AM ET\nHow Republicans Learned to Love High Prices\nSCOTT LINCICOME\n7:30 AM ET\nBuy, Borrow, Die\nROGÉ KARMA\n7:00 AM ET\nColumbia University’s Anti-Semitism Problem\nFRANKLIN FOER\n6:00 AM ET\nCoalescence\nCAMERON ALLAN\nMARCH 16, 2025\nLeBron James and the Limits of Nepotism\nROSS ANDERSEN\nMARCH 16, 2025\nThe Last Great Yiddish Novel\nJUDITH SHULEVITZ\nMARCH 16, 2025\nFive Movies That Changed Viewers’ Minds\nSTEPHANIE BAI\nMARCH 16, 2025\nThe Global Populist Right Has a MAGA Problem\nHELEN LEWIS\nMARCH 16, 2025\nOne Word of Truth Shall Outweigh the Whole World\nALEKSANDR SOLZHENITSYN\nMARCH 16, 2025\nThe World’s Deadliest Infectious Disease Is About to Get Worse\nJOHN GREEN\nMARCH 15, 2025\nTrump’s Unpredictability With Allies and Adversaries\nTHE EDITORS\nMARCH 15, 2025\nPOPULAR\nSee All\nColumbia University’s Anti-Semitism Problem\nFRANKLIN FOER\nThe Ultimate Trump Story\nQUINTA JURECIC\nBuy, Borrow, Die\nROGÉ KARMA\nSex Without Women\nCAITLIN FLANAGAN\nThe Lesson Trump Is Learning the Hard Way\nROBERT KAGAN\nNEWSLETTERS\nSee All\n\nThe Atlantic Daily\n\nGet our editors’ guide to what matters in the world, delivered to your inbox every weekday and Sunday mornings.\n\nEmail Address\nSign Up\n\nYour newsletter subscriptions are subject to The Atlantic's Privacy Policy and Terms and Conditions.\n\nCROSSWORD\n\nPlay the crossword that gets more challenging every weekday.\n\nPlay Crossword\nAUDIO\n\nListen to award-winning podcasts and audio versions of our stories.\n\nListen"
  },
  {
    "url": "https://www.vox.com",
    "text": "Our World, Explained:\nTrump's second term\nElon Musk\nClimate\nAI\nClarity in this chaotic news cycle\n\nThere’s too much news and too little context. At Vox, we do things differently. We focus on helping you understand what matters. We don’t obsess over being the first to break news. We focus on being helpful to you. We report urgently on the most important stories shaping our world, but we spend time on issues the rest of the media neglects. But we can’t do it alone.\n\nWe rely on readers like you to fund our journalism. Will you support our work and become a Vox Member today?\n\nJoin today\nTHE LOGOFF\nTrump’s showdown with the courts over deportations, briefly explained\n\nTrump claimed a wartime power for fast deportations — and ended up in conflict with the courts.\n\nBy PATRICK REIS\nPOLITICS\nA judge told Trump to halt deportation flights. They went ahead anyway.\nFUTURE PERFECT\nThink twice before you smear beef tallow and salmon sperm on your face\nDONALD TRUMP\nWhat can be done if Trump is openly defying the courts?\nCULTURE\nThe not-so-patriotic thing so much true crime has in common\nPOLITICS\nTren de Aragua, the gang Trump is targeting, explained\nTop links\nSolve the crossword\nPlay Vox’s daily puzzle!\nPLAY\nNewsletters\nExplainers in your inbox\nSIGN UP\nOur Mission\nHelp everyone understand our world\nABOUT VOX\nRecommended For You\nThe Covid pandemic was catastrophic. But don’t overlook what went right.\nBy BRYAN WALSH\nThe man whose tweets helped kill DEI\nBy NOEL KING\nTrump’s attempt to take over Columbia University, briefly explained\nBy ANDREW PROKOP\n3 ways you can help the people hurt by Trump’s foreign aid cuts\nBy SIGAL SAMUEL\nThe Facebook tell-all Mark Zuckerberg doesn’t want you to read, briefly explained\nBy ADAM CLARK ESTES\nEven Better\nMORE\nThe Elon Musk company you should be worried about right now\nBy ADAM CLARK ESTES\nIntroverts should (sometimes) act like extroverts\nBy OLGA KHAZAN\nCan men get better at dating?\nBy HADY MAWAJDEH\nScreen time reports won’t help you put your phone down. Here’s what can.\nBy ADAM CLARK ESTES\nThe problem with dating? Your standards might be too high.\nBy ALLIE VOLPE\nFuture Perfect\nMORE\nThink twice before you smear beef tallow and salmon sperm on your face\nBy SAM DELGADO\nTrump’s attacks on higher ed could provide a chance to reimagine the university\nBy CELIA FORD\nThe devastating impact of Trump’s slashing foreign aid, in 3 charts\nBy JESS CRAIG\nThe Covid pandemic was catastrophic. But don’t overlook what went right.\nBy BRYAN WALSH\nThe AI revolution is here. Can we build a Good Robot?\nBy BRYAN WALSH\nMost Popular\nWhat can be done if Trump is openly defying the courts?\nTake a mental break with the newest Vox crossword\nThe Facebook tell-all Mark Zuckerberg doesn’t want you to read, briefly explained\nCanada is so furious at the US right now\nThe Air Quality Index and how to use it, explained\nThink twice before you smear beef tallow and salmon sperm on your face\nHas Trump already killed NATO?\nListen\nALL PODCASTS\nToday, Explained\n\nToday, Explained is Vox's daily news explainer podcast hosted by Sean Rameswaram and Noel King.\n\nUnexplainable\n\nWorlds we don't know, mysteries we haven't solved, questions we can't answer, and the scientists trying to figure it all out.\n\nThe Gray Area\n\nThe Gray Area is a philosophical take on culture, politics, and everything in between with host Sean Illing.\n\nExplain It to Me\n\nExplain It to Me is the hotline for all your unanswered questions. Host Jonquilyn Hill is your friendly guide to the answers you're looking for — and maybe even the ones you don’t expect.\n\nToday, Explained\n\nUnderstand the world with a daily explainer plus the most compelling stories of the day, compiled by news editor Sean Collins.\n\nEmail (required)\nSign Up\nWatch\nALL VIDEOS\nVIDEO\nWhen it’s okay to wait to pay off debt\n\n﻿The simple math behind paying off debt versus investing.\n\nBy COLEMAN LOWNDES\nVIDEO\nWhy the US has birthright citizenship\nVIDEO\nHow de-aging in movies got so good\nVIDEO\nIs it time to worry about bird flu?\nVIDEO\nAre your fingerprints really unique?\nExplainers\nMORE\nEXPLAIN IT TO ME\nAmerica’s (lack of) separation between church and state, explained\n\nAnd how religion became a force in US politics.\n\nBy IAN MILLHISER\nEXPLAIN IT TO ME\nIs wealth inequality leading to a class war?\nPOLITICS\nOne agency that explains what the government actually does for you\nFUTURE PERFECT\nIs AI really thinking and reasoning — or just pretending to?\nPOLITICS\nWhat we know about Trump’s wave of federal firings so far\nFUTURE PERFECT\nI work in global health. Trump ditching the World Health Organization might be the wake-up call it needs.\nPolitics\nMORE\nTHE LOGOFF\nTrump’s showdown with the courts over deportations, briefly explained\n\nTrump claimed a wartime power for fast deportations — and ended up in conflict with the courts.\n\nBy PATRICK REIS\nPOLITICS\nA judge told Trump to halt deportation flights. They went ahead anyway.\n\nTrump’s new attempt to test the courts’ limits, explained.\n\nBy ANDREW PROKOP\nLIVE\nPresident Trump’s first 100 days\n\nTrump appears intent on remaking the executive branch as he sees fit. The news is changing rapidly. Follow here for the latest updates, analysis, and explainers.\n\nBy VOX STAFF\nDONALD TRUMP\nWhat can be done if Trump is openly defying the courts?\nPOLITICS\nTren de Aragua, the gang Trump is targeting, explained\nWORLD POLITICS\nHas Trump already killed NATO?\nCulture\nMORE\nCULTURE\nHow “Not Like Us” became an anti-Drake anthem — and the subject of a messy lawsuit\n\nThe Drake vs. Kendrick Lamar feud, explained.\n\nBy KYNDALL CUNNINGHAM\nCULTURE\nThe not-so-patriotic thing so much true crime has in common\nFUTURE PERFECT\nThink twice before you smear beef tallow and salmon sperm on your face\nTECHNOLOGY\nThe Facebook tell-all Mark Zuckerberg doesn’t want you to read, briefly explained\nCULTURE\nIs the viral “let them” theory really that simple?\nCULTURE\nWhite Lotus has finally revealed its secret main character\nAdvice\nMORE\nADVICE\nIntroverts should (sometimes) act like extroverts\n\nTrust me: I tried it.\n\nBy OLGA KHAZAN\nEXPLAIN IT TO ME\nCan men get better at dating?\n\nA dating coach for men on the state of relationships.\n\nBy HADY MAWAJDEH\nEVEN BETTER\nThe problem with dating? Your standards might be too high.\n\nHow to make sure your expectations for a partner are realistic.\n\nBy ALLIE VOLPE\nFUTURE PERFECT\nTHE HIGHLIGHT\nHow do I resist Trump without ruining my life?\nEVEN BETTER\nTHE HIGHLIGHT\nWhat your boredom is trying to tell you\nEVEN BETTER\nHow to dread winter a little less\nMORE NEWS\nCULTURE31 MINUTES AGO\nHow “Not Like Us” became an anti-Drake anthem — and the subject of a messy lawsuit\n\nThe Drake vs. Kendrick Lamar feud, explained.\n\nBy KYNDALL CUNNINGHAM\nLIVETWO HOURS AGO\nPresident Trump’s first 100 days\n\nTrump appears intent on remaking the executive branch as he sees fit. The news is changing rapidly. Follow here for the latest updates, analysis, and explainers.\n\nBy VOX STAFF\nWORLD POLITICS12:00 PM GMT+1\nHas Trump already killed NATO?\n\n﻿Does anyone still believe the US would go to war to defend Europe?\n\nBy JOSHUA KEATING\nFUTURE PERFECT11:30 AM GMT+1\nTrump’s attacks on higher ed could provide a chance to reimagine the university\n\nAcademia runs on underpaid, overworked PhD students. It doesn’t have to.\n\nBy CELIA FORD\nEXPLAIN IT TO MEMAR 16\nAmerica’s (lack of) separation between church and state, explained\n\nAnd how religion became a force in US politics.\n\nBy IAN MILLHISER\nEXPLAIN IT TO MEMAR 16\nWere companies ever serious about DEI?\n\nWhy the pendulum swung on DEI — and how that could be a good thing.\n\nBy JONQUILYN HILL\nFUTURE PERFECTMAR 16\nThe devastating impact of Trump’s slashing foreign aid, in 3 charts\n\nFrom HIV to malnutrition, here’s what the loss of 83 percent of USAID programs looks like.\n\nBy JESS CRAIG\nFUTURE PERFECTMAR 15\nThe Covid pandemic was catastrophic. But don’t overlook what went right.\n\nFrom mRNA vaccines to remote work, the technologies that blunted the worst of the pandemic.\n\nBy BRYAN WALSH\nTODAY, EXPLAINED PODCASTMAR 15\nThe man whose tweets helped kill DEI\n\nWe talk to Richard Hanania, an influential thinker on the online right, about how he got DEI dismantled and why he’s fallen out of love with MAGA.\n\nBy NOEL KING and MILES BRYAN\nTHE RISE OF ARTIFICIAL INTELLIGENCE, EXPLAINEDMAR 15\nThe AI revolution is here. Can we build a Good Robot?\n\nThe battle over artificial intelligence is just beginning.\n\nBy BRYAN WALSH\nPOLITICSMAR 14\nTrump’s attempt to take over Columbia University, briefly explained\n\nThe administration demanded Columbia make sweeping policies and governance changes — or lose billions in federal funds.\n\nBy ANDREW PROKOP\nFUTURE PERFECTMAR 14\n3 ways you can help the people hurt by Trump’s foreign aid cuts\n\nThe president took away life-saving aid. You can give some of it back.\n\nBy SIGAL SAMUEL\nTECHNOLOGYMAR 14\nThe Facebook tell-all Mark Zuckerberg doesn’t want you to read, briefly explained\n\nThe Meta CEO’s commitment to free expression doesn’t apply to embarrassing memoirs.\n\nBy ADAM CLARK ESTES\nPOLITICSMAR 14\nCanada is so furious at the US right now\n\nVox’s correspondent in Canada reports on the reaction to Trump’s tariffs.\n\nBy SEAN COLLINS and ZACK BEAUCHAMP\nCLIMATEMAR 14\nA foundational climate regulation is under threat\n\nTrump’s EPA claims that climate change isn’t a danger to human beings\n\nBy UMAIR IRFAN\nPagination\nPAGE 1 OF 15\nNEXT"
  },
  {
    "url": "https://www.economist.com",
    "text": "Business\n\nWill Trump’s tariffs turbocharge foreign investment in America?\n\nCompanies from Asahi to TSMC are expanding production in the country—for now\n\nThe world in brief\n\nKaja Kallas, the European Union’s foreign policy chief, said that Russia’s ceasefire terms show it “doesn’t really want peace” in Ukraine...\n\nMr Trump said that he would hold Iran responsible if the Houthis retaliate against America’s air strikes on Yemen, and impose “dire” consequences...\n\nThe eu pledged €2.5bn ($2.7bn) to Syria to support the country’s reconstruction after the fall of Bashar al-Assad...\n\nMark Carney, Canada’s new prime minister, made a statement by making his first trip abroad to Paris instead of to Washington, dc...\n\nContinue reading\n→\n\nEurope\n\nUkraine’s army escapes from Kursk by the skin of its teeth\n\nUkraine will have less Russian land than it hoped to trade for peace\n\nFinance & economics\n\nCan anything get China’s shoppers to spend?\n\nAn economic recovery depends on it. Yet a new action plan may not do the job\n\nDo viruses trigger Alzheimer’s?\n\nA growing group of scientists think so, and are asking whether antivirals could treat the disease\n\nBinyamin Netanyahu is leading Israel into (another) crisis\n\nHis decision to sack the security chief will not end well\n\nThe pandemic hit pupils hardest in America’s Democrat-leaning states\n\nHow much were school-closure policies to blame?\n\nDessert cafés are a symbol of modern Britain\n\nA messy, blended country produces a messy, blended cuisine\n\nDiscover more\n\nThe Intelligence\n\nToday: Trump is threatening America’s public-health body\n\nArchive 1945\n\nRead our reporting from 80 years ago on the liberation of the Balkans\n\nTracking the presidency\n\nHow popular is Donald Trump?\n\nCanadian poll tracker\n\nAhead of elections later this year, the Liberals are surging\nLatest videos\n⇒\nWatch more videos\nThe consequences of Trumponomics\nTrump’s erratic policy is harming the reputation of American assets\n\nLike the stockmarket, the dollar is also suffering from falling confidence and rising confusion\n\nAmerica is facing a beef deficit\n\nDonald Trump’s tariff plans will make it worse, and burgers dearer\n\nTen indicators explain what’s going on with America’s economy\n\nA look at the impact of Trumponomics, as revealed by data\n\nWill America’s stockmarket convulsions spread?\n\nInvestors are hurrying to find alternatives—but all face difficulties of their own\n\nGames\n\nDateline history quiz\n\nGuess when these extracts were published in The Economist\n\nMini crossword\n\nA weekly puzzle based on the week’s news\n\nPint-sized news quiz\n\nHave you been following the headlines?\nWorld news\nTrump v the spies of Five Eyes\nUkraine’s embrace of drone warfare has paid off\nIf it comes to a stand-off, Europe has leverage over America\nAnother civil war looms in South Sudan\nBusiness, finance and economics\nWhy rents are rising too fast\nMore testosterone means higher pay—for some men\nElon Musk’s antics are not the only problem for Tesla\nThe race is on to build the world’s most complex machine\nThe second Trump presidency\nJared Isaacman, the high-school dropout who will lead NASA\nHow DOGE is driving America’s public-health guardians mad\nPanama’s giveaway game\nLexington: Donald Trump is setting new boundaries for political speech\nStories with data\nWhich countries are most vulnerable to Donald Trump’s aid cuts?\nThe best places to be a working woman in 2025 \nThe global democracy index: how did countries perform in 2024?\n\nBurgernomics\n\nOur Big Mac index shows how burger prices differ across borders\nOther highlights\nChristian entertainment has risen\nAre these the world’s most beautiful airports?\nChina’s super-smart Tesla-killers\nMeet Generation Alpha\ntechnology quarterly: march 1st 2025\nThe age of CRISPR\n\nIda Emilie Steinmark explores whether it can deliver on its promise\n\n→\nCan gene editing deliver on its promise?\n→\nCRISPR could yet save millions of lives. Here’s how\n→\nEpigenetic editors are a gentler form of gene editing\n→\nGene editing is already revolutionising research in the laboratory\n→\nEat your GE-greens\n→\nEditing pigs, mice and mosquitoes may save lives\n→\nDesigning babies\n→\nGene editing can still change the world\n→\nAcknowledgments\n⇒\nRead full report\nStories most read by subscribers\nSix books you didn’t know were propaganda\nTen indicators explain what’s going on with America’s economy\nWhy rents are still rising too fast\nAre these the world’s most beautiful airports?\nThe new economics of immigration\nedition: march 15th 2025\nAmerica’s new foreign policy\nThe new economics of immigration\n\nNativists say that migrants raise house prices, cost money and undermine economic growth. Do they have a point?\n\nWill the shooting stop in Ukraine?\n\nProbably not. But by agreeing to a 30-day ceasefire, Ukraine has won back crucial American weapons and intelligence\n\nThe real lesson of China’s latest AI\n\nThe boom is reaching astonishing proportions\n\nJesus Christ: screen saviour\n\nLet there be lights, camera, action!\n\n⇒\nRead full edition\nThe US elections of 2024\nAn unfinished election may shape a swing state’s future\nMatt Gaetz withdraws from consideration as America’s attorney-general\nHow Donald Trump could win the future\nClimate change\nThe sea is swallowing an African island\nThe rise of the Net-Zero Dad\nThe Arctic: climate change’s great economic opportunity\n1843 magazine\nInside the world of vigilante scam-baiters\nThe great pretender: how Ahmed al-Sharaa won Syria\nTyler Cowen, the man who wants to know everything\nPodcasts\nTrump is threatening America’s public-health body\nDamascus, divided\nHow do podcasts affect American politics?\nBy Invitation\nDonald Trump’s unwillingness to heed allies’ advice is foreign-policy folly, writes Gary Bass\nAn ex-head of the FTC and his co-author lament the politicisation of antitrust enforcement\nAlexis Dudden on the firebombing of Tokyo and on post-war struggles to keep it remembered\nGraphic detail\nTen indicators explain what’s going on with America’s economy\nWhich countries are most vulnerable to Donald Trump’s aid cuts?\nHow do Ukrainian soldier fatalities compare with Russia’s?\nThe Economist explains\nHow will mines dropped by drones change warfare?\nWhat do Greenlanders think of being bought?\nWhat would Donald Trump gain from seizing the Panama Canal?\nThe Economist reads\nBooks for young children that you can read over and over and over\nBooks that imagine that history took a different course\nWhat to read about America’s culture wars"
  },
  {
    "url": "https://www.wsj.com",
    "text": "Top Stories\nEXCLUSIVE\nGoogle Back in Talks to Buy Cybersecurity Startup Wiz With a $30 Billion Deal\n\nDiscussions had fizzled last summer as Wiz and some of its investors had concerns about the time it would take for a deal to clear regulatory hurdles.\n\n4 min read\n\nTrump Lays Groundwork for Investigating People Pardoned by Biden\n\nPresident Trump questioned the validity of pardons granted by his predecessor, signaling the administration could move to investigate those given legal immunity.\n\n3,141\n\n48 min ago\n\n3 min read\n\nA Secret Mortgage Blacklist Is Leaving Homeowners With Unsellable Condos\n\nFewer homes can get Fannie Mae-backed mortgages, a response to the Surfside condo collapse and the insurance crunch.\n\n668\n\n6 min read\n\nTrump-Putin Talks to Follow Weeks of Diplomatic Turbulence Over War\n\nThe U.S. president said land and power plants will be among the areas he will discuss Tuesday with the Russian leader.\n\n4 min read\n\nIran to Face ‘Consequences’ if Houthis Continue Attacks, Trump Threatens\n\nTrump’s threat raises questions about whether he would risk a wider Mideast war over disruptions to global commerce.\n\n6 min read\n\nProgressives Keep Up Heat on Chuck Schumer\n\nStops on book tour for the Senate’s top Democrat were postponed due to security concerns.\n\n3 min read\n\nTrump Wants to Build Homes on Federal Land. Here’s What That Would Look Like.\n\nDeveloping federal land could produce a surge in new housing, but it faces some of the same obstacles that builders encounter.\n\n207\n\n5 min read\n\nTrump Administration Defends Deportation Flights After Court Order\n\nThe Justice Department says it wasn’t obligated to comply with an oral directive to turn around planes carrying alleged Venezuelan gang members.\n\n3 min read\n\nThe Latin American Leader Helping Trump Deport Venezuelans\n\nThe Collateral Damage of Trump’s Firing Spree\n\nFrom veterans hospitals to national parks, rapid cuts to federal workers are eating into services.\n\n1,009\n\nLong read\n\nBrown University Tells International Students, Staff to Avoid Travel Abroad\n\n​The advice followed the deportation of a professor with a work visa who was denied re-entry to the U.S. after visiting family members in Lebanon.\n\n2 min read\n\nThey Thought They Came to the U.S. Legally. Now They’re at Risk for Deportation.\n\nImmigrants who took advantage of a Biden-era program to enter the U.S. are now being targeted by the Trump administration.\n\n1,149\n\n6 min read\n\nPodcasts\n\nView All\n\nYOUR HEALTH | SUMATHI REDDY\n\nMeasles Cases Are Climbing; Who Needs Another Shot?\n\n5 min read\n\nWhy This Could Be the Year Warren Buffett Finally Gives Away $1 Million\n\n23\n\n5 min read\n\nESSAY\n\nWe Are Turning Too Many People Into Medical Patients\n\n133\n\n7 min read\n\nColumnists\nInvestors Were Confident Heading Into 2025. That Was a Bad Sign.\nBy \nSpencer Jakab\nThe Snapchat Move That Leaves Teen Girls Heartbroken\nBy \nJulie Jargon\nThe Russo Brothers Upended Hollywood Once. Now They Aim to Do It Again.\nBy \nChristopher Mims\nWSJ PROMOTION\nLimited-Time Sale: 80% Off\n\nAward-winning coverage on breaking news and today's top stories that impact you. From Finance and Business to Tech and World News, get unlimited access to WSJ.\n\nSUBSCRIBE NOW\nOpinion\nChuck Schumer’s Finest Hour\nBy \n\nThe Editorial Board\n\nTrump, Deportations and the Law\nBy \n\nThe Editorial Board\n\nMy Stolen NCAA Championship\nBy \n\nMinna Svärd\n\nA Step Back From Automatic Mail Voting\nBy \n\nThe Editorial Board\n\nThe Reason Tesla Doesn’t Pay Income Taxes\nBy \n\nThe Editorial Board\n\nCleaning Up After Lina Khan\nBy \n\nThe Editorial Board\n\nJobs & The Economy\nJob Seekers Hit Wall of Salary Deflation\n\nThe salary bump that people who switch jobs used to command has vanished.\n\n358\n\n5 min read\n\nAudi to Cut 7,500 Jobs by 2029\n\nConsumers and Businesses Send Distress Signal as Economic Fear Sets In\n\nBusiness & Finance\n\nView All\n\nEXCLUSIVE\nBank of America Tightens Oversight of Junior Bankers’ Hours\n\nThe financial institution also eliminated around 150 junior investment banking roles last week.\n\n3 min read\n\nEXCLUSIVE\nThe Prime Suspect Behind California’s Eaton Fire: A ‘Zombie’ Power Line\n\nAn investigation by utility Southern California Edison is increasingly focused on whether a decommissioned line was re-energized, sparking the deadly blaze.\n\n179\n\n6 min read\n\nWorld\n\nView All\n\nHarvard Is Going Tuition-Free for Families Making Up to $200,000\n\nThe Ivy League school is expanding financial aid for middle-income families.\n\n3 min read\n\nBiden Climate Funds Create Legal Storm for Trump Administration\n\nA bid to freeze money has roiled the Justice Department and put clean-energy projects in limbo.\n\n118\n\n4 min read\n\nTelegram Founder, Facing Charges, Is Allowed to Leave France\n\nTech entrepreneur Pavel Durov traveled to Dubai after French officials temporarily relaxed his bail conditions.\n\n3 min read\n\nSports\n\nView All\n\nAmerica’s Pastime Is Being Completely Transformed—by Japan\n\nWhen the Los Angeles Dodgers and Chicago Cubs square off in Tokyo this week for MLB’s season-opening series, it will underscore Japan’s pre-eminent role in baseball today.\n\n29\n\n5 min read\n\nReal Estate & Storms\n\nView All\n\nThe Challenge of Selling High-End Homes in America’s Disaster Zones\n\nMarketing real-estate in areas ravaged by hurricanes, fires, floods and landslides can be tricky—especially when it comes to striking a balance between promotion and reality.\n\n110\n\n9 min read\n\nIn America’s Insurance Crisis, Hail Hits Harder Than Hurricanes and Fires\n\nHome insurers are dropping policyholders and raising premiums as the costs of repairing storm damage rises.\n\n369\n\n5 min read\n\nEssay\nThe Last Decision by the World’s Leading Thinker on Decisions\n\nShortly before Daniel Kahneman died last March, he emailed friends a message: He was choosing to end his own life in Switzerland. Some are still struggling with his choice.\n\n822\n\nLong read\n\nHow Small Talk Opens Up Deeper Connections\n\nArts & Entertainment\n\nView All\n\nMY MONDAY MORNING\n\nDavid Foster Will Climb 65 Flights of Stairs to Avoid the Elevator\n\nThe producer, 75, wrote the songs for the upcoming Broadway show “Boop! The Musical.”\n\n6 min read\n\nThe Met May Have Millions in Stolen Art. It’s Not Waiting to Be Asked to Return It.\n\nThe museum is taking the lead on re-evaluating its art and artifacts to determine where these works came from in the first place.\n\n127\n\n5 min read\n\nGot a tip for us? \nHere's how to submit\nBuy Side from WSJ\n\nView All\n\nBuy Side is independent of The Wall Street Journal newsroom.\n\nThe Best Fashion Sneakers to Upgrade Your Wardrobe, According to Stylists\n\nStep up your style with these luxe lace-ups, sleek slip-ons and more.\n\n6 min read\n\nThese Are the Best Stand Mixers for Every Type of Cooking and Baking\n\nWe stirred and kneaded to find the standout mixers that deliver pro-level results.\n\nLong read\n\nWhich Videogame Console is Right for You?\n\nConsider this your shortcut to choosing the right model.\n\nLong read\n\nVideos\n\nView All\n\nWhite House: Deportation Flights Took Off before Judge’s Written Order\nForever 21 Was a Fast Fashion Pioneer. It Wasn’t Fast Enough.\n‘Intense’ Spring Storm Hits Central and Southern U.S.\nJournal Reports\n\nView All\n\nThe Best Leaders Aren’t Decisive. They’re Ambivalent.\n\nThe conventional wisdom is that you want a boss who is confident and clear about the path forward. But that has it backward.\n\n6 min read\n\nThe Best-Managed Companies Do It All—but Do Some Things Especially Well\n\nWhy Most Companies Shouldn’t Have an AI Strategy\n\nCEOs Face More Accountability When a Board Member Has Military Experience\n\n3 min read\n\nWhy Brands Should Avoid Using the Catchy Nicknames Consumers Give Them\n\n3 min read\n\nMost Popular News\nA Secret Mortgage Blacklist Is Leaving Homeowners Stuck With Unsellable Condos\nThe Collateral Damage of Trump’s Firing Spree\nJob Seekers Hit Wall of Salary Deflation\nTrump Wants to Build Homes on Federal Land. Here’s What That Would Look Like.\nTrump Lays Groundwork for Investigating People Pardoned by Biden\nMost Popular\nOPINION\nThe Reason Tesla Doesn’t Pay Income Taxes\nChuck Schumer’s Finest Hour\nThe Office That Won the Cold War, RIP\nMake America Smart Again\nMy Stolen NCAA Championship\nRECOMMENDED VIDEOS"
  },
  {
    "url": "https://www.nasa.gov",
    "text": "LIVE 10:45 p.m. EDT (0245 UTC)\nNASA's SpaceX Crew-9\n\nNASA will provide live coverage of the agency’s SpaceX Crew-9 return to Earth from the International Space Station, beginning with Dragon spacecraft hatch closure preparations\n\nReturn to Earth\n\nLive coverage of NASA's SpaceX Crew-9 return to Earth from the International Space Station begins with the SpaceX Dragon spacecraft hatch closure preparations at 10:45 p.m. EDT Monday, March 17.\n\nLive Coverage Schedule\nMISSION SCIENCE\nScientific Milestones\nMISSION UPDATES\nNASA’s SpaceX Crew-9\nMISSION UPDATES\nNASA’s SpaceX Crew-10\nFeatured News\nRecently Published\nBLOG\n4 MIN READ\n\nNASA Science Data Received, Blue Ghost Captures Eclipse From Moon\n\nARTICLE\n3 MIN READ\n\nNASA’s EZIE Launches on Mission to Study Earth’s Electrojets\n\nARTICLE\n5 MIN READ\n\nNASA’s Webb Images Young, Giant Exoplanets, Detects Carbon Dioxide\n\nARTICLE\n5 MIN READ\n\nNASA Super Pressure Balloons Return to New Zealand for Test Flights\n\n2 MIN READ\n\nNASA Expertise Helps Record all the Buzz\n\nARTICLE\n2 MIN READ\n\nNASA Artemis II Core Stage Goes Horizontal Ahead of Final Integration\n\nBLOG\n2 MIN READ\n\nHubble Sees a Spiral and a Star\n\nARTICLE\n5 MIN READ\n\nWhat’s Up: March 2025 Skywatching Tips from NASA\n\nARTICLE\nPeculiar Asteroid Donaldjohanson\n\nAlthough NASA’s Lucy spacecraft’s upcoming encounter with the asteroid Donaldjohanson is primarily a mission rehearsal for later asteroid encounters, a new paper suggests that this small, main belt asteroid may have some surprises.\n\nLucy Mission\nabout Peculiar Asteroid Donaldjohanson\nThe Solar System\nDiscover More\nAsteroids, Comets & Meteors\nLucy Mission Resources\nMoons\nPlanets\nEarth Information Center\n\nFor more than 50 years, NASA satellites have provided data on Earth's land, water, air, temperature, and climate. NASA's Earth Information Center allows visitors to see how our planet is changing in six key areas: sea level rise and coastal impacts, health and air quality, wildfires, greenhouse gases, sustainable energy, and agriculture.\n\nStart Exploring\nabout Earth Information Center\nTODAY\nImage Of The Day\n\nNASA’s SpaceX Crew-10 Launch\n\nA SpaceX Falcon 9 rocket carrying the company’s Dragon spacecraft is launched on NASA’s SpaceX Crew-10 mission to the International Space Station with NASA astronauts Anne McClain and Nichole Ayers, JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi, and Roscosmos cosmonaut Kirill Peskov onboard, Friday, March 14, 2025, from NASA’s Kennedy Space Center in Florida. NASA’s SpaceX Crew-10 mission is the tenth crew rotation mission of the SpaceX Dragon spacecraft and Falcon 9 rocket to the International Space Station as part of the agency’s Commercial Crew Program. McClain, Ayers, Onishi, and Peskov launched at 7:03 p.m. EDT from Launch Complex 39A at NASA Kennedy to begin a six-month mission aboard the orbital outpost.\n\nBrowse Image Archive\nView image\nMore NASA Images\nEarth Gallery\n15 IMAGES\nEarth’s Moon Gallery\n33 IMAGES\nSun Gallery\n32 IMAGES\nExplore the Universe from your Inbox\n\nStay up-to-date on the latest news from NASA–from Earth to the Moon, the Solar System and beyond.\n\nWe will never share your email address.\n\nPrivacy Policy\n\nSign Up\nMore Topics from NASA\nMissions\nHumans In Space\nClimate Change\nOur Solar System\nUniverse\nLatest NASA Science News\nAeronautics\nTechnology"
  },
  {
    "url": "https://www.history.com"
  },
  {
    "url": "https://www.biography.com",
    "text": "7 Little-Known Facts About Saint Patrick\n\nLearn the saint’s real heritage and other information about the man we celebrate every year on March 17.\n\nBy Daisy Hernandez And Thad Morgan\nAdvertisement - Continue Reading Below\nHow J. Edgar Hoover Accidentally Created the FBI’s 10 Most Wanted List\n\nThe infamous catalog of fugitives turns 75 this week.\n\nBy Tyler Piccotti\nHow Lewis Hamilton Taught Brad Pitt To Drive F1\nBy Tyler Piccotti\n51 Inspiring Famous Women In History\nBy Janaya Wecker And Catherine Caruso\nThese Are The Best Books On Sale In March 2025\nBy Josiah Soto\nDolly Parton And Carl Dean’s Private Marriage\nBy Sara Kettler\nNOTABLE NOW\nSaint Patrick\nWill Smith\nStephen Curry\nDonatella Versace\nAdvertisement - Continue Reading Below\nNOTORIOUS FIGURES AND ACTS\nWhat Drove the Manson Family to Commit Its Infamous 1969 Murders\n\nCharles Manson’s motives are reexamined in the new Netflix documentary ‘Chaos: The Manson Murders.’\n\nBy Michael Natale\nAdvertisement - Continue Reading Below\nWhy The Menendez Brothers Killed Their Parents\nWhere Are Ruby Franke’s Kids And Estranged Husband\nWhere Is Ruby Franke Now?\nMeet Jodi Hildebrandt, Ruby Franke’s Accomplice\nThe Murder Of Gabby Petito\nWhere Is Convicted Scammer Amanda Riley Today?\nThe Story Of Gypsy-Rose Blanchard And Her Mother\n15 Notorious Serial Killers In History\nCULTURE\n17 Stars Ensnared By The Hollywood Blacklist\nBy Catherine Caruso And Eudie Pak\nHere’s The Deal With Alex Cooper And Alix Earle\nBy Mehera Bonner\nHow Did Mikey Madison Get Famous?\nBy Michael Natale\nHow To Buy Sabrina Carpenter Tickets\nBy Josiah Soto\nAdvertisement - Continue Reading Below\nPEOPLE YOU SHOULD KNOW\nSusie Wiles Joins the Historic Group of Groundbreaking Women in American Politics\n\nThe 67-year-old is the first female White House chief of staff.\n\nBy Catherine Caruso\n11 Famous Black Inventors Who Changed Your Life\nBy Adrienne Donica And Brad Witter\n11 Notable Artists From The Harlem Renaissance\nBy Tyler Piccotti\n10 Famous Explorers Who Connected The World\nBy Caroline Redmond\n22 Famous Scientists You Should Know\nBy Tyler Piccotti\nCONNECTIONS\nHow Alec And Hilaria Baldwin Met And Fell In Love\nPresident Donald Trump’s Family Tree\n12 Notable Members Of The Kennedy Family\nElvis Presley’s Family Tree\nMUSICIANS\nSee Dolly Parton’s Iconic Oscars Performance\n2025 Grammy Nominations In The Major Categories\nThe History Of “All I Want For Christmas Is You”\nAll The 2024 CMA Award Winners And Nominees\nBIO BUYS\nRecreate Mikey Madison’s Oscars-Night Glam\nThe White Lotus Actresses Wore This Mascara On Set\nHow To Buy BLACKPINK Tour Tickets In 2025\nHow To Put Together An Oscar Watch Party\nTHE LATEST\nGary Ridgway\nTiger Woods\nMelinda French Gates\nSurprising Facts About Jennifer Aniston\nCaitlin Clark\nWho Are Britney Spears’ Kids? Meet Sean And Jayden\nArchimedes: The Mathematician Who Discovered Pi\nHappy Face Killer\nSelena Quintanilla\nRandy Travis\nHow Likely Is The Menendez Brothers’ Release?\nGene Hackman"
  },
  {
    "url": "https://www.healthline.com"
  },
  {
    "url": "https://www.webmd.com",
    "text": "TODAY'S TOP STORIES\nEffective Ways To Reduce Bloating\n\nThe uncomfortable bloating after meals can be caused by food, eating habits, or conditions like IBS. Learn how to reduce bloating and improve your comfort.\n\nThe Key Health Benefits of Pistachios\nHow Alcohol Affects Your Skin\nWhat Causes Cracked Heels?\nLIVING HEALTHY\nMental Health\nDiet & Weight Management\nHealthy Aging\nSex & Relationships\nFitness & Exercise\nView All\nCONDITIONS\nWomen’s Health\nDepression\nHeart Failure\nBreast Cancer\nRheumatoid Arthritis\nLung Disease (COPD)\nCancer\nDiabetes\nView All\nHEALTH NEWS\nIs Marriage Making You (Or Your Husband) Gain Weight?\n\nNew research reveals married men have triple the risk of obesity than unmarried men. Here's what to know.\n\nThis Common Vaginal Issue Is Really an STD\nThe Other Vaccine-Preventable Diseases Worrying Doctors Now\n3 New Things About Vaccines That Matter to You\nView All\n\nExpert Insights From\n\nJohn Whyte, MD\n\nWebMD Chief Medical Officer\n\nWhat's Behind The Shortage Of Primary Care Doctors?\nDNA and \"ZNA\" Are Driving Cancers in Black Americans\nTransforming Patient-Centric Cancer Care\nSurgeon General's Advisory on Teens and Social Media\nUnderstanding Sudden Unexpected Death in Epilepsy\nSPECIAL SECTION\nSpotlight on Age-Related Macular Degeneration\nAge-Related Macular Degeneration And Daily Life\n\nFind out how to keep enjoying your hobbies, household tasks, and daily routines while living with age-related macular degeneration (AMD).\n\nSpotlight on Asthma\nBreaking Barriers In Asthma Care\n\nAsthma is more likely to affect certain racial and ethnic groups. Learn more about the reasons for these disparities and some potential solutions.\n\nContent on Weight Loss and Obesity\nA New Way To Look At Obesity\n\nUncover a fresh take on obesity management, from modest weight loss benefits to the latest treatments and tips for reaching your goals.\n\nTRENDING TOPICS\nAllergies\nBird Flu\nChronic Pain\nCough\nDigestive Problems\nEmotional Wellness\nFitness And Exercise\nMeasles\nSkin Problems And Treatments\nVitamins And Supplements\nFree WebMD Newsletters\nDoctor-approved health and wellness information delivered to your inbox.\nDaily Updates\nWomen's Health\nGood Health\nSubscribe\nBy clicking Subscribe, I agree to the WebMD Terms & Conditions and Privacy Policy and understand that I may opt out of WebMD subscriptions at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nSee All WebMD Newsletters\nPATIENT AND EXPERT CONTRIBUTORS\nMyasthenia Gravis\nAshley Brooks\nDiagnosed since 2017\nLove, Intimacy, & Myasthenia Gravis\nMyasthenia Gravis\nMisha Grayson Coleman\nDiagnosed since 2021\nMG and the Idea of Having Children\nSkin Care\nMary Alice Mina, MD\nDouble board-certified dermatologist\nMenopause and Your Skin: What Every Woman Needs to Know\nDigestive Health\nElizabeth Ward, RD, MS\nRegistered dietitian nutritionist\nThe Health Benefits of Resistant Starch\nTOOLS, TRACKERS & CALCULATORS\nBMI Calculator\nOvulation Calculator\nCold And Flu Map\nPill Identifier\nDrugs Interaction Checker\nCat Health Tool\nDog Health Tool\nDue Date Calculator\nFitness Calorie Counter\nKids BMI\nVisual Pregnancy Timeline\nHEALTH A - Z\nADD/ADHD - Childhood\nADHD\nAllergies\nAlzheimer's\nAnkylosing Spondylitis\nAnxiety Disorders\nArthritis\nAsthma\nBack Pain\nCancer\nChildren's Vaccines\nCholesterol\nCold, Flu, & Cough\nCOPD\nCoronavirus\nDepression\nDiabetes\nDigestive Disorders\nEye Health\nHealth & Balance\nHeart Health\nHeartburn/GERD\nHypertension\nLung Cancer\nMental Health\nMigraines\nMultiple Myeloma\nMultiple Sclerosis\nOral Care\nOrthopedics\nOsteoporosis\nOvarian Cancer\nProstate Cancer\nPsoriasis\nRheumatoid Arthritis\nSchizophrenia\nSexual Conditions\nSkin Problems\nSleep Disorders\nView All\nOur Content Is Different Because We Set the Bar Higher\n\nAs a leader in digital health publishing for more than 25 years, WebMD strives to maintain the most comprehensive and reliable source of health and medical information on the internet.\n\nWe recognize the responsibility that comes along with being the most well-known and trusted health information platform — and we take that responsibility seriously by:\n\n01\nCharging our content creators to practice journalistic principles of excellence and provide objective, accurate, and balanced reporting\n02\nMaintaining editorial independence and transparency into how we protect the integrity of our content\n03\nRegularly reviewing and updating our content by working with our network of more than 100 doctors and health experts\nLearn more about our Editorial Process"
  },
  {
    "url": "https://www.mayoclinic.org",
    "text": "Transforming your care\nLearn how we drive innovation\nRequest appointment\nSkip this Section\nFind diseases & conditions by first letter\nA\nB\nC\nD\nE\nF\nG\nH\nI\nJ\nK\nL\nM\nN\nO\nP\nR\nS\nT\nU\nV\nW\nX\nY\nZ\n#\nSearch diseases & conditions\n. Type 3 or more letters to display suggested search options.\nSearch\nHealing starts here\n\nThe right answers the first time\n\nEffective treatment depends on getting the right diagnosis. Our experts diagnose and treat the toughest medical challenges.\n\nTop-ranked in the U.S.\n\nMayo Clinic has more No. 1 rankings than any other hospital in the nation according to U.S. News & World Report. Learn more about our top-ranked specialties.\n\nWhy choose Mayo Clinic\nWorld-class care for global patients\n\nWe make it easy for patients around the world to get care from Mayo Clinic.\n\nInternational services\nLocations\n\nLearn more about Mayo Clinic locations or choose a specific location.\n\nExplore all locations\nMayo Clinic in Arizona \nPhoenix & Scottsdale\nMayo Clinic in Florida \nJacksonville\nMayo Clinic in Minnesota \nRochester\nMayo Clinic Health System \nIowa, Minnesota, Wisconsin\nMayo Clinic Healthcare \nLondon, United Kingdom\nFeatured care areas\n\nWe solve the world's most serious and complex medical challenges.\n\nBone marrow transplant\nBrain aneurysm\nBrain tumor\nBreast cancer\nColon cancer\nCongenital heart disease\nGlioma\nHeart arrhythmia\nHeart valve disease\nLiving-donor transplant\nLung transplant\nSarcoma\nTesticular cancer\nNational Doctors’ Day is March 30!\n\nMake a gift to honor and celebrate the contributions of our world-class doctors.\n\nGive Now"
  },
  {
    "url": "https://www.psychologytoday.com",
    "text": "Psychology Today: Health, Help, Happiness + Find a Therapist\nNews\nAdult ADHD and Perfectionism\n20 hours\nLaws Against Conversion Therapy Are Under Attack\n1 day\nBCI and AI Allow the Mind to Control Robot Arm\n2 days\nSEE MORE NEWS\nToday’s Essential Reads\nMOTIVATION\nWhy Hustle Culture Is Failing You\n\nJordan Grumet M.D. on March 17, 2025 in The Regret-Free Life\n\nThe real key to success isn't \"hustle\"; it's persistence. If you want to ditch the grind, embrace the process, and build a life you actually love, here's how.\n\nCHILD DEVELOPMENT\nHow to Raise Kids Who Don't Give Up\n\nVanessa LoBue Ph.D. on March 17, 2025 in The Baby Scientist\n\nHow do we encourage kids to be persistent and persevere on challenging tasks? Research suggests that our own behaviors matter for how to keep kids from giving up.\n\nDIVORCE\n3 Reasons Why Both Spouses Feel Like the Bad Guy in a Divorce\n\nSusan Pease Gadoua L.C.S.W. on March 16, 2025 in Contemplating Divorce\n\nDivorce brings deep pain. The stories you tell yourself and the emotions you and your soon-to-be-ex feel are probably normal, but you may feel bad.\n\nARTIFICIAL INTELLIGENCE\nThe AI Oscillation Trap: Stuck Between AI and Autonomy\n\nJohn Nosta on March 15, 2025 in The Digital Self\n\nAs AI advances, we must balance reliance and resilience to ensure that stepping back remains a choice, not a precarious fall.\n\nThe Latest\nPARENTING\nHow to Nurture Sensitive Children\n\nJudith Orloff M.D. on March 17, 2025 in The Empath's Survival Guide\n\nDiscover five strategies to support and nurture highly sensitive children.\n\nCANNABIS\nCannabis and Mood Disorders: Use at Your Own Risk\n\nFrancis M. Mondimore M.D. on March 17, 2025 in Bipolar 101\n\nResearch on the use of cannabis by persons with major depressive disorder and bipolar disorder clearly demonstrates that those with mood disorders should avoid using it.\n\nARTIFICIAL INTELLIGENCE\nCan AI Predict Mental Health Decline?\n\nSamuel Paul Veissière Ph.D. on March 17, 2025 in Culture, Mind, and Brain\n\nAI analysis of mental health queries shows rising self-diagnosis, cognitive decline, polarization, and radicalization, signaling urgent societal risks.\n\nPERSONAL PERSPECTIVES\nWhat I Learned From a Guatemalan Shaman\n\nJudith Fein on March 17, 2025 in Life Is a Trip\n\nA Personal Perspective: An experienced that changed how I think about decision-making.\n\nWISDOM\nYou Are Already Wise\n\nDiana Hill, Ph.D. on March 17, 2025 in From Striving to Thriving\n\nHarness your inherent wisdom to embrace growth and navigate life's complexities with sound decision-making.\n\nDECISION-MAKING\nWhy We Do Things We Regret\n\nEvan Shopper on March 17, 2025 in A Deep Dive Into Narratives\n\nWhenever we regret a decision or action, a narrative has controlled us.\n\nMEMORY\nDoes the Self Exist Outside the Brain?\n\nHamid Zand Ph.D. on March 17, 2025 in The Behavioral Microbiome\n\nRecent findings suggest that memories are stored in the body, not just the brain. Does that mean our \"self\" is too?\n\nWORKPLACE DYNAMICS\nYou Are Not as Funny as You Think You Are\n\nMike Rucker Ph.D. on March 17, 2025 in The Science of Fun\n\nWorkplace humor is tricky. When done right, it strengthens teams; when done wrong, it creates stress and can create distance. Learn how you can strike the right balance.\n\nLEADERSHIP\nCrafting a Vision Statement That Inspires: A Leader’s Guide\n\nAshley C. Jordan Ph.D. on March 17, 2025 in Leading With Connection\n\nStruggling to craft a vision statement that truly inspires? Learn the key ingredients of a compelling vision statement and research-backed strategies to make your vision stick.\n\nSEX\nEndometriosis Awareness Month: Navigating Pain and Pleasure\n\nSari Cooper, CST, LCSW on March 17, 2025 in Sex Esteem\n\nEndometriosis impacts physical, mental, and sexual health. This Endometriosis Awareness Month, let's bring to light what is so often forgotten: the importance of pleasure.\n\nARTIFICIAL INTELLIGENCE\nPlacebo AI: Are Too Many of Us Using Automation as a Fast Fix?\n\nCornelia C. Walther Ph.D. on March 17, 2025 in Harnessing Hybrid Intelligence\n\nAs AI takes a more prominent space in our lives and workplaces, it's essential that we protect our cognitive real estate (and careers) from a technological takeover.\n\nWORKPLACE DYNAMICS\nFor Well-Behaved Women Who May Never Make History\n\nKaren Teller, M.B.A., and Elaine Lyerly on March 17, 2025 in Words at Work\n\nWomen don't have to remain silent and safe. We can use our good aggression to be empowered to take action and speak up.\n\nINSOMNIA\nTechnology Use Before Bedtime: It's Complex\n\nLisa A Medalie PsyD, RPSGT, DBSM on March 17, 2025 in Sleep and Insomnia Recommendations\n\nIs technology disrupting your sleep? With blue light, bedtime procrastination, and the rise of AI engagement, it’s more complex than you may think.\n\nAUTISM\nThe Silent Social Struggles of Autistic People\n\nJessica L Penot LPC-S on March 17, 2025 in The Forgotten Women\n\nPersonal Perspective: Autistic adults' lives are haunted by derision and dislike. Finding community with other autistic adults is often the only solution.\n\nPERFECTIONISM\nTrapped by Perfection\n\nLily Arora MD, DFAPA on March 17, 2025 in Transformational Insights\n\nShatter the invisible chains of your past and live a life where your inner confidence matches your outward success.\n\n\nFEATURE\nThe Enthusiasm Gap\n\nOvercome the Blahs\n\nRELATIONSHIPS\nThe Myth of \"the One That Got Away\"\n\nJohn Kim LMFT on March 17, 2025 in The Angry Therapist\n\nNo one “got away.” They just weren’t meant to stay.\n\nLEADERSHIP\nThe Hardest Leadership Skill You’ll Ever Learn\n\nCamille Preston Ph.D. on March 17, 2025 in Mental Health in the Workplace\n\nPsychological safety fuels strong teams. Leaders have to get real with themselves. It starts within—building trust, vulnerability, and self-awareness.\n\nLAW AND CRIME\nMusic and Violence: Songs That Inspired Infamy\n\nKatherine Ramsland Ph.D. on March 17, 2025 in Shadow Boxing\n\nAlthough song writers don't intend to inspire murder, some killers nevertheless have found a sense of identity and a license to act in certain song lyrics.\n\nSELF-ESTEEM\nGenuine Self-Esteem Is Not Positive in Tone\n\nMichael Karson Ph.D., J.D. on March 17, 2025 in Feeling Our Way\n\nThe opposite of a negative self-concept is not positive; it’s neutral. Stop all that cheerleading.\n\nDOMESTIC VIOLENCE\nThe Risk of Gender-Neutrality in Assessing Domestic Violence\n\nElise Buie Esq. on March 17, 2025 in The Heart of the Matter\n\nThe Gabby Petito case exposes the dangers of gender-neutral domestic violence assessments, calling for systemic change.\n\nLEADERSHIP\nHow Bohm's Theory Can Transform Leadership\n\nJanet M Shlaes Ph.D., MBA, MA, ACC/ICF on March 17, 2025 in The Healthy Workplace\n\nPhysicist David Bohm's contributions regarding wholeness and the implicate order greatly inform our current leadership needs.\n\nWORKPLACE DYNAMICS\nHow Culture Shapes Business and Organizational Success\n\nSoren Kaplan Ph.D. on March 17, 2025 in The Power of Experience\n\nWorkplace culture can make or break a business. Here’s how to shape the culture of your organization to get the results you want.\n\nPERSONAL PERSPECTIVES\nThe Challenge of Staying in Long-Term Treatment\n\nBethany Yeiser BS on March 17, 2025 in Recovery Road\n\nThe vast majority of persons with schizophrenia do not adhere to medication, which leads to medication resistance and disability.\n\nETHICS AND MORALITY\nDaredevil, Born Again: Making the Case for Virtue Ethics\n\nMark D. White Ph.D. on March 17, 2025 in Maybe It's Just Me, But...\n\nIn episode three of \"Daredevil: Born Again,\" Matt Murdock uses the language of virtue ethics to defend a client accused of murder. Does he have a good case?\n\nAWE\nSlow Simmer vs. Quick Boil Awe\n\nKirk J. Schneider Ph.D. on March 17, 2025 in Awakening to Awe\n\nConsider the fruits of cultivating awe over a lifetime.\n\nSELF-TALK\nWhat Jack Draper's Latest Win Teaches Us About Self-Talk\n\nRaj Persaud MD FRCPsych on March 17, 2025 in Slightly Blighty\n\nTennis star Jack Draper used self-talk to win Indian Wells. Can it help you?\n\nINTERGENERATIONAL TRAUMA\nIntergenerational Transmission of Trauma and Resilience\n\nHospital, Health, and Addiction Workers Group on March 17, 2025 in Psychological Trauma, Coping, and Resilience\n\nDiscover individual and collective sources of resilience to deal with trauma and adversity.\n\nDIVORCE\nShould Your Child’s Therapist Testify in Your Custody Case?\n\nLisa Zeiderman Esq., CFL on March 17, 2025 in Legal Matters\n\nThinking of calling your child’s therapist to testify in a custody case? It may not help your case—and could even backfire. Here’s what you need to consider first.\n\nANXIETY\nA State of Brace: Navigating Political and Social Anxiety\n\nAnnalisa Enrile Ph.D. on March 17, 2025 in Ordinary Magic\n\nConstantly bombarded with political uncertainty, what can we do except brace ourselves for the next worst thing that can happen? Why it's time to stop waiting and start acting.\n\n1\n2\nNext\nMost Popular\nThe Rosebud Phenomenon\nWhat We Know About the Experiences of Alienated Grandparents\nThe 5-Letter Word Every Parent Needs to Use\nWhy Do We Keep Doing Things That Don’t Serve Us?\nMore Marriages End When Wives Get Sick Than When Husbands Do\nThe Crystallisation of Discontent\nEditorial Process\n\n Reviewed by Psychology Today Staff\n\nWe hold our content and our contributors to the highest standards. All our content is written by domain experts and reviewed for accuracy and objectivity.\n\nSee our editorial process\nSee all of our contributors\nContributors\nJordan Grumet, M.D., completed his degrees at the University of Michigan and Northwestern University. He is the author of The Purpose Code.\nVanessa LoBue, Ph.D., is a professor of psychology at Rutgers University-Newark.\nSusan Pease Gadoua, L.C.S.W., is the author of Contemplating Divorce and the co-author of The New I Do.\nJohn Nosta is an innovation theorist and founder of NostaLab.\nSee All Contributors\nFind a Therapist\n\nGet the help you need from a therapist near you–a FREE service from Psychology Today.\n\nCities:\nAtlanta, GA\nAustin, TX\nBaltimore, MD\nBoston, MA\nBrooklyn, NY\nCharlotte, NC\nChicago, IL\nColumbus, OH\nDallas, TX\nDenver, CO\nDetroit, MI\nHouston, TX\nIndianapolis, IN\nJacksonville, FL\nLas Vegas, NV\nLos Angeles, CA\nLouisville, KY\nMemphis, TN\nMiami, FL\nMilwaukee, WI\nMinneapolis, MN\nNashville, TN\nNew York, NY\nOakland, CA\nOmaha, NE\nPhiladelphia, PA\nPhoenix, AZ\nPittsburgh, PA\nPortland, OR\nRaleigh, NC\nSacramento, CA\nSaint Louis, MO\nSan Antonio, TX\nSan Diego, CA\nSan Francisco, CA\nSan Jose, CA\nSeattle, WA\nTucson, AZ\nWashington, DC\nAre you a Therapist? Get Listed Today\nCurrent Issue\nLook Inside\nSubscribe"
  },
  {
    "url": "https://www.who.int",
    "text": "Skip to main content\nAbout us\nRead more\nCredits\nLatest news\t\nAll →\n17 March 2025 Statement\n\nThird meeting of the International Health Regulations (2005) Emergency Committee regarding the upsurge of mpox 2024\n\n13 March 2025 News release\n\nUN Commission approves WHO recommendations to place psychoactive substances under international control\n\n8 March 2025 News release\n\nMany pregnancy-related complications going undetected and untreated – WHO\n\n6 March 2025 News release\n\nWHO announces new collaborating centre on AI for health governance\n\nLatest on emergencies\t\nAll →\nEnd of Marburg virus disease outbreak\nRead the Disease Outbreak News\nHealth situation in Gaza\nRead about WHO's support\nMpox\nRead the latest\nCOVID-19\nRead the latest update\nInvest in WHO\nLearn about investment in WHO\nEliminating diseases\nWatch the podcast\nAir pollution\nLearn about WHO's work\nPublications\nFind a publication\nMeasles\nRead the fact sheet\nSpeeches\nRead WHO Director-General's speeches\nCampaigns\t\nAll →\nWorld Tuberculosis Day\n24 March\nWorld Immunization Week\n24–30 April 2025\nWorld Health Day\n7 April\nEvents\t\nAll →\n\t\n\nWHO @ Global Hepatitis Summit 2025\n\n 18 – 21 March 2025\n\t\n\n80th INN Consultation\n\n 18 – 21 March 2025\n\t\n\nWebinar: WHO support for GCF country driven programming for the health sector: AFRO/EMRO (MENA) Regions\n\n 18 March 2025 09:00 – 10:30 UTC Time\n\t\n\nINN Session with INN stakeholders\n\n 18 March 2025 09:00 – 10:30 UTC Time\n\t\n\nOne Health: Defining its concept, necessity, and implementation\n\n 18 March 2025 14:00 – 16:00 CET\nRegions\nAfrica\nAmericas\nEastern Mediterranean\nEurope\nSouth-East Asia\nWestern Pacific\nPolicies\nCybersecurity\nEthics\nInformation disclosure\nPermissions and licensing\nPreventing sexual exploitation\nTerms of use\nAbout us\nCareers\nFrequently asked questions\nLibrary\nProcurement\nPublications\nContact us\nNewsletters\nReport misconduct\nPrivacy policy\n© 2025 WHO"
  },
  {
    "url": "https://www.worldbank.org",
    "text": "Global Digital Summit 2025\n\nJoin us March 18-19 as we explore the transformative work and solutions shaping the future of digital development.\n\nWatch the Event\nMORE TOP STORIES\n\nMission 300: Powering Development in Africa\n\nTHE DEVELOPMENT PODCAST\n\nFinancing Firm Growth in Developing Economies\n\nREPORT\n\nWhat Works for Women at Work\n\nBLOG\nTOGETHER WE CAN CREATE A  WORLD FREE OF POVERTY ON A LIVABLE PLANET\nAbout Us\n\nDATA FOR DEVELOPMENT\n\nEssential data to guide decisions, monitor progress, and evaluate impact.\n\nSee More Data\n\nExplore by focus area\n\nPeople\n\n \n\nProsperity\n\n \n\nPlanet\n\n \n\nInfrastructure\n\n \n\nDigital\n\nPROSPERITY\n\n55 percent\n\nof women participated in the labor market in 2023 compared to almost 75 percent of men.\n\nSource: International Labour Organization (2025), ILOSTAT\n\nINFRASTRUCTURE\n\n1.19 million\n\npeople die each year globally in road traffic accidents.\n\nSource: WHO (2023), The Global status report on road safety\n\nPEOPLE\n\n4.5 billion\n\npeople, over half the world's population, lack access to essential health services.\n\nSource: WHO, World Bank (2023), Tracking Universal Health Coverage: 2023 Global Monitoring Report\n\nPROSPERITY\n\n30 percent\n\nof formal small and medium enterprises globally are owned and run by women.\n\nSource: Women Entrepreneurs Finance Initiative (We-Fi)\n\nSTAY CURRENT WITH OUR LATEST DATA & INSIGHTS \n\nNews, stories, and updates on international development straight to your inbox from the World Bank Group.\n\n* Your email\nYour first name\nSign Up\n\nI agree with the terms of the Privacy Notice and consent to my personal data being processed, to the extent necessary, to subscribe to the selected updates.\n\nRESEARCH & PUBLICATIONS\n\nWorld Bank Group Annual Report 2024\n\nResponding to intertwined challenges and becoming a faster, simpler, and more efficient World Bank Group.\n\nRead Full Report\n\nGlobal Economic Prospects, January 2025\n\nThe global economy is stabilizing, but developing economies still face a tough slog ahead.\n\nRead Full Report\n\nMore Research & Publications\n\nTRANSFORMING KNOWLEDGE\nTRANSFORMING LIVES\n\nCapacity development and training for next-generation leaders\n\nExplore the Knowledge Academy\n\nSearch More Courses\n\nEMPOWERING PEOPLE & COUNTRIES TO MAKE PROGRESS\n\nSee all Projects\n\nExplore by region\n\nAfrica\n\n \n\nEast Asia & Pacific\n\n \n\nEurope & Central Asia\n\n \n\nLatin America & Caribbean\n\n \n\nMiddle East & North Africa\n\n \n\nSouth Asia\n\nINFRASTRUCTURE\n\nHow Energy Efforts Are Transforming West Africa\n\nPLANET\n\nRole of Digital Platforms in West Africa's Agricultural Success\n\nPEOPLE\n\nTürkiye: Shaping Women's Entrepreneurship and Innovation\n\nMEASURING OUR IMPACT AND PROGRESS\n\nTracking our projects and results is a cornerstone of our work to become more transparent, accountable, and deliver impact that changes lives.\n\nSee the Scorecard\n\nPROTECTION FOR THE POOREST\n\n221.8 million\n\npeople directly benefited from social safety net operations\n\nNO LEARNING POVERTY\n\n123.2 million\n\npeople supported with enhanced resilience to climate risks\n\nCONNECTED COMMUNITIES\n\n142.4 million\n\npeople benefited from improved access to transportation\n\nEXPLORE DEVELOPMENT STORIES FROM AROUND THE WORLD\n\nTHE DEVELOPMENT PODCAST\n\nMission 300: Powering Development in Africa\n\nVIDEO\n\nThe Transformative Power of IDA\n\nTHE DEVELOPMENT PODCAST\n\nImproving the Lives of Women in Artisanal Small-Scale Mining\n\nLATEST FROM THE WORLD BANK GROUP\n\nIMMERSIVE STORY\n\nTransforming Agriculture, One Supply Chain at a Time\n\nMarch 10, 2025\n\nFEATURE STORY\n\nPowering Tanzania’s Small-Scale Mining Sector\n\nMarch 6, 2025\n\nBLOG\n\nA Looming Jobs Crisis: How Cities Can Help\n\nMarch 10, 2025"
  },
  {
    "url": "https://www.un.org/en/"
  },
  {
    "url": "https://www.oecd.org",
    "text": "OECD\nTop stories\nView all press releases\nOECD ECONOMIC OUTLOOK, INTERIM REPORT MARCH 2025\nSteering through uncertainty\n\nWhile the global economy remained resilient in 2024, recent activity indicators point to a softening of global growth prospects. Policy uncertainty has been high and significant risks remain, while further fragmentation of the global economy is a key concern.\n\nLearn more\nReport\n17 March 2025\n\nPress release\n\nCosta Rica: Boosting growth and living standards\n\nPress release\n\nHealthcare systems need to better respond to patients’ needs\n\nPress release\n\nHealthcare systems need to better respond to patients’ needs\nAbout the OECD\n\nThe OECD (Organisation for Economic Co-operation and Development) is a forum and knowledge hub for data, analysis and best practices in public policy. We work with over 100 countries across the world to build stronger, fairer and cleaner societies - helping to shape better policies for better lives.\n\nLearn more about the OECD\nData insights\nExplore all data insights\nA Flourish chart\nInflation continues to linger in many countries\n\nInflationary pressures persist in many economies, with headline inflation recently turning up again in an increasing share of economies. Services price inflation has stayed elevated, with a median rate of 3.6% across OECD economies.\n\nOver 2025-26 inflation is projected to be higher than previously expected, although still moderating as economic growth softens. Headline inflation is projected to fall from 3.8% in 2025 to 3.2% in 2026 in the G20 economies. Underlying inflation is now projected to remain above central bank targets in many countries in 2026.\n\nElevated geopolitical tensions remain an important near-term adverse risk, particularly if the evolving conflicts in the Middle East were to intensify and pose risks to the security of oil supplies from the region. An unexpected sharp oil price rise would raise global inflation substantially and hit confidence and growth, especially in oil importing countries.\n\nLearn more\nPublications\nSee all publications\nReport\nAdapting the Paris Metropolitan Area to a Water-Scarce Future\n17 March 2025\nPolicy brief\nWhat to expect from the EU Carbon Border Adjustment Mechanism?\n17 March 2025\nPolicy brief\nEnabling trust in food labels for improved environmental outcomes\n14 March 2025\nReport\nNational Urban Policy Review of Morocco\n13 March 2025\nReport\nImpact Evaluation of Wage Subsidies and Training for the Unemployed in Slovenia\n13 March 2025\nPolicy paper\nReal wages continue to recover\n13 March 2025\nFeatured topics\nArtificial intelligence\nArtificial intelligence (AI) is a transformative technology capable of tasks that typically require human-like intelligence, such as understanding language, recognising patterns, and making decisions. AI holds the potential to address complex challenges from enhancing education and improving health care, to driving scientific innovation and climate action. But AI systems also pose risks to privacy, safety, security, and human autonomy. Effective governance is essential to ensure AI development and deployment are safe, secure and trustworthy, with policies and regulation that foster innovation and competition.\nLearn more\nClimate mitigation and net-zero transition\nAnalysis and insights for driving a rapid transition to net-zero while building resilience to physical climate impacts.\nLearn more\nDevelopment co-operation\nThe OECD designs international standards and guidelines for development co-operation, based on best practices, and monitors their implementation by its members. It works closely with member and partner countries, and other stakeholders (such as the United Nations and other multilateral entities) to help them implement their development commitments. It also invites developing country governments to take an active part in policy dialogue.\nLearn more\nGender equality\nDespite progress in recent years, more work needs to be done across all OECD countries to secure gender equality, with women and girls still facing inappropriate disadvantages and barriers in most spheres of social and economic life. Gender equality must remain a priority, as a matter of basic human rights and long-term economic wellbeing and prosperity. It drives economic growth, strengthens democracy, enhances social cohesion and increases the well-being of all members of society.\nLearn more\nGlobal value and supply chains\nAbout 70% of international trade involves global value chains (GVCs), as services, raw materials, parts, and components cross borders – often numerous times. A strong trend has emerged towards the international dispersion of value chain activities such as design, production, marketing, distribution, etc. This emergence of GVCs and increased interest in their sustainability and resilience requires analysing supply chains as a whole and developing policies around them.\nLearn more\nTax transparency and international co-operation\nIn today’s globalised world, it is crucial that tax administrations work together to ensure the right amount of tax is paid to the right jurisdiction. The OECD is at the forefront of international efforts to use enhanced transparency and exchange of information to put an end to bank secrecy and fight tax evasion and avoidance.\nLearn more\nLatest insights\nSee all latest insights\nBlog\nWill Paris and other cities run dry by 2050?\n17 March 2025\nBlog\nHow to decarbonise mobility systems? A conversation with OECD experts\n14 March 2025\nBlog\nEmpowering Young People in the Digital Financial Age: The Role of Financial Literacy\n7 March 2025\nExternal blog\nRisk thresholds for frontier AI: Insights from the AI Action Summit\noecd.ai\n5 March 2025\nStatistical release\nOECD headline inflation at 4.7% in January 2025 for the third month in a row\n5 March 2025\nBlog\nUnlocking the potential of women in science and research\n4 March 2025\nEvents\nSee all events\nWebinar\nAdapting to a water-scarce future: The case of the Paris metropolitan area\n17 March 2025\nPublication launch\nLaunch of the Global Debt Report 2025\n20 March 2025\nForum\n2025 OECD Global Anti-Corruption & Integrity Forum\noecd-events.org\n26-27 March 2025\nMinisterial\nMinisterial Meeting on Regional Development Policy\n19-20 May 2025\nConference\n2025 OECD Conference of Mining Regions and Cities\n16-18 June 2025\nNewsletters\n\nGet the latest from the OECD on a range of topics straight to your inbox.\n\nExplore OECD newsletters\nJob opportunities\n\nThe range of professionals who work at the OECD is vast. Explore our latest job vacancies.\n\nVisit our careers page\nSubscribe to our \"What's New?\" newsletter\n\nFollow all the latest from across the OECD\n\nSubscribe\nExplore the latest edition"
  },
  {
    "url": "https://www.statista.com",
    "text": "Statistics\nReports\nInsights\nResearch AI\nNEW\nDaily Data\nServices\nSolutions\nPrices & Access\nEmpowering people with data\nInsights and facts across 170 industries and 150+ countries\nStatista Search\nPopular topics\nSocial media usage\nE-commerce worldwide\nArtificial intelligence (AI)\nNetflix\nGlobal inflation\nTikTok\nElectric vehicles\nSustainability\nGaming\nFast fashion\nTRUSTED BY MORE THAN 23,000 COMPANIES\nTRENDING STATISTICS\nGet facts and insights on topics that matter\nMar 11, 2025 | Operating Systems\nMarket share of mobile operating systems worldwide 2009-2025, by quarter\n\nAndroid maintained its position as the leading mobile operating system worldwide in the first quarter of 2025 with a market share of about 71.88 percent. Android's closest rival, Apple's iOS, had a market share of approximately 27.65 percent during the same period. \n\n\n\nThe leading mobile operating systems The rise of the smartphone\n Read more\nMar 10, 2025 | Stocks\nNYSE and Nasdaq monthly market cap of listed companies comparison 2018-2025\n\nAs of Janaury 2025, the New York Stock Exchange (NYSE) and the Nasdaq - the two largest stock exchange operators in the United States - held a combined market capitalization for domestic listed companies of over 62 trillion U.S. dollars. Both markets were almost evenly sized at this point in time - at approximately 32 and 30 trillion U.S. dollars, respectively. However, the Nasdaq has grown much quicker than the NYSE since January 2018, when their respective domestic market caps were 23 and 11 trillion U.S. dollars. Much of this can be attributed to the success of information technology stocks during the global coronavirus (COVID-19) pandemic, as the Nasdaq is the traditional venue for companies operating in the tech sector.\n\n Read more\nMar 10, 2025 | eSports\nFortnite average viewer count on Twitch 2025\n\nFortnite is an online battle royale video game developed by Epic Games and released in 2017. Fortnite events on the video streaming service Twitch were watched by an average of 70,000 viewers in February 2025. Engagement with the game spiked after the re-release of the original map in November 2023 as part of the OG season, as well as the launch of Lego Fortnite in December 2023.\n\n Read more\nMar 12, 2025 | National Security\nNumber of active military personnel in NATO in 2025, by member state\n\nIn 2025, the United States had the largest number of active military personnel out of all North Atlantic Treaty Organization (NATO) countries, with almost 1.3 million troops. The country with the second-largest number of military personnel was Türkiye, at around 355,200 active personnel. Additionally, the U.S. has by far the most armored vehicles in NATO, as well as the largest Navy and Air Force. \n\nNATO in brief\n\nNATO, which was formed in 1949, is the most powerful military alliance in the world. At its formation, NATO had 12 member countries, which by 2024 had increased to 32. NATO was originally formed to deter Soviet expansion into Europe, with member countries expected to come to each other’s defense in case of an attack. Member countries are also obliged to commit to spending two percent of their respective GDPs on defense, although many states have recently fallen far short of this target. \n\nNATO in the contemporary world\n\nSome questioned the purposed of NATO after the fall of the Berlin Wall in 1989 and the collapse of the Soviet Union a few years later. In 2019, French President Emmanuel Macron even called the organization 'brain-dead' amid dissatisfaction with the leadership of the U.S. President at the time, Donald Trump. NATO has, however, seen a revival after Russia's President Vladimir Putin decided to invade Ukraine in February 2022. Following the invasion, Sweden and Finland both abandoned decades of military neutrality and applied to join the alliance, with Finland joining in 2023, and Sweden in 2024.\n\n Read more\nMar 11, 2025 | Diseases\nDistribution of measles cases in the U.S. in 2024 and 2025, by vaccination status\n\nIn 2024, there were a total of 285 cases of measles in the United States. Around 89 percent of these cases were among those who were unvaccinated or whose vaccination status was unknown. From January 1 to March 6, 2025, there were 222 cases of measles, with those who were unvaccinated or with an unknown vaccination status accounting for 94 percent of these cases. Measles is a highly contagious disease that can be especially dangerous for young children. Vaccines against measles resulted in a significant decrease in cases in the United States over the last few decades; however, increasing vaccine hesitancy and skepticism has been blamed for recent outbreaks. \n\n Read more\nMar 11, 2025 | Income & Expenditure\nReal GDP growth rate Japan Q1 2019-Q4 2024\n\nAccording to the second preliminary announcement in March 2025, the real gross domestic product (GDP) of Japan in the fourth quarter of 2024 increased by 0.6 percent (seasonally adjusted) and 2.2 percent (annualized) compared to the previous quarter.\n\nGDP refers to the total market value of all goods and services that are produced within a country. Real GDP is adjusted for price changes and is therefore regarded as a key indicator for the economic well-being of a country.\n\n Read more\nMar 11, 2025 | Emissions\nMost polluted cities based on PM2.5 concentration in India 2024\n\nByrnihat was the most polluted city in India in 2024, with an average PM2.5 concentration of nearly 130 micrograms per cubic meter of air (μg/m³). This high level of pollution made the small industrial town on the Assam Meghalaya border the most polluted cities worldwide in 2024.\n\n\n\nPoor air quality across India Impacts of air pollution in India\n Read more\nMar 11, 2025 | Banks\nLeading banks in the UK 2024, by number of customers\n\nThe United Kingdom's banking landscape in 2024 revealed a competitive field dominated by established institutions, with Barclays leading the pack with 48 million customers worldwide. HSBC followed closely with 41 million customers, showcasing the enduring strength of traditional banks despite the rise of digital challengers. Interestingly, customer numbers don't necessarily correlate with satisfaction, as online banks like Starling Bank, First Direct, and Monzo Bank topped the charts for customer contentment.\n\nMarket dominance and financial performance Digital transformation and customer retention\n Read more\nFeb 13, 2025 | Elections\nVotes casted in the presidential elections in Ecuador 2025\n\nIn the first round of Ecuador's presidential election, incumbent President Noboa emerged as the candidate with the most votes. The candidate received 44.3 percent of the votes and will face Luisa González in a second round.\n\n Read more\nMar 10, 2025 | Electricity\nHousehold electricity prices in Africa 2024, by country\n\nCabo Verde recorded the highest electricity price for households in Africa. As of June 2024, one kilowatt-hour costs around 0.35 U.S. dollars in the country. Kenya and Sierra Leone followed, with households paying 0.26 and 0.25 U.S. dollars per kilowatt-hour, respectively. Mail, Burkina Faso, and Gabon also recorded relatively higher prices for electricity on the continent. On the other hand, Egypt, Zambia, Angola, and Libya registered the lowest prices for electric energy in Africa.\n\n\n\nCountries usually retain high prices for household and business electricity Electricity access and reliability vary across the continent\n Read more\nPOPULAR TOPICS\nStarting point of your research\nAmazon\nApple\nFacebook\nGoogle\nNetflix\nNike\nStarbucks\nTesla\nWalmart\nAgriculture\nAutomotive\nPharmaceuticals\nTourism\nWellness\nAdvertising\nE-Commerce\nVideo Games\nVirtual Reality\nEmployment\nGDP\nHealth\nPopulation\nPoverty\nTerrorism\nForecasts\nEuropean Union\nGermany\nIndia\nUnited Kingdom\nNEWS & REPORTS\nExpert research in condensed form\nNEW\nMarket Insights - Global Indicators - new data\n\nNew data on economic activity index across 5 economic sectors.\n\n• data for 152 countries and 41 regions\n\n• timeline covering 2019-2029\n\n More Information\nNEW\nStatista report: Men's beauty in the U.S.\n\nThe men's beauty market continues to grow, as attitudes and habits change. This report takes a look at this phenomenon, answering key questions including:\n\nWhat is the current size of the beauty market?\nHow have attitudes changed?\nWhat are the main men's beauty trends?\n More Information\nNEW\nStatista report: global electrification outlook\n\nThe transition from fossil fuels to electricity use is a crucial step of decarbonization. This report answers key questions about the topic, including:\n\nHow much electricity is used globally?\nWill decarbonization targets be met?\nWhat is the current and required level of investment?\n\n \n\n More Information\nNEW\nStatista report: sleep in modern society\n\nWhat role does sleep play in a world that values being active and reachable at every hour of the day and night? This report answers key questions on this topic, including:\n\nHow is modern life impacting sleep?\nWhat are the most common disorders?\nWhat is the future of the sleep economy?\n More Information\nNEW\nConsumer Insights: new global survey data\n\nExplore exclusive, representative 2024 Q4 survey data in our Consumer Insights tool, and understand your audience.\n\nnew data from 90,000 online interviews\n21 countries\n15,000 brands\n More Information\nNEW\nStatista report: mental health in Latin America\n\nMental health disorders carry some of the highest disease burdens in Latin America. This report examines the topic, answering questions including:\n\nWhat is the status quo in Latin America?\nWhich countries carry the heaviest burden?\nWhat are the main risk and protective factors?\n More Information\nNEW\nStatista report: low-carbon hydrogen\n\nThe decade began with many hailing low-carbon hydrogen almost as a magic bullet, but where production and implementation actually been achieved? This report looks at this question and more, with chapters including:\n\nEnergy transition efforts\nStatus quo\nThreats to adoption\nMarket outlook\n More Information\nNEW\nStatista report: consumer trends 2025\n\nThe behavior and preferences of Generation Z and the evolution of generative AI are expected to converge as two of the most influential trends of 2025. This report looks at the trends set to shape 2025, with chapters including:\n\nAI-ssisted shopping\nThe loyalty seeker\nOmni-wellness\nInfluencer immune?\n More Information\nNEW\nReport: Central & Eastern Europe green transition\n\nCentral and Eastern Europe (CEE) is experiencing a significant transformation to reduce carbon emissions by 2050. This report examines the topic with chapters including:\n\nGreen policy measures\nEmissions\nEnergy transition\nManufacturing transition\nAgriculture transition\nSocioeconomic challenges\n More Information\nNEW\nStatista report: corporate renewable energy\n\nThis report looks at renewable energy procurement among companies worldwide, focusing on power purchase agreements (PPAs). It answers key questions including:\n\nWhat is the role of PPAs?\nWhich are the major markets and players?\nHow have prices developed?\n More Information\nNEWS ARCHIVE\nOur news archive\nAre you looking for older news entries? Unfortunately, we can’t show all current and important topics on our start page. Have a look at our news archive to search for archived news entries which are no longer current but still worth keeping.\n Go to news archive\nGo to news archive\nMARKET INSIGHTS\n\nDiscover data on your market\n\nGain access to valuable and comparable market data for over 190+ countries, territories, and regions with our Market Insights. Get deep insights into important figures, e.g., revenue metrics, key performance indicators, and much more.\n\n Discover our market insights\n\nAll Market Insights topics at a glance\n\nAdvertising & Media\nConsumer\neCommerce\nFinance\nGlobal Indicators\nHealth\nIndustrial\nMobility\nTechnology\nSTATISTA ACCOUNTS\nAccess all statistics starting from €2,388 yearly*\n\n* For commercial use only\n\nBASIC ACCOUNT\nFor single users\n€0\nAlways free\nRegister now\nFree Statistics\nSTARTER ACCOUNT\nFor single users\n€199\nper month, billed annually 1\nAll prices do not include sales tax. The account requires an annual contract and will renew after one year to the regular list price.\nBuy now\nFree + Premium Statistics\nPERSONAL ACCOUNT\nFor single users\n€549\nper month, billed annually 1\nAll prices do not include sales tax. The account requires an annual contract and will renew after one year to the regular list price.\nBuy now\nFree + Premium Statistics\nReports\nPROFESSIONAL ACCOUNT\nFor teams of up to 5 people\n€1,199\nper month, billed annually 1\nAll prices do not include sales tax. The account requires an annual contract and will renew after one year to the regular list price.\nBuy now\nFree + Premium Statistics\nReports\nMarket Insights\nCompare accounts\nDAILY DATA\nGlobal stories vividly visualized\nCONSUMER INSIGHTS\nUnderstand what drives consumers\n\nThe Consumer Insights helps marketers, planners and product managers to understand consumer behavior and their interaction with brands. Explore consumption and media usage on a global basis.\n\n2,500,000+\ninterviews\n56\ncountries\n500+\nindustries\n15,000+\nbrands\nExplore the tool\nOUR SERVICE\nSave time & money with Statista\nTrusted content\n\nWith an increasing number of Statista-cited media articles, Statista has established itself as a reliable partner for the largest media companies of the world.\n\nOur reliability\nIndustry expertise\n\nOver 500 researchers and specialists gather and double-check every statistic we publish. Experts provide country and industry-based forecasts.\n\nOur team\nFlatrate access\n\nWith our solutions you find data that matters within minutes – ready to go in your favorite format.\n\nOur accounts\nCONTACT\nGet in touch with us. We are happy to help.\nMeredith Alda\nSales Manager\nEmailsupport@statista.com\nTel+1 914 619-5895\n\nMon - Fri, 9am - 6pm (EST)\n\nYolanda Mega\nOperations Manager\nEmailasia.support@statista.com\nTel+65 6995 6959\n\nMon - Fri, 9am - 5pm (SGT)\n\nAyana Mizuno\nJunior Business Development Manager\nEmailasia.support@statista.com\n\nMon - Fri, 10:00am - 6:00pm (JST)\n\nLodovica Biagi\nDirector of Operations\nEmaileu.support@statista.com\nTel+44 (0)20 8189 7000\n\nMon - Fri, 9:30am - 5pm (GMT)\n\nCarolina Dulin\nGroup Director - LATAM\nEmaillatam@statista.com\nTel+1 212 419-5774\n\nMon - Fri, 9am - 6pm (EST)\n\n1 All prices do not include sales tax. The account requires an annual contract and will renew after one year to the regular list price."
  },
  {
    "url": "https://www.ourworldindata.org"
  },
  {
    "url": "https://www.nationalreview.com",
    "text": "FORGOTTEN FACT CHECKS\nDemocrats Have a Change of Heart on the ‘Jim Crow Filibuster’\nBRITTANY BERNSTEIN\n\nFormer Senator Kyrsten Sinema takes a well-deserved victory lap.\n\nPOLITICS & POLICY\nDemocrats Are More Unpopular Than Ever\nDAN MCLAUGHLIN\n\nDemocrats seem unlikely to fix what ails them. But in 2026 and 2028, they could still easily find — thanks to Trump — that they don’t have to.\n\nWORLD\nChoosing Sides\nJAY NORDLINGER\n\nOn Ukraine, Putin, and Americans.\n\nNR WIRE\nVIEW MORE\n21m\nDeported Brown University Professor Attended Hezbollah Leader’s Funeral, Trump Admin Says\n2h\nMiddle East Broadcasting Head Says Trump’s ‘Bewildering’ Funding Cutoff Will Empower Adversaries\n4h\nDemocrats Have a Change of Heart on the ‘Jim Crow Filibuster’\nNATIONAL SECURITY & DEFENSE\nBlow the Houthis Out of the Water\nCHARLES C. W. COOKE\n\nThere’s only one logical way to deal with pirates.\n\nGeraghty: Trump Takes the Gloves Off Against Yemen’s Houthi Islamists\nTrump Designates Houthis a Foreign Terrorist Organization, Reversing Biden Policy\nMEDIA\nMAGA’s Crisis of Confidence in America\nNOAH ROTHMAN\n\nIn a case of unilateral disarmament in the propaganda war, the Trump administration functionally mothballed the U.S. Agency for Global Media.\n\nPOLITICS & POLICY\nMiddle East Broadcasting Head Says Funding Cutoff Will Empower Adversaries\nRYAN MILLS\n\nTrump signed an executive order Friday directing the U.S. Agency for Global Media to end all of its non-statutory functions.\n\nPOLITICS & POLICY\nTrump Declares Biden’s Last-Minute Pardons ‘Void’ over Autopen Signature\nDAVID ZIMMERMANN\n\n‘It’s not my decision — that’ll be up to a court — but I would say that they’re null and void,’ Trump said.\n\nPOLITICS & POLICY\nWe Are on the Edge of a ‘Revenge Porn’ Epidemic Unless Congress Acts Now\nKAYLA BARTSCH\n\nThe first lady has platformed an important piece of legislation to keep the AI horror-scape at bay.\n\nTHE CORNER\nA Rose on St. Patrick’s Day\nBY MICHAEL BRENDAN DOUGHERTY 5:35 PM\nChoosing Sides\nBY JAY NORDLINGER 3:54 PM\nWhy Trump Picked Justice Barrett\nBY RAMESH PONNURU 2:44 PM\nThe Fed Deflects Blame\nBY RAMESH PONNURU 1:22 PM\nVIDEOS & PODCASTS\nSEE MORE\nNR VIDEO\nCharlie Kirk Runs Circles Around Gavin Newsom on His New Podcast\nNR VIDEO\nThere’s No Place in the GOP for Andrew Tate\nTHE EDITORS\nTariffying Canada\nRADIO FREE CALIFORNIA\nGavin Newsom’s Trans Transition\nTRUMP ADMINISTRATION\nPOLITICS & POLICY\nThis Time Around, Trump’s Team Is ‘Doing What He Says’\nAUDREY FAHLBERG\n\nAn intense White House vetting process has left Trump with a battle-hardened group that follows orders.\n\nTrump’s Executive Order Targeting Perkins Coie Must Be Condemned\nANDREW C. MCCARTHY\n\nThe president’s EO is nothing less than a bill of attainder, and a deep constitutional wrong.\n\nLee Zeldin’s EPA Rights an Environmental Wrong\nNOAH ROTHMAN\n\nClimate activists are fit to be tied.\n\nWORLD\nISIS Leader Killed by U.S. and Iraqi Forces After Having Been ‘Relentlessly Hunted Down,’ Trump Says\nDAVID ZIMMERMANN\n\nAbu Khadijah was the second-in-command of ISIS’s global operations and in charge of the terror group’s finances.\n\nWHITE HOUSE\nDOJ ‘Thugs’ Who Targeted Trump Will Face ‘Full Accountability,’ President Vows\nHALEY STRACK\n\n‘They weaponized the vast powers of our intelligence and law enforcement agencies to try and thwart the will of the American people,’ Trump said.\n\nPOLITICS & POLICY\nAnother Plot Twist in Trump vs. the Administrative State\nANDREW C. MCCARTHY\n\nThe latest chapter provides more hurdles for both Trump’s top-down and bottom-up efforts to bring the federal bureaucracy to heel.\n\nVIEW MORE\nUKRAINE\nWORLD\nTrump to Speak with Putin as Russia Stalls on 30-Day Cease-Fire\nDAVID ZIMMERMANN\n\nTrump said he and Putin will discuss concessions involving land and power plants, adding that they’ve already discussed ‘dividing up certain assets.’\n\nPutin Flips Trump’s Cease-Fire the Bird\nJIM GERAGHTY\n\nAfter weeks of the Trump administration pressuring Ukraine to sign on to a cease-fire deal, Russia’s Vladimir Putin has responded with a raspberry.\n\nIs Trump’s Patience with Russia Bottomless?\nNOAH ROTHMAN\n\nSo far, all the carrots in the world have failed to persuade Putin to give up his designs on Ukraine and the U.S.-led geopolitical order beyond its borders.\n\nVIEW MORE\nDEMOCRATS\nPOLITICS & POLICY\nSenate Passes GOP Spending Bill with Backing from Schumer, Democrats\nAUDREY FAHLBERG\n\nSchumer’s decision to cave has enraged House Minority Leader Hakeem Jeffries (D., N.Y.) and other members of House Democratic leadership.\n\nActivists Demand That Democrats Set Themselves on Fire\nNOAH ROTHMAN\n\n‘Resistance’ reruns are all the rage, but are they working?\n\nAnger Is Not an Argument\nDAN MCLAUGHLIN\n\nDemocrats need to realize that getting mad doesn’t turn you into the Incredible Hulk, it just makes you unpleasant.\n\nVIEW MORE\nTHE LATEST\nPOLITICS & POLICY\nDeported Brown University Professor Attended Hezbollah Leader’s Funeral, Trump Admin Says\nJAMES LYNCH\n22 minutes ago\n\nRasha Alawieh visited Beirut to attend the funeral of Hassan Nasrallah and claimed to have followed his teachings from a religious vantage point.\n\nPOLITICS & POLICY\nMiddle East Broadcasting Head Says Trump’s ‘Bewildering’ Funding Cutoff Will Empower Adversaries\nRYAN MILLS\nabout 2 hours ago\n\nTrump signed an executive order Friday directing the U.S. Agency for Global Media to end all of its non-statutory functions.\n\nWORLD\nChoosing Sides\nJAY NORDLINGER\nabout 2 hours ago\n\nOn Ukraine, Putin, and Americans.\n\nMEDIA\nMAGA’s Crisis of Confidence in America\nNOAH ROTHMAN\nabout 3 hours ago\n\nIn a case of unilateral disarmament in the propaganda war, the Trump administration functionally mothballed the U.S. Agency for Global Media.\n\nFORGOTTEN FACT CHECKS\nDemocrats Have a Change of Heart on the ‘Jim Crow Filibuster’\nBRITTANY BERNSTEIN\nabout 4 hours ago\n\nFormer Senator Kyrsten Sinema takes a well-deserved victory lap.\n\nNATIONAL SECURITY & DEFENSE\nBlow the Houthis Out of the Water\nCHARLES C. W. COOKE\nabout 4 hours ago\n\nThere’s only one logical way to deal with pirates.\n\nPOLITICS & POLICY\nDemocrats Are More Unpopular Than Ever\nDAN MCLAUGHLIN\nabout 6 hours ago\n\nDemocrats seem unlikely to fix what ails them. But in 2026 and 2028, they could still easily find — thanks to Trump — that they don’t have to.\n\nCULTURE\nA Better Voice of America, or No Voice of America at All?\nJIM GERAGHTY\nabout 7 hours ago\n\nIt seems rather mean to name Kari Lake to head the U.S. Agency for Global Media, and then order everything she runs to be dismantled three months later.\n\nPOLITICS & POLICY\nTrump Declares Biden’s Last-Minute Pardons ‘Void’ over Autopen Signature\nDAVID ZIMMERMANN\nabout 8 hours ago\n\n‘It’s not my decision — that’ll be up to a court — but I would say that they’re null and void,’ Trump said of his predecessor’s pardons.\n\nWORLD\nTrump to Speak with Putin as Russia Stalls on 30-Day Cease-Fire\nDAVID ZIMMERMANN\nabout 9 hours ago\n\nTrump said he and Putin will discuss concessions involving land and power plants, adding that they’ve already discussed ‘dividing up certain assets.’\n\nPOLITICS & POLICY\nWashington Democrats Are Turning the Right to Bear Arms into a Privilege, Second Amendment Advocates Say\nRYAN MILLS\nabout 10 hours ago\n\nA pending bill would require residents to take safety classes and obtain a permit before buying a gun.\n\nHEALTH CARE\nGuttmacher Opposes State Abortion Reporting Requirements\nMICHAEL J. NEW\nabout 11 hours ago\n\nThe Guttmacher Institute is formally on the record stating that it opposes state laws requiring the collection and dissemination of accurate abortion data.\n\nWORLD\nWhen the Families of Israeli Hostages Help Us Heal\nKATHRYN JEAN LOPEZ\nabout 12 hours ago\n\nMeeting Ofir and Merav.\n\nHISTORY\nReagan at Reykjavik\nFRANK LAVIN\nabout 12 hours ago\n\nAn insider’s account of how the president’s meeting with Gorbachev shaped the end of the Cold War.\n\nPOLITICS & POLICY\nWe Are on the Edge of a ‘Revenge Porn’ Epidemic Unless Congress Acts Now\nKAYLA BARTSCH\nabout 12 hours ago\n\nThe first lady has platformed an important piece of legislation to keep the AI horror-scape at bay.\n\nLOAD MORE\nLATEST ISSUE\nTHE LONG VIEW\nAll About Elon: Excerpt\nROB LONG\n\n‘You see, Susie? It’s all going to be fine. I’ll just fill in for a bit. It’s not like people are going to prefer me to President Trump! That would be absurd!’\n\nLatin America: A Brisk Political Tour\nJAY NORDLINGER\n\nOn democrats, dictators, and others.\n\nOutdoor Café After Work\nP. DAVID HORNIK\n\nAllness washed over me . . .\n\nVIEW MORE\nBECOME AN NR VIP.\nSpecial Offer: Join today for $1 / week.\nSUBSCRIBE NOW\nNEW ON CAPITAL MATTERS\nREGULATORY POLICY\nWill FTC Chair Andrew Ferguson Inadvertently Promote Censorship?\nFISCAL POLICY\nThe Other SALT Deduction That Needs to Go\nBANKING & FINANCE\nWe’ve Won a Major Victory in the Battle Against ‘De-Banking’\nGO TO CAPITAL MATTERS\nPHOTOS\n30\nMILITARY\nDefending America\n64\nRUSSIA-UKRAINE CONFLICT\nUkraine at War\n20\nCULTURE\nSt. Patrick’s Day\nMORE IN PHOTOS\nNEW PODCASTS\nTHE BOOKMONGER\nJames Burnham: An Intellectual Biography by David T. Byrne\nTHE EDITORS\nTariffying Canada\nNATIONAL REVIEW’S RADIO FREE CALIFORNIA PODCAST\nGavin Newsom’s Trans Transition\nMORE IN PODCASTS\nTHE WEEK IN REVIEW\n\nGet all the big NR stories you might have missed delivered to your inbox every Sunday.\n\nGO\nVIDEOS\nTrump Threatens to Defund These Colleges\nThe Tate Brothers Are Not Welcome in Florida\nWhy Was FEMA Funding Queer Performances?\nThe L.A. Mayor is Ridiculous!\nTHE MAGAZINE\nVOLUME LXXVII\n№\n4\nIN THIS ISSUE\nA Wild Ride\nWe have reached Peak Trump. Now what?\nREAD NOW"
  },
  {
    "url": "https://www.smithsonianmag.com"
  },
  {
    "url": "https://www.artsy.net",
    "text": "Skip to end of content\nSam Gilliam, Annie, 2021. David Kordansky Gallery\nYour guide to the art world\nArtsy makes it easy to discover artists and artworks you'll love\nSign up\nEmily Kame Kngwarreye, Bush Yam Awelye, 1994.\nLate Women Artists to Watch\nDiscover and collect works by trailblazing artists gaining overdue acclaim.\nBrowse Works\nJavier Cerda Morey, Moments Before the Break, 2025.\nNew to Artsy\nOur curators handpick fresh works from galleries across the globe.\nBrowse Works\nSukwon Park, Accumulation 1936, 2019\nGana Art\nDiscover works by Sukwon Park and Jone-Tae Choi at TEFAF Maastricht.\nBrowse Works\nSkip to beginning of content\nPage 1 of 4\nPage 1 of 4\nFeatured\nArtsy Editorial\n7 Artists to Follow If You Like Sofia Coppola\nArtsy Curatorial\nLate Women Artists in the Spotlight\nArtsy Editorial\nJoël Andrianomearisoa Takes a Couture Approach to His Elegant Canvases\nArtsy Curatorial\nFeast for the Eyes\nCurators’ Picks\nThe best works on Artsy, all available now.\nView All Works\nIvan Arlaud\nDalt Vila, Eivissa (la Ciutat Alta) , 2025\nsobering\n€2,800\nXiangjie Rebecca Wu\nJoker and The Queen II, 2023\nLATITUDE Gallery New York\nUS$2,500–US$5,000\nRachel Klinghoffer\nI’m with my girls and we all need space, 2022\nDrawing Rooms\nUS$1,400\nBrian Rochefort\nPaint Can, 2024\nMASSIMODECARLO\nUS$1,600\nSam Gilliam\nUntitled, 1978\nCaviar20\nUS$18,250\nMelody Tuttle\nReflection, 2025\nRhodes\n£6,750\nArthur Lemonier\nDyptique 1, 2025\nKetabi Bourdet\n€2,000\nAnna Tubau\n\"Solitude\". Figurative, minimalist, human figure, portrait, 2022\nOCCO Art Gallery\n€950\nThomas Daskalakis\nOct. 8 , 2025\nRedD Gallery\n€7,000\nChris Lux\nThree in the Swamp, 2022\nBerggruen Gallery\nUS$10,000–US$15,000\nKika Carvalho\nItaúnas, 2025\nPortas Vilaseca Galeria\n€1,500\nBecky Suss\nMiss Beanpoles's Apartment, 2020\nJack Shainman Gallery\nUS$50,000–US$75,000\nWill Fice\nLying Figure, 2024\nPatrick Davies Contemporary Art\n£1,650\nElizabeth Catlett\nWhich Way, 1973\nStella Jones Gallery\nUS$12,000\nMadeleine Hatz\nPlanets 1, 2024\nGalleri Duerr\n€2,000\nLee Dawson\nGood and Evil United by The Flame, 2025\nHyacinth Gallery\nUS$11,000\nChico da Silva\nUntitled, 1975\nGaleria Conte\nUS$9,500\nKate Mary\nInterior Patterns, Nice, 2025\nsobering\n€2,800\nLindsay Mueller\nA Leaf Apiece, 2025\nAdah Rose Gallery\nUS$450\nBilly Gibney\nHeirloom I, 2025\nMXM Galeria\n€5,500–€7,000\nArtsy Editorial\nExplore Editorial\nArt Market\n5 Leading Women Collectors Share Their Must-Know Women Artists\nBy Annabel Keenan\nMar 17, 2025\nArt Market\n5 Outstanding Artworks at TEFAF Maastricht 2025\nBy Arun Kakar\nMar 14, 2025\nArt\n5 Standout Artists at the Sharjah Biennial 2025\nBy Josie Thaddeus-Johns\nMar 13, 2025\nArt\nChico da Silva’s Mystical Paintings Are Enchanting the Art World Once Again\nBy Maxwell Rabb\nMar 12, 2025\nArt\nJoël Andrianomearisoa Takes a Couture Approach to His Elegant Canvases\nBy Sarah Moroz\nMar 12, 2025\nArt\n7 Artists to Follow If You Like Sofia Coppola\nBy Alina Cohen\nMar 11, 2025\nArt Market\nARCOmadrid 2025 Highlights a Buoyant Spanish Art Market\nBy Veena McCoole\nMar 10, 2025\nAt Auction\nView All Auctions\nCurators’ Picks\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nArtist Name\nArtwork Title\nPartner\nPrice\nFeatured Shows\nExplore All Shows\nExample Exhibition Title\nExample Partner\nJan 0 - Jan 0, 0000\nExample Exhibition Title\nExample Partner\nJan 0 - Jan 0, 0000\nExample Exhibition Title\nExample Partner\nJan 0 - Jan 0, 0000\nExample Exhibition Title\nExample Partner\nJan 0 - Jan 0, 0000\nExample Exhibition Title\nExample Partner\nJan 0 - Jan 0, 0000\nExample Exhibition Title\nExample Partner\nJan 0 - Jan 0, 0000\nCurrent Fairs & Events\nView All Fairs & Events\nName of Fair 0000\nJan 00th – Jan 00th 0000\nName of Fair 0000\nJan 00th – Jan 00th 0000\nName of Fair 0000\nJan 00th – Jan 00th 0000\nName of Fair 0000\nJan 00th – Jan 00th 0000\nName of Fair 0000\nJan 00th – Jan 00th 0000\nName of Fair 0000\nJan 00th – Jan 00th 0000\nFeatured Galleries\nView All Galleries\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nTrending Artists on Artsy\nView All Artists\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999\nArtist Name\nNationality, b. 9999"
  },
  {
    "url": "https://www.metmuseum.org/blogs",
    "text": "Perspectives\nPerspectives\nThe Met’s home for deep dives on art, interviews, personal essays, scientific discoveries, and more.\nFeatured\nVIDEO\nExhibition Tour — Caspar David Friedrich: The Soul of Nature\n\nJoin Alison Hokanson, Curator in the Department of European Paintings, and Joanna Sheers Seidenstein, Assistant Curator in the Department of Drawings and Prints, along with Max Hollein, Marina Kellen French Director and CEO, to virtually explore Caspar David Friedrich: The Soul of Nature.\n\nFebruary 20\nThe Monumental Calligraphy of Tong Yang-Tze\nExplore how the Taiwanese artist’s Great Hall Commission invites a transhistorical conversation about the art of writing\nLesley Ma\nFebruary 28\nVIDEO\nThe Free Black Women’s Library | Civic Practice Partnership 2023–2025\n“Part of what inspired the project was wanting to create something that really centered the brilliance and creativity of Black women writers and the transformative possibilities that come with reading.”\nOlaRonke Akinmowo\nApril 25, 2024\nVIDEO\nThe Museum as Muse Featuring Artist Sarah Sze\nJoin artist Sarah Sze as she explores new offerings from The Met collection that inspire her work.\nFebruary 7\nDomestic Fantasies\nHistoric paper dolls from the Drawings and Prints collection tell a story of conspicuous consumption and evolving social values.\nLiliya Dashevski\nMarch 12\nThe Latest\nView all\nVIDEO\nThe Free Black Women’s Library: Pretty Little Brick | Civic Practice Partnership 2023–2025\nMarch 12\nDomestic Fantasies\nMarch 12\nLayering the Ottoman Past\nMarch 11\nVIDEO\nAssembling a Delftware flower pyramid\nMarch 4\nThe Monumental Calligraphy of Tong Yang-Tze\nFebruary 28\nFROM THE VAULTS\n|\nVIDEO\n“Woods” by W. H. Auden: An Optical Poem, 2025\nFebruary 21\nSeries from The Met\nView all\nThe Artist Project\nWhat artists see when they look at The Met\nImmaterial\nA podcast spanning 5,000 years of art, one material at a time\nFrom The Vaults\nFilms from the Museum’s extensive moving-image archive\nWomen's History\nView all\n\nThese stories illuminate the cultural contributions women have made throughout the history of art.\n\nVIDEO\nThe Free Black Women’s Library: Pretty Little Brick | Civic Practice Partnership 2023–2025\nDuring her CPP residency, artist OlaRonke Akinmowo challenged herself to create a writers collective as an expansion of the mission of The Free Black Women’s Library.\nMarch 12\nDomestic Fantasies\nHistoric paper dolls from the Drawings and Prints collection tell a story of conspicuous consumption and evolving social values.\nLiliya Dashevski\nMarch 12\nThe Abiding Influence of Sor Juana\nA new opera at The Met Cloisters reinterprets the Mexican writer’s magnum opus.\nEmery Kerekes\nJanuary 23\nFrom the Archives\nView all\n\nArticles, images, and film from The Met's 150-year history.\n\nVIDEO\nFROM THE VAULTS\n“Woods” by W. H. Auden: An Optical Poem, 2025\nListen to an optical poem illustrating W. H. Auden’s recitation of “Woods” with artworks from The Met collection, juxtaposed with footage of wildlife in Kingston, New York.\nFebruary 21\nVIDEO\nFROM THE VAULTS\nMoon Art, 1969\nArt critic Aline B. Saarinen offers a poetic consideration of the moon’s significance across time and cultures.\nJanuary 16\nThe Art of Dying\nA brief history of The Met’s artist obituary scrapbooks.\nJames Moske\nOctober 16, 2024\nIn Circulation\nView all\n\nRead articles and the latest news about The Metropolitan Museum of Art's Libraries' collections, activities, and research related to the history of art.\n\nBenin Art in Auction Catalogs\nWatson Library’s contribution to the Digital Benin project via the Internet Archive.\nAmy Hamilton\nFebruary 19\nNew “Blooks” in Watson\nThe Dr. Lynn Geringer Heckman and Dr. Bruce Heckman Gift of Book Objects.\nMindell Dubansky\nJanuary 22\nFolio Shift: (Space) Raiders of the (Not) Lost Art\nLibrary books using warehouse storage.\nJohn Lindaman\nDecember 18, 2024\nExplore content by topic:\nAsian Pacific American Heritage\nBehind the Scenes\nBlack History\nFashion\nFor Families\nFrom the Archives\nIdentity\nNative American and Indigenous Heritage\nNature\nOn View\nPublic Space\nProvenance"
  },
  {
    "url": "https://www.louvre.fr/en/explore",
    "text": "Back to Home\n\nExplore\n\nEXPLORE\nThe treasures of the Louvre palace and collections\nCollections\n\nThe Collections database consists of entries for more than 500,000 works in the Musée du Louvre and Musée National Eugène-Delacroix.\n\nExplore the collections  \n\nLife at the museum\n\nAll year round, the Louvre offers new things to see and do! Here you will find all the latest news on the museum’s ever-changing collections, contemporary art installations, life behind the scenes at the Louvre, and more.\n\nFind out what’s new at the museum \n\nVisitor trails\n\nNot sure where to start? Follow a step-by-step guide on a trail tailored to fit the subjects that interest you and the amount of time you plan to spend at the museum.\n\nOur visitor trails \n\nThe palace\n\nExplore the former palace of the kings of France, now the largest museum in the world, and dive into its collection, encompassing nearly 10,000 years of art history.\n\nExplore the palace \n\nThe gardens\n\nThe Carrousel and Tuileries Gardens are an integral part of the National Estate of the Musée du Louvre. As historic as they are ideal for taking a stroll, the gardens offer a range of family-friendly activities as diverse as the seasons all year round.\n\nMore information "
  },
  {
    "url": "https://www.goodreads.com",
    "text": "Discover & read more\nContinue with Amazon\nContinue with Apple\nSign up with email\nBy creating an account, you agree to the Goodreads Terms of Service and Privacy Policy.\nAlready a member? Sign In\nDeciding what to read next?\n\nYou’re in the right place. Tell us what titles or genres you’ve enjoyed in the past, and we’ll give you surprisingly insightful recommendations.\n\nWhat are your friends reading?\n\nChances are your friends are discussing their favorite (and least favorite) books on Goodreads.\n\nWhat will you discover?\n\nBecause Brian liked…\n\nHe discovered:\n\nDecision-making, Sociology, Marketing\n\nBecause Shomeret liked…\n\nShe discovered:\n\nPsychology, Animals, Science, Nature\n\nSearch and browse books\nArt\nBiography\nBusiness\nChildren's\nChristian\nClassics\nComics\nCookbooks\n\nEbooks\nFantasy\nFiction\nGraphic Novels\nHistorical Fiction\nHistory\nHorror\nMemoir\n\nMusic\nMystery\nNonfiction\nPoetry\nPsychology\nRomance\nScience\nScience Fiction\n\nSelf Help\nSports\nThriller\nTravel\nYoung Adult\nMore genres\nQuotes\n“Be yourself; everyone else is already taken.”\n― Oscar Wilde\nBest quotes\nLove quotes\nInspirational quotes\nFunny quotes\nMotivational quotes\nLife quotes\nFriends quotes\nPositive quotes\nMore quotes\nGoodreads Choice Awards: Readers' Favorite Books 2024\nReaders' Favorite 2024\nReaders' Favorite Fiction\nReaders' Favorite Historical Fiction\nReaders' Favorite Mystery & Thriller\nReaders' Favorite Romance\nReaders' Favorite Romantasy\nReaders' Favorite Fantasy\nReaders' Favorite Science Fiction\nReaders' Favorite Horror\nReaders' Favorite Debut Novel\nReaders' Favorite Audiobook\nReaders' Favorite Young Adult Fantasy\nReaders' Favorite Young Adult Fiction\nReaders' Favorite Nonfiction\nReaders' Favorite Memoir\nReaders' Favorite History & Biography\nNews & Interviews\nReaders' 84 Most Anticipated Books of Spring\n59 likes · 11 comments\nLove lists?\n   \nBest Crime & Mystery Books\n7,280 books | 15,185 voters\n   \nBest Books of the 20th Century\n7,824 books | 49,734 voters\n   \nBest for Book Clubs\n13,836 books | 17,436 voters\n\nMore book lists\n\nAre you an author or a publisher?\n\nGain access to a massive audience of book lovers. Goodreads is a great place to promote your books.\n\nAuthor program    Advertise\nCOMPANY\nAbout us\nCareers\nTerms\nPrivacy\nInterest Based Ads\nAd Preferences\nHelp\nWORK WITH US\nAuthors\nAdvertise\nAuthors & ads blog\nCONNECT\n \n \n© 2025 Goodreads, Inc.\nMobile version"
  },
  {
    "url": "https://www.scientificamerican.com",
    "text": "Scientific American\nTHE SCIENCE OF PARENTING\nMARCH 17, 2025\n\nShould Kids Do Chores?\n\nThey may tell us they hate chores, but kids who help around the house report feeling accomplished and competent, not to mention happy\n\nMEGHA SATYANARAYANA\n\nTECHNOLOGY\nMARCH 17, 2025\n\nBending Ultrasonic Beams Creates ‘Audible Enclaves’ Where They Cross\n\nDAN VERGANO\n\nNATURAL DISASTERS\nMARCH 17, 2025\n\nWhat Does a Wildfire-Resistant House Look Like?\n\nANDREA THOMPSON\n\nPUBLIC HEALTH\nMARCH 17, 2025\n\nUSAID Funding Saved Millions of Children’s Lives. Recent Cuts Put It in Jeopardy\n\nTANYA LEWIS\n\nGAMES\nMARCH 17, 2025\n\nScientific American Curiosities: Power Up\n\nSARAH LEWIN FRASIER\n\nEVOLUTION\nMARCH 17, 2025\n\nHow Iguanas Got from North America to Fiji Millions of Years Ago\n\nJACK TAMISIEA\n\nRENEWABLE ENERGY\nMARCH 17, 2025\n\nWorld's First Carbon Removal Plant Powered Directly by Wind Planned\n\nCORBIN HIAR, E&E NEWS\n\nNEUROLOGY\nMARCH 17, 2025\n\nNew Form of Parkinson's Treatment Uses Real-Time Deep-Brain Stimulation\n\nSUSAN KREIMER\n\nMICROBIOLOGY\nMARCH 17, 2025\n\nFour Ways the COVID-Causing Virus Changed Science\n\nEWEN CALLAWAY, NATURE MAGAZINE\n\nExplore Topics\nView All Stories\nMarch 2025 Issue\nNEUROSCIENCE\n\nThe Brain Science of Elusive ‘Aha! Moments’\n\nJOHN KOUNIOS, YVETTE KOUNIOS\n\nPUBLIC HEALTH\n\nThe Beauty of ‘Slow Flowers’ versus the Pretty Poison of Plants Grown with Dangerous Chemicals\n\nMARYN MCKENNA\n\nPLANETARY SCIENCE\n\nWhere Are the Universe’s Missing Planets?\n\nDAKOTAH TYLER\n\nEVOLUTIONARY BIOLOGY\n\nThis Backyard Bird Has a Lot to Teach Us about Sex Variability\n\nDONNA L. MANEY\n\nQUANTUM PHYSICS\n\nIs It Time to Redefine Time?\n\nJAY BENNETT\n\nAGRICULTURE\n\nToo Much Salt in the Soil Is No Problem for These Crops\n\nRACHEL PARSONS\n\nView Full Issue\nExplore Archive\nGames\nSpellements\n\nCreate as many words as you can!\n\nMath Puzzles\n\nStretch your math muscles with these puzzles.\n\nAll Games\nScience inspired games, puzzles and quizzes\nSpecial Edition\nARTIFICIAL INTELLIGENCE\n\nInside the AI Competition That Decoded an Ancient Herculaneum Scroll\n\nTOMAS WEBER\n\nARTIFICIAL INTELLIGENCE\n\nBuilding Intelligent Machines Helps Us Learn How Our Brain Works\n\nGEORGE MUSSER\n\nARTIFICIAL INTELLIGENCE\n\nGod Chatbots Offer Spiritual Insights on Demand. What Could Go Wrong?\n\nWEBB WRIGHT\n\nBEHAVIOR\n\nArtificial Intelligence Could Finally Let Us Talk with Animals\n\nLOIS PARSHLEY\n\nCOMPUTING\n\nWill Machines Ever Become Conscious?\n\nCHRISTOF KOCH\n\nARTIFICIAL INTELLIGENCE\n\nScientists Are Putting ChatGPT Brains Inside Robot Bodies. What Could Possibly Go Wrong?\n\nDAVID BERREBY\n\nView Full Issue\nExplore Archive\nGet Our Daily Newsletter\nI agree my information will be processed in accordance with the Scientific American and Springer Nature Limited Privacy Policy.\nSign Up\n\nThank you for signing up!\n\n \n\nCheck out our other newsletters\n\nPodcasts\nMARCH 17, 2025\n\nNew NASA Missions, Bonus Moons for Saturn and Whale Urine That Balances Ocean Chemistry\n\nRACHEL FELTMAN, FONDA MWANGI, ALEX SUGIURA\n\nROBOTICS\nMARCH 14, 2025\n\nRobotics Researchers Bring The Electric State’s Cosmo to Life\n\nRACHEL FELTMAN, JEFFERY DELVISCIO, FONDA MWANGI, ALEX SUGIURA\n\nPUBLIC HEALTH\nMARCH 12, 2025\n\nOn COVID’s Fifth Anniversary, the U.S. Remains Vulnerable to Infectious Disease\n\nRACHEL FELTMAN, FONDA MWANGI, JEFFERY DELVISCIO\n\nVACCINES\nMARCH 10, 2025\n\nMeasles Misinformation Sparks Concern, Supreme Court Weakens EPA, and Scientists Engineer Woolly Mice\n\nRACHEL FELTMAN, FONDA MWANGI, ALEX SUGIURA\n\nBOOKS\nMARCH 7, 2025\n\nAuthor John Green on How Tuberculosis Shaped Our Modern World\n\nRACHEL FELTMAN, FONDA MWANGI, NAEEM AMARSY, ALEX SUGIURA\n\nMore Podcasts\nPopular Stories\nANTHROPOLOGY\nMARCH 14, 2025\n\nAncient DNA Shows Stone Age Europeans Voyaged by Sea to Africa\n\nRoughly 8,000-year-old remains unearthed from present-day Tunisia held a surprise: European hunter-gatherer ancestry\n\nEWEN CALLAWAY, NATURE MAGAZINE\n\nNUTRITION\nMARCH 14, 2025\n\nScientist’s Study Led FDA to Ban Red No. 3 Food Dye. Yet He Says It Is Safe\n\nAlmost 40 years ago, Joseph Borzelleca published a study on the food coloring Red No. 3. The FDA cited his work when banning the additive in January. But the researcher says the dye is safe\n\nPHIL GALEWITZ, KFF HEALTH NEWS\n\nTHE UNIVERSE\nMARCH 14, 2025\n\nAre the Colors in Astronomical Images ‘Real’?\n\nIn colorful photographs of galaxies, stars, planets, and more, what you see isn’t necessarily what you get\n\nPHIL PLAIT\n\nMATHEMATICS\nMARCH 10, 2025\n\nThe 9 Unsolved Mysteries Mathematicians Can’t Stop Thinking About\n\nMathematicians discuss some of the most compelling unsolved problems in the field\n\nRACHEL CROWELL\n\nOPINION\nMARCH 13, 2025\n\nIndiana’s House of Representatives Once Voted Unanimously to Change the Value of Pi\n\nHow an incorrect value of pi almost got codified into law\n\nJACK MURTAGH\n\nCONSCIOUSNESS\nMARCH 11, 2025\n\nThe Secret to Understanding Animal Consciousness May Be Joy\n\nAnimal emotions—including joy—may be key markers of conscious beings\n\nJACEK KRYWKO\n\nView All Stories"
  },
  {
    "url": "https://www.newscientist.com",
    "text": "Physics\nGravity may arise from quantumness of space\nScientists have long sought the particle that carries the force of gravity, but a new theoretical model tosses out that idea entirely – and shows how it could be tested in experiments\n\nNews\n\nSubscriber-only\n\nLife\nWhat the extraordinary medical know-how of wild animals can teach us\n\nFeatures\n\nSubscriber-only\n\nMathematics\nMathematicians solve 125-year-old problem to unite key laws of physics\n\nNews\n\nSubscriber-only\n\nNewsletters\n\nEnjoy our expert-curated email newsletters delivered straight to your inbox on a daily, weekly or monthly basis with New Scientist.\n\nExplore our newsletters\nSpace\nMost quakes on Mars happen during the summer – and we don’t know why\n\nNews\n\nSubscriber-only\n\nPhysics\nLHC finds intriguing new clues about our universe's antimatter mystery\n\nNews\n\nSubscriber-only\n\nSpace\nRolling boulders on Titan could threaten NASA's Dragonfly mission\n\nNews\n\nSubscriber-only\n\nSpace\nHow a start-up plans to mine the moon for a rare form of helium\n\nNews\n\nSubscriber-only\n\nSpace\nGiant Milky Way-like galaxy formed unusually soon after the big bang\n\nNews\n\nSubscriber-only\n\nMind\nWhat makes a good day a good day, according to science\n\nNews\n\nSubscriber-only\n\nScience-inspired experiences\nTours, cruises, expeditions and short breaks covering a range of scientific topics, including astronomy, archaeology, palaeontology, geology, history and nature, offering something for all those with a curious mind. \nFind out more\n\nAdvertisement\n\nHealth\nA fresh understanding of tiredness reveals how to get your energy back\nRadical new insights from the science of interoception – how the body senses its internal state – explain the real reasons we feel tired all the time, and how to re-energise\n\nFeatures\n\nSubscriber-only\n\nNew Scientist covers the latest developments in science, technology, health and the environment\n\nSee more latest news\nHumans\nThe epic scientific quest to reveal what makes folktales so compelling\n\nFeatures\n\nSubscriber-only\n\nPhysics\nThe physicist on a mission to spark a quantum industrial revolution\n\nFeatures\n\nSubscriber-only\n\nHealth\nThe alarming rise of colorectal cancer diagnoses in people under 50\n\nFeatures\n\nSubscriber-only\n\nSpace\nThe cosmic landscape of time that explains our universe's expansion\n\nFeatures\n\nSubscriber-only\n\nTechnology\nThe critical computer systems still relying on decades-old code\n\nFeatures\n\nSubscriber-only\n\nHealth\nWhy the world’s longevity hotspots may not be all they seem\n\nFeatures\n\nSubscriber-only\n\nThis week's magazine\n\n15 March 2025\n\nSociety\n\nTerrific drama shows the battle for girls' education in Afghanistan\n\nHumans\n\nThe epic scientific quest to reveal what makes folktales so compelling\n\nPhysics\n\nThe physicist on a mission to spark a quantum industrial revolution\n\nHealth\n\nA fresh understanding of tiredness reveals how to get your energy back\n\nRead the latest issue\nSee past issues\nMathematics\nAt its core, mathematics is a tool for revealing connections and patterns, making it a vital part of every science and in the development of new technology. Discover how mathematicians study theoretical objects to reveal powerful insights in this selection of stories.\nMathematics\nMathematicians have discovered a mind-blowing new kind of infinity\nIt may sound strange, but mathematicians have created an entire ladder of infinities, each larger than the next. Now a new kind of infinity threatens to upset that order, and perhaps redefine the structure of the mathematical universe\n\nNews\n\nSubscriber-only\n\nMathematics\nThe mathematician who worked out how to time travel\n\nNews\n\nSubscriber-only\n\nMathematics\nOctonions: The strange maths that could unite the laws of nature\n\nFeatures\n\nSubscriber-only\n\nMathematics\nMathematicians have found a new way to identify prime numbers\n\nNews\n\nSubscriber-only\n\nPopular articles\n\nTrending New Scientist articles\n\n1\nMathematicians solve 125-year-old problem to unite key laws of physics\n2\nGravity may arise from quantumness of space\n3\nAI scientists are sceptical that modern models will lead to AGI\n4\nA fresh understanding of tiredness reveals how to get your energy back\n5\nRevealed: How the UK tech secretary uses ChatGPT for policy advice\n6\nWhat the extraordinary medical know-how of wild animals can teach us\n7\nGiant Milky Way-like galaxy formed unusually soon after the big bang\n8\nYou could train your brain to be less fooled by optical illusions\n9\nThe 13 drugs and supplements that could slow brain ageing\n10\nRolling boulders on Titan could threaten NASA's Dragonfly mission\nEditor's pick\nA selection of recent articles and gems from the New Scientist archive\nLife\nPermafrost mummies are unlocking the secrets of prehistory\nThe frozen remains of animals like mammoths, wolves and cave lions offer the most detailed picture yet of the last glacial period\n\nFeatures\n\nSubscriber-only\n\nHealth\nInside the new therapies promising to finally beat autoimmune disease\n\nFeatures\n\nSubscriber-only\n\nSociety\nThe research that will help you not suck at digital communication\n\nFeatures\n\nSubscriber-only\n\nLife\nThe story of mirror life: From intriguing idea to unprecedented threat\n\nFeatures\n\nSubscriber-only\n\nEvents\nScience events covering a wide range of topics all brought to you by world-class science speakers and experts\nInstant Expert\nJoin cosmology experts as they reveal the latest research about our universe\nFrom the nature of dark matter and dark energy to the origins of the universe itself, scientists are grappling with questions that challenge our fundamental understanding of reality.\n\nCongress Centre, London\n\n15 March 2025\n\nInstant Expert\nFind out how our minds and bodies are inextricably linked\n\nCongress Centre, London\n\n26 April 2025\n\nOnline Event\nFree Online Event: The future of healthcare: Emerging technologies shaping a new era of care\n\nOnline\n\n26 March 2025\n\nOnline Event\nFree Online Event: New Scientist Emerging Technologies Summit 2025: Event preview\n\nOnline\n\n30 April 2025\n\nPodcasts\nListen to our weekly science and technology round-up show, as well as your other favourite New Scientist podcasts\nWeekly\nAmerica is turning its back on science and the cosmos; photosynthesis limits; mysterious memory illusion\n\nPodcast\n\nFree\n\nWeekly\nChimps, bonobos and humans have more in common than you might think\n\nPodcast\n\nFree\n\nWeekly\nHow to finally get a good night’s sleep - with science\n\nPodcast\n\nFree\n\nExplore all of our podcasts\n\nNew episodes every week, available wherever you listen to podcasts\n\nVideo\nWatch the latest science news, discoveries and big ideas from New Scientist's video team\nVideo\nCan art help scientists better understand the quantum universe?\n\nVideo\n\nFree\n\nVideo\nClimate experiment predicts how trees may respond to future CO2 levels\n\nVideo\n\nFree\n\nVideo\nHow the EDSAC computer changed science in the 1940s and 50s\n\nVideo\n\nFree\n\nVideo\nPalaeontologist reviews the most memorable moments in dinosaur movies\n\nVideo\n\nFree\n\nVideo\nBasalt, biochar and compost, this farm is a carbon-capture testbed\n\nVideo\n\nFree\n\nVideo\nDo world record snowflakes observed in 1887 stand up to science?\n\nVideo\n\nFree\n\nEngaging stories created in partnership with New Scientist CoLab\nTo discover more visit colab.newscientist.com\nSTEM\nHow to boost diversity in UK STEM careers\nDiverse teams are more innovative, solve problems faster and offer perspectives and ideas\n\nCoLab with GSK\n\nLife sciences\nThe science behind lower carbon pigs\n\nCoLab with the PIC\n\nArtificial Intelligence\nHow Industrial AI is boosting sustainability\n\nCoLab with Siemens\n\nHealth\nPrioritising the global brain health crisis\n\nCoLab with Roche\n\nAdvertisement"
  },
  {
    "url": "https://www.wired.com",
    "text": "MOST RECENT\nTODAY’S PICKS\nSTICKER SHOCK\nDOGE’s Cuts at the USDA Could Cause US Grocery Prices to Rise and Invasive Species to Spread\nThousands of US Department of Agriculture employees, including food inspectors and disease-sniffing dog trainers, remain out of work, leaving food to rot in ports and pests to proliferate.\nKATE KNIBBS\nCHANGE OF PLAN\nUnder Trump, AI Scientists Are Told to Remove ‘Ideological Bias’ From Powerful Models\nWILL KNIGHT\nDIGITAL CULTURE\nThe Anti-DEI Agenda Is Reprogramming America\nJASON PARHAM\nEverything You Say to Your Echo Will Soon Be Sent to Amazon, and You Can’t Opt Out\nSCHARON HARDING, ARS TECHNICA\nHow to Shop for Vinyl Records Online\nPARKER HALL\nBitwarden Is the Best Deal in the Password Manager Market\nSCOTT GILBERTSON\nThe Best Video Doorbell Cameras\nSIMON HILL\nOur 8 Favorite Down Comforters\nLOURYN STRAMPE\nMUSK TAKEOVER\nTAKEOVER\nThese Are the 10 DOGE Operatives Inside the Social Security Administration\nMAKENA KELLY AND DAVID GILBERT\nThe team working at the Social Security Administration appears to be among the largest DOGE units deployed to any government agency.\nTAKEOVER\nInside Elon Musk’s ‘Digital Coup’\nWIRED POLITICS LAB\nThe United States of Elon Musk Inc.\nAI\nDemocrats Demand Answers on DOGE's Use of AI\nSHUTDOWN\nElon Musk Has Wanted the Government Shutdown\nBUSINESS\nDesigner Ray-Ban Metas, Topless EVs to Mock Elon Musk, and Portable Pizzas—Here’s Your Gear News of the Week\nAn AI Coding Assistant Refused to Write Code—and Suggested the User Learn to Do It Himself\nMeta Tries to Bury a Tell-All Book\nCULTURE\nThe 23 Best Shows on Amazon Prime Right Now\nCanadian Devs Are Backing Out of Attending GDC\nThe 23 Best Movies on Apple TV+ Right Now\nGEAR\nHow Do I Find a Mattress?\nThe Renault 5 Turbo 3E, the World’s First Electric Mini-Supercar, Looks as Bonkers as We Hoped\nWhich Amazon Echo or Alexa Speaker Is Best for You?\nPOLITICS\n‘People Are Scared’: Inside CISA as It Reels From Trump’s Purge\nHow a Government Shutdown Would Help Elon Musk\nOPM Watchdog Says Review of DOGE Work Is Underway\nSCIENCE\nUndergraduate Disproves 40-Year-Old Conjecture, Invents New Kind of Hash Table\nA Tanker Collision Threatens One of the UK’s Most Important Coast Lines\nWildfires Are One of Hurricane Helene’s Lasting Legacies\nSECURITY\nSecurity News This Week: End-to-End Encrypted Texts Between Android and iPhone Are Coming .\nA New Era of Attacks on Encryption Is Starting to Heat Up\nHow to Use Signal Encrypted Messaging\nTHE BIG STORY\nMAX IMPACT\nThe Worst 7 Years in Boeing’s History—and the Man Who Won’t Stop Fighting for Answers\nLAUREN SMILEY\nFatal crashes. A door blowout. Grounded planes. Inside the citizen-led, obsessive campaign to hold Boeing accountable and prevent the next disaster.\nDIRTY DEALS\nThis Russian Tech Bro Helped Steal $93 Million and Landed in US Prison. Then Putin Called\nINFOHAZARD\nThe Delirious, Violent, Impossible True Story of the Zizians\nTHE BIG STORY\nWhen Fires Rage, Millions Turn to Watch Duty. Meet the Guy Who Made It\nCAPTURED\nThe Untold Story of a Crypto Crimefighter’s Descent Into Nigerian Prison\nREVIEWS AND BUYING GUIDES\nBUYING GUIDE\nThese 3-in-1 Wireless Chargers Can Juice Up Your iPhone, Apple Watch, and AirPods at the Same Time\nSIMON HILL AND JULIAN CHOKKATTU\nKeep your iPhone, Apple Watch, and AirPods topped up with these WIRED-tested docking systems.\nMEMORY LANE\nThe Best RAM for Your PC\nBUYING GUIDE\nThe Best Xbox Accessories You Can Buy\nMACHO MAN\n16 Best Gifts for Men, Manly Men, and Menly Man Men\nPRODUCT REVIEW\nSun Home’s Luminar Sauna Did Not Convert Me to Infrared Saunas\nWIRED CLASSICS\nA FEVER SPREADS\nFear, Misinformation, and Measles Spread in Brooklyn\nAMANDA SCHAFFER\nOriginally published June 2019: Measles is back, health care workers are racing to contain it, and parents of vulnerable children are frantic. How a fever spread in a tight-knit community.\nOF MICE AND MEN\nHow the Inbred Lab Mouse Helps Reprogram the Human Genome\nMATCHMAKER\nInside the 23-Dimensional World of Your Car’s Paint Job\nWE ❤️ HARDWARE\nI Saw the Face of God in a Semiconductor Factory\nLOVE, ACTUARIALLY\nHow a Math Genius Hacked OkCupid to Find True Love\nTRENDING STORIES\nTOP STORIES IN THE LAST 48 HOURS\nMeta Tries to Bury a Tell-All Book\nMark Zuckerberg might be in his post-fact-checking-era. But that hasn’t stopped Meta from going after the author of Careless People.\nSTEVEN LEVY\nUndergraduate Disproves 40-Year-Old Conjecture, Invents New Kind of Hash Table\nA young computer scientist and two colleagues show that searches within data structures called hash tables can be much faster than previously deemed possible.\nSTEVE NADIS\nCanadian Devs Are Backing Out of Attending GDC\nAmid deteriorating relations between the US and Canada, many Canadian video game developers are opting not to travel to San Francisco for next week’s Game Developers Conference.\nMEGAN FAROKHMANESH\nInside Elon Musk’s ‘Digital Coup’\nMusk’s loyalists at DOGE have infiltrated dozens of federal agencies, pushed out tens of thousands of workers, and siphoned millions of people’s most sensitive data. The next step: Unleash the AI.\nMAKENA KELLY, DAVID GILBERT, VITTORIA ELLIOTT, KATE KNIBBS, DHRUV MEHROTRA, DELL CAMERON, TIM MARCHMAN, LEAH FEIGER, AND ZOË SCHIFFER\nVIDEOS\nICON\nTECH SUPPORT\nKeanu Reeves Answers Motorcycle Questions With Gard Hollinger\nICON\nAUTOCOMPLETE INTERVIEW\nKe Huy Quan Answers The Web's Most Searched Questions\nICON\nTECH SUPPORT\nSurgeon Answers Transplant Questions\nICON\nON THE GRID\nWe Mapped Elon Musk's Entire Empire\nICON\nAUTOCOMPLETE INTERVIEW\nAlan Ritchson Answers The Web's Most Searched Questions\nICON\nTECH SUPPORT\nDungeon Master Brennan Lee Mulligan Answers DnD Questions\nICON\nINCOGNITO MODE\nYour Tesla Is Watching\nICON\nTECH SUPPORT\nHistorian Answers Renaissance Questions\nICON\nEVERY PIECE\nHow Every Piece of an iPhone Works\nICON\nAUTOCOMPLETE INTERVIEW\nDruski Answers The Web's Most Searched Questions"
  },
  {
    "url": "https://developer.mozilla.org",
    "text": "Resources for Developers,\nby Developers\n\nDocumenting web technologies, including CSS, HTML, and JavaScript, since 2005.\n\nSearch MDN\nSEARCH\n   ////////////   ////////////   ////////////   ////////////   ////////////   ////////////   ////////////\n  ++++++  ++++++  ++++++  ++++++  ++++++  ++++++  ++++++\n{{{{ }}}}  {{{{ }}}}  {{{{ }}}}  {{{{ }}}}  {{{{ }}}}  {{{{ }}}}  \n   ../../    ../../    ../../    ../../    ../../    ../../    ../../\n<></><></><></><></><></><></><></><></><></><></><></><></><></><></><></><></>\nAD\nFeatured articles\nBlog\nJavaScript Temporal is coming\n\nA new way to handle dates and times is being added to JavaScript. Let's take a look at Temporal, what problems it solves, the current state, and what you'll find in the new documentation about it on MDN.\n\nCSS\nCSS anchor positioning\n\nThe CSS anchor positioning module defines features that allow you to tether elements together. Certain elements are defined as anchor elements; anchor-positioned elements can then have their size and position set based on the size and location of the anchor elements to which they are bound.\n\nWeb APIs\nUsing the View Transition API\n\nThis article explains the theory behind how the View Transition API works, how to create view transitions and customize the transition animations, and how to manipulate active view transitions. This covers view transitions for both DOM state updates in a single-page app (SPA), and navigating between documents in a multi-page app (MPA).\n\nJavaScript\nTemporal\n\nThe Temporal object enables date and time management in various scenarios, including built-in time zone and calendar representation, wall-clock time conversions, arithmetics, formatting, and more. It is designed as a full replacement for the Date object.\n\nLatest news\n\nMDN 2024 content projects\ndeveloper.mozilla.org\n\n2 months ago\n\nA new learning experience on MDN\ndeveloper.mozilla.org\n\n3 months ago\n\nIntroducing the new MDN Community page\ndeveloper.mozilla.org\n\n5 months ago\nRecent contributions\n\nSynchronize with BCD v5.7.3\nmdn/content\n\n2 days ago\n\nRemove GamepadButton property list\nmdn/content\n\na day ago\n\nFix typo in \"CSS values and units\"\nmdn/content\n\na day ago\n\nchore: correct the image file name\nmdn/content\n\na day ago\n\n[ja] sync translated content\nmdn/translated-content\n\na day ago\n\nfix #38204\nmdn/content\n\na day ago\nContributor Spotlight\nYASH RAJ BHARTI\nMDN resonates with my passion to build a consistent and open web, where developers can learn and grow.\nGet involved →\n   ////////////   ////////////   ////////////   ////////////   ////////////   ////////////   ////////////\n  ++++++  ++++++  ++++++  ++++++  ++++++  ++++++  ++++++\n{{{{ }}}}  {{{{ }}}}  {{{{ }}}}  {{{{ }}}}  {{{{ }}}}  {{{{ }}}}  \n   ../../    ../../    ../../    ../../    ../../    ../../    ../../\n<></><></><></><></><></><></><></><></><></><></><></><></><></><></><></><></>\nAD"
  }
]